[{"id":"2025-12-18 02:58:11","content":"\n**工具**\n\n- [cc-switch](https://github.com/farion1231/cc-switch) 中转站API切换GUI，MCP、Skill 管理和配置  \n  在国内只能使用中转，因此有个 GUI 管理还是方便一点，另外 Skill 也 MCP 也能管理。我不太用 MCP，原因是烧不起，有那种 5 倍 token 干 1.5 倍的事的感觉。Claude Code 的调用方式已经觉得烧不起了。在这之前是终端写了几个设置环境变量的函数来凑合一下的，听说 cc-switch 是不用重启终端。  \n  真的蛮想复刻一下 ChatGPT 的深度研究 的，做好了帮找论文确实好用，但同时也是 token 杀手。Gemini 的深度研究我觉得不太好用，有太多不够权威的结果。Chatgpt 查的都是专门的学术网站，查不到会触发近义词搜索什么的，非常接近人类找论文的状态了，但调研一次 5刀 token 真的是轻轻松松，论文那四五个点的调研天天查天天改，反复迭代，最后留的都有百篇 reference，真的是查吐了。  \n  至于国内豆包那个结果，我只能说，呵……图一乐……\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[0,0]},{"id":"2025-12-15 10:53:00","content":"\n**剧**\n\n- 流星花园\n看到说是台湾超雄情侣搞笑片所以补了，放到现在这剧情可能会被喷死。当年看剧大家都不带脑子，只是觉得很欢乐。现在看剧都比较上纲上线。不过确实是嗑不到了，男主幼稚和自我中心得有点无语，但放在从前不像现在，从前基本上就是谁爱得多就是谁在付出的观念，也因此道德绑架现象比现多。道明寺吼得厉害，事实上是没有付出什么，他一直在向女主求爱，可女主经历的一切都是他带来的，而他没有能力解决问题，反而在女主最困难的时候视而不见。花泽类是F4里唯一一个靠谱的人。然后女主的塑造也是反复横跳，编剧为了写感情线硬让女主欠男主100万。倒是里面的姐姐都很靠谱，gl真的好嗑。\n\n感觉看太晚了，这部剧好多人撑起了后面十几年的星周刊。\n\n我好困，写两小时躺两小时，又通宵了，感觉心脏乱跳像要猝死了。而且好饿。没有皮质醇完全醒不了。\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[0,1]},{"id":"2025-12-13 02:59:22","content":"\n小红书莫名其妙有一条画给推了出去……之前我高强度改画了几天有点 Get 到小红书算法给人的推流感觉了。初始互动率高于一切，评论>点赞，有人评论就多下场聊，得让人感觉能有话讲而不是真好看赞一个就完了。况且画得又没有那么好看。\n\n最近领悟到一个事情是，画画就是一个纯感觉的事情。现在越来越多讲画画技法的了，和从前的条件天差地别。但画画用学技术的目的是和纯技术工种不一样的，学技术是还为了提升感受，去拼效率的话是打不过AI的，真的画得很好的人最终胜在表达而不是技法论。不过以上前提是基础好，真正扎实的基础说实话是无关技法的，如果说换个笔刷都画得很烂了只能是基础本身不够好，就和写字一样，基础好的用啥写都好看，换了个烂笔可能感觉很痛苦效率下降，但如果时间足够，对成品质量不会有太大的影响。\n\n另一个感觉是，画画基础其实是种感受，而不是理论。诚然你可以画透视线去推算是否正确，通过建模分析光影与亮暗，但这样可能会把“体积就是要画得伦伯朗那样黑”奉为圭臬。然后近代流行了对比后，又加上“体积就是在短调子里画得伦伯朗那样黑”。直到你看到一张图，几乎是色彩关系画的超强体积……嗯这次又要加个什么理论进去呢？到底什么决定了体积感呢？物体距离人眼的呈现的规律性色彩变化？但你看平设Icon，他们体积感又很强吗？然后再加一条，有规律变化且有明确的面的拐点……我觉得我理解体积是什么这事真的花了有五年，最终不得不承认回到了原点……体积是种感受。而我是那种体积感天崩选手，仅有的天赋点全去色彩上了。\n\n说回来在 AI 出来之前我是把喜欢分条列点的大纲的，视觉形式的实用主义者觉得这样很清晰。论文那样的写法对于Ne人非常不友好直接一整个大分心重点跑偏。但思维链 AI 出来之后，这所有东西都是分条列点的 Ne 味已经被滥用了……我觉得seq2seq本来就是天然Ne，使用大纲能增强抓重点的逻辑能力不奇怪，但有的东西真的不是 Ne-Ti 能解释的，过于强调逻辑也是一种非人感的 Pattern，但不强调逻辑上下文一长又在胡说八道……Fine，也不能说是一无是处吧。但是处不多。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[0,2]},{"id":"2025-12-12 22:33:55","content":"\n说来为什么静态博客能不能依赖就不用，其实只是我不想经常更新依赖。总想写点新东西不想把时间耗在维护上，而且维护这个什么也得不到。社区的项目大抵也是一样。其实我想把nextjs也换掉，ssg能力严重影响我细化过渡动画。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[0,3]},{"id":"2025-12-04 23:22:51","content":"\n大毛又是被赛博挖坟了，不知道遇到这第几个了。世界上确实是有人讨厌谁就看不得别人有找钱的能力的，并且呼吁所有人都别买他的课。感觉像那种拉帮结伙的校园霸凌的网络放大版。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[0,4]},{"id":"2025-11-25 19:27:22","content":"\n听些播客。\n\n- 如何有人说什么岗位在摸鱼，不要信一点，那是在能够胜任已有工作的基础上才有的事情。类似于一些自称五道口职业技术学校的人，他说是这么说，能这么做的门槛大家自己心理清楚。上班就是牛马，先需要做好上班的事情，做不好至少表现出负责认真。\n- 以前觉得很小市民的思维，其实真的就是小市民，别想，世界上没有那么多好事，大部分人都是苦逼的。不是我把事情想得很困难，而是有的事情本来就很困难，强行打破规定随心所欲的事，我干不出，有人习惯了人治社会下的人情世故，他干习惯了就等他吧，他说我不主动是他的问题。人不可以太自私利己，即便自己会觉得不舒服，忍着，世界塌不了。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[0,5]},{"id":"2025-11-20 00:00:01","content":"\n**妆造专场**\n- [如何剪法式刘海](http://xhslink.com/o/93eYXk54q9k ) 很粗略但有用\n- [如何科学剪刘海](http://xhslink.com/o/4dBt4wviMzM) 很详细，轻盈化边缘那个手好用。以上这两都没讲打薄。\n- [如何涂口红](https://b23.tv/KdimlKv) 口红涂法有讲究的，深唇得买个唇线笔。画成女差不多也是一个喷枪糊嘴，现在趋势就是喜欢雾化渐变浅裸色，原生像没眉毛和嘴巴最好。眉毛太黑几\n- [伪素颜变帅教程](https://v.douyin.com/sm64cRaYOKA/ 04/22 z@G.VL wFu:/ ) 发型决定90%。脸上最重要的是眉毛，其余只用干净就行。画成男就是在狂画结构。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[0,6]},{"id":"2025-11-16 05:39:33","content":"\n**社会**\n\n- [影视飓风的舆情，说明互联网已经烂完了](https://www.bilibili.com/video/BV1NCCkBKEaU) - 老蒋\n- [关于影视飓风近期舆情](https://www.bilibili.com/video/BV16YC3BrEDz) - 影视飓风\n- [人生的意义](https://weibo.com/6623286870/L0Y4MowIE) - alexheretochill\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[0,7]},{"id":"2025-11-07 18:32:23","content":"\n不管怎样，先行动起来吧，不论是动什么。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[0,8]},{"id":"2025-11-05 02:34:00","content":"\n情感形成的解构与爱。以下为个人理解，不包含更普世的三观。三观更加基础一些。\n\n一、 动物性\n\n1.1 基因与本能\n\n荷尔蒙水平上脑时，身体会产生对于“爱情”的感知。异性恋在接触异性时会自发感受到这样一种非自在，男性通常比女性更强。一个常见的现象是，两个男生睡在一起会被认为很奇怪，两个女生睡在一起就是纯睡觉。通常男性的动物性是强于女性的。\n\n1.2 反馈的爽感\n\n再简单的小游戏，反馈做足就会有人能一直玩下去。追求的过程就是不断获取对方反馈的过程。这也是为什么青春爱情片通常止步于追到手的那一刻。什么都已经得到了，归于平淡的生活，还有什么精彩与刺激可讲述呢？\n\n在谈恋爱时大多会注重动物性的体验，也可以称之为享乐主义。但仅凭动物性，难以长期相处。我个人认为，任何长期进行的消耗性行为都需要有更加客观的认知与对待方式。即便一腔热爱画画到老，相比起在热爱时狂画，更需要的是坚持。热爱画画的时刻会因为坚持反复到来，而放下后却是真的放下了。\n\n二、意识性\n\n1.1 沉没成本\n\n你所喜欢的、花了很多时间与精力获得的东西，会因为感受不到快乐就此丢掉他吗？对于长期的相处，你认为淡漠后就丢掉是好的选择吗？\n\n1.2 惯性\n\n长期的相处后，相比其他人，两个人会积累更多的共同话题，同时也会吵架。你是否会在失去他后感到不至于此？或是不习惯？\n\n1.3 责任\n\n当对方变成一个累赘，你会怎样对待呢？当你变成一个累赘，你期待怎样被对待呢？当你不想做一件事但不得不做时，你会如何选择呢？当世俗的原因让你们不得不分开时，又会如何选择呢？上世纪，很多丈夫离家去广州打工，妻子留在家里。你是丈夫，会在长期离家飞黄腾达后，遇到更好的人后，选择怎么做？你是妻子，会在感情牵绊淡漠而共同话语减少时，提出离婚吗？\n\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[0,9]}]