[{"id":"2025-11-03 18:45:55","content":"\n关于生命体征维持餐，完全是利大于弊，首先，是可以按时吃饭了。其次，会更加想吃点好吃的。只吃燕麦的问题也是，要吃够真的要吃太多东西了。但正常吃一大堆菜再吃一碗饭的话，可以吃很多。\n\n---\n\n基友对我真的太好了，以至于说一句谢谢都有点见外……嘛没事的，我大概能理解为什么会这样，她一直都没有变过。非常靠谱的好朋友真是遇到过好多，现在算是我自己变得太多，只能当花瓶，对的其实就算我什么都无法对等地提供，还是能勉强当花瓶。自从注意营养问题后，非常想拉她去做体检，因为这个事业批吃饭比我还随便。\n\n---\n\n失语症：网上有个梗，是一个失语症的妇女说一辆高速行驶的列车进入中国。当时觉得很好笑，同时也很好奇这是为什么。直到今天给电信说想改套餐，说出套餐这个词时，完全发出了毫不相关的另一个不知道是什么词，甚至可能不是词的音，耳朵听到后，在想我在说什么呢。这不是常规意义上的嘴瓢，更像嘴当时完全没和脑子建立连接一样自己说自己的。我发现自己前四个字不知道在说什么后，重新建立了一下脑和嘴的语言关联……\n\n---\n\n我决定还是要写 TODO。\n\n首先，生活 TODO 会和工作 TODO 分开。工作 TODO 之前一直在 Logseq里。有动力没日没夜地干的时候挺适合的。但可能不是很适合我。所以我弄在了 Notion Home，本来就有 Inbox。\n\n然后是，客户端 OR 网页？ 99% 的时间在用网页，习惯了就在一个浏览器里面切来切去。客户端快捷键值得一个 `Winkey+1`。Logseq 值得一个 `Winkey +2`。记笔记我还是觉得 Logseq 好用，虽然容易混乱。但默认是时间倒序的东西排列很适合学习与复习。\n\n------------\n\n好像又要搬家了，室友突然需要出国工作，导致他得提前违约。当然室友人品是非常 OK 的，对于我自身的经济亏损大概是只有搬家费和网费，但比起这些，找房子的时间和精力更加无价。他也帮忙考虑了，要么一直住这里到期，要么是帮我找一下他们也是要走的同事的合租。嗯……才被人口普查过又要搬走，所以我是搬到这里抽十年一次的 1% 人口普查的吗。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[0,0]},{"id":"2025-10-27 13:13:00","content":"\n第一视角。“你妈妈因为肺隔离了，现在淋巴瘤细胞癌细胞转移。”\n第一视角。“转移了已经是晚期了。”\n第一视角。“你爸爸退休了，为了支付医药费才去凉山州打工。”\n第三视角。“关我们什么事，这个事本来就应该 XX（我）来做。我下午得开车回去了。”\n因为各种十全补剂被迫精神异常稳定的我，在醒前因为皮酯醇升高，感受到了一点点微妙的波动，而梦让我醒了过来。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[0,1]},{"id":"2025-10-17 00:25:25","content":"\n不想写论文的理由之237：语言会塑造人。当画同人时觉察到自己的对白充斥着因果与论证时，我意识到这并不是我想要的。语言可以简练，可以客观，但不要刻意摒弃情绪，也不要不说人话，让人以为在做长难句阅读理解。我更想让语言是有节奏的，直观的，易于阅读与记忆的，如果能给人留下印象就更好了。\n\n逻辑重要，形式也重要。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[0,2]},{"id":"2025-10-11 11:33:45","content":"\n我已经完全放下了，真的只想找工作。然后还是劝交……然后我又焦虑了，不知道还要在这种没意义又不知道有没有结果的事上浪费多久。说实话，如果真能交，交这种垃圾论文，不如再开个能交的题（虽然这个事情很难，导师连发了4篇的A会的人的毕设都怼）。如果真的想要硕士文凭就为了考公，不如去国外读一年还不用投论文。不舍得扔东西的不是我，他们说你小学的卷子也留着，给你孩子看……真的是已经放不下了。读研的东西我想全烧了，烧不了我烧东西总行吧。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[0,3]},{"id":"2025-09-29 02:13:56","content":"\n现室友是个 00后HR。HR 全是 e 人。自从搬过来后我有点累，感觉全世界都是高精力 e 人。室友还组织单位团建打球，然后还想和我 pk Switch 上的小游戏。我说我不喜欢 pk，我认输，但也还是会偶尔玩一下。\n\n然后就是现在真的不想玩游戏，因此越来越感受到自发的游戏乐趣、成瘾性的游戏乐趣、社交性的游戏乐趣的分界点哪里。之前 我玩游戏基本上是只有自发体验，打一会儿没看出有什么好玩的不玩了，看不懂机制不玩，体验太单一不玩。对于获取新体验占到绝大部分，导致绝大部分游戏都打不了——太单一了不玩，体验多的太累了不玩，除非很闲，燕云没打下去就是纯累的，要我不搜集地图剧情我又做不到，因为不跑图会严重削弱剧情和体验上的丰富度……\n\n现在的自发性为0。真的什么都不想玩。但室友要和我 PK jump joes，一个只需要 2 个按键的超简单游戏，之前我打了两局就不知道为什么要玩这个所以撤了。但这次后面玩得时间长了一点后，发现这游戏是以“停不下来”为目的构建的，和短视频的思路很像。跳跃类游戏接连不断的反馈，上一局结束后给下一局初始道具，零成本重新开局，加上我的小目标是解锁完角色，所以连续重复搜刮金币4小时……对于一个人玩而言，就是一个反馈成瘾的小游戏。大概就是休闲游戏一直在干的事情……从这个角度算是第一次理解了为什么有人一直玩三消……不需要脑子，接连不断的反馈 + 做任务奖励就可以了。只是利用了非常客观的一些人脑机制……\n\n类似的，跑酷、别踩白块（非音乐性音游）、小丑牌（大数值的刺激）、三消、三合……我觉得都算这类。在什么事情都不想做时，还能在这种游戏上刷，确实是有道理。但也难以想象，世界上有这么多人其实是在以一种非自发的状态打游戏的…还有星铁里的豹豹碰碰，我觉得这个小游戏设计得很好，老实说，星铁里小游戏设计得都不错，有几次模拟经营把这种带有成瘾性的反馈拉满了，从来没有坐牢的感觉，但流程太短了。然后最后留下来的联机小游戏还是三消……\n\n然后就知道之前一些矛盾点在哪里……建筑类游戏不适合上述做反馈的思路，这类使用连接不断的反馈让人“上瘾”的机制，至少我想不到。感觉策略、解谜、放置、养成那边的体验更合适做建筑的。\n\n还有是扫雷，这个游戏不改基础机制的话，美术音效的反馈拉满也是没成瘾性的纯策略，是否能控制局面的界线分明。\n\n而社交性的，重点就不太在游戏上了，在人的反应上，我称为群居动物专属。本来室友天天打游戏就为了 pk，然后因为我跳了一晚上刷了记录，室友早上一开游戏感觉天塌了，在4个小时后，彻底断绝了他继续打这个游戏的动力……然后转而想 PK 其他游戏！老天，我真的会谢，我不想 pvp，我认输。\n\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[0,4]},{"id":"2025-09-11 11:49:40","content":"\n考虑给 Memo 前端加个上锁的功能（完全防不住真正想要搞破解的人，笑死）。如果把 md 本身做许多的格式化约定后，就会变得不通用了，还丑。但可以不是这样的。在小说里，已经有大量“模拟程序”的文风，他们并没有影响可读性，只是提供了相应的信息而已。\n\nYaml 头的问题是，视觉上与正文完全的割裂，输入太麻烦。作为元数据是个非常好的方案，对于写的人来说很痛苦，却不能很好地成为文章本体可阅读的一部分，再加上一定在开头先加这个东西，直接打断写东西的思绪。要不是 Obsidian 有模板功能我早摆烂了……现在也已经摆烂了，完全不在那边写东西。\n\n已经想好了，大概是这样，加在最后当脚注一类的存在。\n\n```md\nmemo内容\n\n------\nlock: password\n```\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[0,5]},{"id":"2025-09-07 17:26:16","content":"\n[博客曾经是不同的 - JetGirlArt](https://jetgirl.art/blogs-used-to-be-very-different/) \n\n那我确实还是很多年前用博客的习惯啊……只不过已经没有了以前那样可以自己装修的博客平台，因此变成了自己手搓装修（然后一堆组件都还没写完，笑死）。诚然博客可以用于推销自己，但与其用于推销，更希望是，「很高兴认识你，回踩回踩~」\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[0,6]},{"id":"2025-08-24 06:03:08","content":"\n入坑 OOR 的第一首歌是残响的现场，et cetara... 今天感觉总是很难过，各种情绪憋在一起，极限压缩为一个设置了密码的巨大压缩包的 zip。想起很久很久没有听歌了，又拿这首歌出来听……但因为现在也懂了嘶吼怎么唱了，一直在注意技巧了，反而没有当初听到的感觉了……不过还是爽的，oor 的现场真是解压……\n\n我是幸运的，可我在做的一直都是让自己变得更加不幸的事。我无法回头了。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[0,7]},{"id":"2025-08-08 03:48:28","content":"\n看到一个说法。就是说套壳和写茴这个事情，其实让人感受到这个世界正在蓬勃的发展就算是作用了。大部分事情要说价值感，我觉得都没太有，在风口过后会回到没有膨胀的状态。但大家一窝蜂地凑热闹会让人觉得世界在前进。某种方面和经济的流通真是类似……本质上交易其实是守恒的，但实际又不是一种零和博弈，反而大环境感觉很重，总会有所有人都感觉经济好、所有人都感觉经济差的时候，不过是和供需有关。08 年的金融危机给人的死感，远没有现在多，这个真不是过去的记忆有美化，一个时代的心态可以从当时流行的文化作品中窥见。所有的创作者其实也是记录者，而一窝蜂凑热闹的人会构成当下的大环境的内核。\n\n很遗憾我是无法再去相信了。这不意味着我会停止折腾和写茴，而是类似的事情做得再多也无法认为他们的价值真的存在，我其实仅仅是因为自身的喜好和生活需求所做这一切，而为自己做事是既沉迷同时又觉得没有价值的。为什么是这种想法？不好意思这是天生的，大概人祖先是群居动物吧。\n\n[Opinion | I Teach Creative Writing. This Is What A.I. Is Doing to Students. - The New York Times](https://www.nytimes.com/2025/07/18/opinion/ai-chatgpt-school.html#)\n\n💬 浪漫的是人类本身，雀之前真的把 AI 当人聊天，惊异于AI的回复，久了也失望于AI的回复。而我，以上都没有，只会从各种话语的间隙感受到这个是基于注意力机制的概率模型。注意力机制的理念几乎可以等同于人在 Ne-Ti 维度上的思考方式了，算法架构可以算做一种 DNA，但还是没有人味，因为没有人类在其他维度的数值是 0。\n\n[一个半月高强度 Claude Code 使用后感受 | OneV's Den](https://onevcat.com/2025/08/claude-code/)\n\n💬 我自己觉得\n\n- 前端代码质量算能用。流行程度在中等以下的技术栈=垃圾堆，对不了一点\n- 必须参考AI自己分析的架构文件，人为重构修改了必须重新分析，否则垃圾。这会导致极其消耗 prompt。贵不奇怪。\n- 我一直觉得模型真的要用得做好持续学习（Continue Learning），而不是当前训练好一个大模型，让做应用的靠超长上下文 predict。当然，如果上下文能无限长还让推理保持同样的效果，那怎么不算一种持续学习呢。某种意义上来说也算是一种伪概念。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[0,8]},{"id":"2025-07-31 07:55:21","content":"\n感觉现在来说，除了 M 芯片，卡笔记本电脑性能上限的不是 CPU 也不是 GPU，而是散热和噪声……\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[0,9]}]