[{"id":"2025-07-23 14:51:23","content":"\n[这个光标](https://www.deviantart.com/jepricreations/art/Windows-11-Cursors-Concept-886489356) 质量很不错，在[致美化](https://zhutix.com/ico/windows-11-cursors-design/)上也能下载到。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[0,0]},{"id":"2025-07-10 05:03:50","content":"\n这是一篇日常的看电视、看剧、看游戏的生活记录。用时三小时二十分钟。\n\n**看电视**\n\n看了《歌手2025》，然后循环了好几天的李佳薇的天后。唱得感人肺腑，没有花里胡哨的表演，就是纯粹的好听且有感情。想想要是我还是14岁的话，大概不太会喜欢来这种老派唱法，当时太注重音色好听了。现在觉得，扎实的歌手真的厉害。\n\n随后观摩了一下2022年李佳薇发表在B站的[《天后》演唱教学](https://www.bilibili.com/video/BV1H94y117gL)。在听她唱歌前，我都在想这歌还能怎么唱。结果她在视频中演绎出了三种情感，游刃有余。轮到自己想学时，只想说死嘴快唱啊……非常难学，对声音收放的控制细腻多变，三句够我学一年。想起来大学有个室友也是很会唱歌，在没有学过唱歌时，听起来就特别专业，闻着落泪哭。\n\n想想我也可能近五年没有听过单曲循环了。自从补完 radwimps 往后，再没有觉得能循环的歌，连 rad 的歌都是十年前的。原来不能循环只是歌不好听，华语乐坛倒退十年名不虚传。\n\n**查无此剧的爆火电视剧**\n\n看了那个环大陆播放，所有二创花絮都被彻底封杀的国产耽美剧《逆爱》。如果平时不看剧也不看娱乐圈，一定是查无此剧。但凡有追剧、追星、追文的一定会知道。在海外的耽美圈算是非常火爆的程度，拿了几个平台的收视第一，我很少在推特上看到如此多万赞的国产作品相关的话题。\n\n这个剧开始非常土到尴尬土到空气安静土到怀疑人生，脚趾在墙上抠出了马里亚纳海沟。从3集后喜剧元素多了起来。3-7是比较好的推进，几集看下来令人上头。但 8-10 集是有问题的，故事逻辑连贯性、剪辑、角色性格的稳定程度有大问题，像突然一个还算有点专业水平的作品变成了同人 cut。\n\n不过对于投资成本不足十分之一的网剧来说也是不容易了。这个剧组不仅剧组穷演员也穷，受的演员是欠债前司 60 万来拍这戏的，因此过得非常抠，还钱还了三年了还没还完。他的新经纪公司是才成立不久的，他自己还是股东，出资 5000，整个公司认缴 10 万，公司只有三个人……实在太传奇了。\n\n这剧的二创在两周内换了6个名字，几个视频过百万后，相关视频 B 站全部下架，不论什么内容只要带相关 tag 就不过审，俗称“防爆”。因此这个剧不像从前的呆过的热坑，当时随便一刷就是质量很高的作品，二创满天飞。现在找同人剪辑全靠推荐系统协同过滤（我草死去的老牌算法课突然攻击我）不然只能看到毫无营养的十几秒帅哥怼脸。有时候很怀念有 KOL 推荐的时候，活人很多，高质量的东西可以通过口口相传而保留，但那时反而因为好作品太多了，需要推荐系统来挖掘没人转发的好作品。到 2022 年时，冷坑的高质量二创都只有几千人看了，如果不是关注一些剪辑类的 Up 转发，完全见不到。\n\n**游戏与故事**\n\n其实只是在崩铁上线新剧情时上去过了4个小时左右的剧情，约等于看剧情。\n\n看完 3.4 的剧情时是非常震撼而惆怅的。一改游戏讲故事流水账作风，信息密度大，故事紧凑，没有把所有信息都放到对白里了，过场多，倒计时也足够震撼。4小时的剧情把白厄所经历的一切刻画地淋漓尽致，他是个永远无法超脱神（程序员）给定的命运（深度学习程序）的人（变量），明知救世无望，却仍然背负起三千万次轮回，宁可自身人性尽灭，以延续这个世界令人绝望的、永远止尽的循环，直到弑神的时机到来。除开剧情本身，这章表现力还要归功于美术，过场的时钟非常有仪式感，让人想起了命运石之门那不断变动的世界线，以及高潮的弑神之章回归了2D动画，终于把经费用在了该用的地方。整个角色的战斗技能设计甚至都是在为讲剧情服务，不停轮回，不停地爆天星对昔日的同伴下杀手。人的声音从阳光开朗的青年逐渐变成人气尽逝的沉重。\n\n之前 3.3 遐蝶上线时，还在一个视频下面喷了遐蝶单薄的塑造，除了美丽和特效要啥没啥。要成长没成长，要推剧情推不动剧情，作用只剩小女友，完全比不过同期那刻夏的人格魅力。\n\n总体评价是：翁法罗司的剧情非常好。虽然之前也有时会说崩铁的剧情好，但是衡量标准是在游戏里比的。在我心中，影视剧情和游戏剧情有断层的差距（文字剧情类游戏除外）。被认为现象级的游戏剧情，讲故事的质量都不会高于一个合格的电视剧或动画，我也因此无法云游戏剧情——观影体验实在不好。像是FGO 最受好评的第六章动画改编，放在番剧的角度看上也是很一般，我记得当时我给表弟看时，播了两集实在说不出什么好看的理由，太缺主心骨（故事的主轴）了，不过在游戏里的史诗氛围要好一些，但剧情本身依然不及专为剧集而写的故事剧本。毕竟影视发展这么多年，每一个有效的镜头、反应、声音，相互配合而成的连贯的故事节奏，表达的信息不是游戏能比的。\n\n人类有恐怖谷效应，当一个东西有点像人但明显不是人时，人类会感到诡异。放到讲故事和游戏也有类似的尴尬。纯文字会给人很多想象的空间，小说会很精彩。文字剧情类游戏由于动画少，对于镜头声音也都有点想象的空间，只要文字能写好也很不错，FGO 大概可以算半个。以上观众的兴奋感会来源于主观的想象。但是，如果你的角色写实且能动，你的画面也写实且有镜头的变换，你就把观众的想象夺走了，转而提供由你（游戏）提供表演的反馈。此刻，种种“能让角色动起来”的美好愿景，反而变成了讲故事的阻碍。角色动作就是预设的状态机反复播，镜头表现最需要的光影、黑白灰被受制于渲染风格、场景和设备性能。于是你专拍大头微表情，做表情融合，虽然也动不太起来，至少能有无数个 PPT 表情了。\n\n然后大量剧情也是站桩、播几个动画，视觉层面，分镜、光影、角度（镜头语言）基本等于没有。声音层面，说一句话是一句话的，其他的比较说话节奏（打断）、背景氛围、随时随时音乐与音效的推进，也是基本没有。再加上抽卡二游的锚定了是卖角色和对应的战斗机制，新角色是按版本固定推出的，这其实完全不符合讲故事的角色出场逻辑。\n\n但我是来看剧情的，并不想打牌……星铁明显是在文字上下的功夫比较多，但什么东西都由文字表现出来，也因此过于冗长。但到 3.4 时，游戏更新后的开场动画着实有点吓到我了，味到非常正的二次元神性，又开始幻视 FGO。\n\n**博客**\n\n有考虑要不加给博客加音频和视频播放。想了 一会儿作罢，太麻烦了。现在想写复杂东西的情况只有两种，一是赚钱，二是特别常用，其余情况就一切从简，简单好维护就行。\n\n虽然如果有的话肯定想起来会想用用，但还得配合一整套的静态博客的 CMS，没有现成工具能满足需求，上传音视频还要做压缩这一套，也就是自己要用得爽要前后端写一整套……还是用微博吧。微博我也很少上传视频，确实没这需求。\n\n**再说平台的去 KOL 化**\n\n鉴于同人难找，我自身有收集整理的习惯，其实很想开个杂号转发一些东西。但 B 站不能开小号，严重影响我当活人……\n\n微博认真看剧的氛围越来越差，自从选秀节目成团盛行后演变为饭圈撕逼，八卦和没营养程度幻视小时候的星周刊。除此外就是一大堆社会新闻。我上微博时总有种即视感，和十几年人看二三十见的人上天涯虎扑似的。\n\n抖音的创作质量真的差，大部分做饭的人不会发那上面。\n\n至于小红书……很好，我最讨厌的一个平台，这个平台完全无法给创作水平相称的流量，按时间刷 tag 偶尔刷到了 10 比 1 的点赞率的剪辑，真的算好的同人作品了，但完全推不出去，并且因为完全去 KOL 化，也不能顺着点赞和转发链找作品。原子化，且信息茧房最严重。\n\nLofter 能推好内容，毕竟专为同人而生的平台，大家会刷 Tag 下内容的周排名，还挺手动的，不是只靠黑箱似的推荐算法，我发同人漫画数据最好的也是在 Lofter。但我其实不太用这个产品。因为大部分的同人粮达不到要我想要的感觉，很少看。编辑严选的纸媒时代和电视台严选，把人口味养叼了，其实这种非常透明的大众严选也还是不错的。Lofter 没有视频类的，也很难看到一些创作者视角的碎碎念，仿佛不发原创就不要上这里发垃圾占 Tag（实际上还是有很多搬运）。\n\n我现在有点想看纸媒水平的中短篇作品。还是忘不了小狐狸化形记。在这个内容质量势微的时代，各种乱七八糟内容被啊晴的宣传与好看的外衣包裹着，更想看到实实在在硬好的东西，就像李佳薇的演唱那样。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[0,1]},{"id":"2025-07-03 04:03:11","content":"\n上周六和雨疏看了名柯的剧场版，感觉是近十年来最好的了，没整成动作片，也没有大场面，从始至终的都在比较紧凑地推理。\n\n天啦要干的事情一件也干不了。论文更新不动，游戏也打不了，觉也没有睡，也没有刷社交平台，也没有和人聊天。我是怎么做到的……显示我一直在 Chrome和 VSCode，但我也没有觉得我有用多少，标签页面还冻在知乎……我用电脑在 Chrome 都干啥啊？？？1点的时候只记得头非常沉重，是情绪波动太大导致的，当时只想说惩罚自己不准睡觉，开着就看论文。实际也没有看，可能一整天真的能花在论文上面的时间一共就1小时。现在实在思考不动了。我要两小时内干完一切睡觉……手工的事情明天再说，或者下辈子再说。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[0,2]},{"id":"2025-07-02 20:00:48","content":"\n今天是周三，把论文发过去，非常想死。\n\n为什么呢，我不知道，也不重要。上次可能是三年前了，浮现一大堆跳楼与砍手的想法。什么精神暴力。太难了，哭太多后头晕然后再是头躺着什么力气都没有。然后拼命尝试改论文一会儿来汇报结果吧。现在是 20:03:47。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[0,3]},{"id":"2025-06-24 15:57:40","content":"\n之前有被说老是会说不，其实也想改掉总是说不。迎合等于忽略事实，拒绝等于冥顽不灵不听意见。不过往好了说，迎合是把握大众趋势，拒绝等于独立思考。我现在不太想直接说不，只好岔开着说一个看起来没有说不，实际就是说不的方式。\n\n说起来为什么会有老说不的习惯，因为一直以来我说不都是没用的，比如不想吃这么多饭，不想打半个小时电话。当然说是没用的，我计时说只有一分钟也没用，所以最近才直接挂电话拒绝情感索取……总之我已经被这种情感索取消耗掉了所有可能培养 Fe 的可能性。\n\n再说到，捞女游戏出来时，我没有觉得这游戏有什么过分的，讽刺这类群体没什么不好，有这类想法的人我不敢说有多少，但身边统计学有人是这样的，就会感觉这样的人并不少，至少比死宅二次元多……当然说可以成是利益导向，我并不觉得利益导向有问题，只是维持家庭到后期的需要是责任感，因利益结婚的人也可以有责任感，只是捞一把的人大概是不会想负责任的没得捞就跑了。\n\n感觉最近一年看了实在太多乱七八糟的东西，然后记忆力更差了……与其说差其实也是不用的就会渐渐忘掉。表达能力也下降地很厉害，东一句西一句。还是要尝试去体系化地表达同一个主题不要太跳脱。那首先要少写 meme……\n\n雀\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[0,4]},{"id":"2025-06-23 22:14:04","content":"\n60天的速写牢嗯嗯。我觉得画画和写代码真的是不太能同时做到的事情，状态比较冲突。\n\n\n","tags":[],"imgsmd":["![60天速写](https://img-cf.sansui233.com/imgs/2025/06/202506232219346.webp)"],"sourceFile":"004.md","csrIndex":[0,5]},{"id":"2025-06-20 17:47:21","content":"\n看了眼新的 next.js，感觉真是啥方案都补全了……当时感觉 styled-component 的ssr 方案也是到处找不到，最后跑去个小仓库看怎么在 _document.js 里插 style。结果现在直接看到各个文档直接把相关写出来了……嗯……行吧……然后当时觉得一个页面一直在 pages和 components 之间切也是挺烦的，其实也根本不会复用 UI 组件，只是拆出去能好看点。现在一看可以写一个目录下了……嗯……行吧……省得找了。网页真是挺标准化的东西，游戏不太能……\n\n看了下 subgrid……很有用。之前首页grid 其实预想的设计是右下角放标签的，但最终放弃了放标签的想法，原因是标题和描述长度不同，导致每个 card 标签的高度不一致，反而乱乱的。如果想做到标签高度一致，只能固定每个卡片的各个部分高度，做不了响应式的高度。现在 subgrid 可以做这种二级对齐了。不过鉴于 subgrid 是一个很新的feature，css 没法 polyfill 还是不用的好……\n\n什么，已经3年了吗……确实不知道我在干什么，其实是看了很多 AI 相关的，但基本都是被要求重写创新点所以只是看论文，加上复现边边角角的论文其实是相当困难的事情。我当时一直讨厌跑别人的 python 的工程，主要因为包管理太狗屎了，几乎到毕业时，我都只有一个 256G 的 mac，对于空间要求非常抠。实验室的服务器没权限让人自己搭环境，也没有任何做工程的氛围，在入学时根本还没有跑过任何一个 ML 的 Hello world，完全不理解原理的时候，导师就在说代码就是重复造轮子，不要多花时间在这上面，只要读论文和写论文讲故事。那时候 ML 入门的东西还比较少，还在 tensorflow 占主流 pytorch 刚有苗头的时候，Seq2Seq 还能每年有很多论文，沐神也还没开始写书，感觉整个实验室的工程能力都极其烂……我到现在也不能理解为什么能有人在工程能力为0的情况下写论文，该说写吗，就是编吧，没有任何实践的证明靠几十篇 paper 延伸一个假想的算法，最后 code 一下说，我们的方法好，没有实践上的各种问题，没有因为缺乏实践踩坑效果不好而推翻整个前期方案的情况，只会有看起不太创新而推翻整个前期方案的情况。怎么可能那么顺利？不可能的啊！当然不是所有组都是这样的，但不合的组是真的吃屎而且不能中途退出……\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[0,6]},{"id":"2025-05-12 03:00:00","content":"\n我觉得前端越来越无聊的原因是发现总在茴……感觉是自从开始卷设计之后写茴就快到头了。卷设计之前还在卷客户端，最早学的时候还是jQuery那确实不方便。后面出框架解决数据绑定算是真正的革新。但近几年好像都在卷设计，你要说框架没有更新吗也更新了，但是更新地好像你用之前的东西也没有什么不便，rsc 出来之前 next 的 ssr 不照样能做吗成本也差不多。用 swr ？无限列表不也是超老的思想吗，而且频繁取新数据这事就没什么好说的，重点是在于维持正确的 playceholder 和判定交互行为那一套，硬要解耦重点也是在交互埋点上吧，这个又是和业务强项关的……除数据绑定之外还解决了什么呢……还有什么八股总是问virtual node解决了什么问题，标准答案是可以端……我真的一脸懵逼，我请问呢，没有virtual node就不能全端通用吗？都是抽象层，不能全端通用难道不是看有没有人适配 native gui 吗……也就是 React 闲得拓展业务搞了个跨平台api维护。当然谷歌也闲直接跨平台重绘，直接调图形引擎属实老本行……虽然我更喜欢后者的做法，但商业上确实会偏向前者…感到更无聊了。\n\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[0,7]},{"id":"2025-04-28 03:19:26","content":"\n快乐不是来源于多能把东西做得多方便，而是来自于“居然这么东西还能这么做的”的好奇。\n\n换个人的话……快乐不是来源于东西本身有多美，而是来源于发现美的眼睛（好土）。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[0,8]},{"id":"2025-04-18 22:12:23","content":"\n本来想发长文那边，但最终还是太过于自我与情绪化了，也没了修改的力气，算了。\n\n---\n\n> 我原以为大家都是这样，原来只有我是这样\n\n\n\n1\n\n时间是家里聚餐后正在清理与洗碗。很多人在客厅里来来往往，非常无所事事地吵闹。两只猫早已习惯自己的领地突然涌入十几号仆从，瘫在猫抓板上眯眼睡觉。偶尔人类来逗他，眼角的肌肉勉强一动，以示朕已阅。直到有人拿着猫条叫着 “来来来”，嗖地尊座下蹿下来。\n\n好吵，非常吵。一如既往地坐在电脑前，随便打开一个文档。嗯，今天一定要看完！\n\n不一会儿人们渐渐走光了。我出去说了声再见，然后继续回到房间专注。有人羡慕心流，说我画画时像陷入了心流。然而，于我而言这是日常，甚至画画远不如编程、阅读的专注度。大概普遍印象中，画画的人总是给人岁月静好的感受。一旦人的行为沾上了一点艺术气息，就会变得神圣、不可打断与亵渎。但倘若看到你在画二次元，又会令人感到亲近，有人会友好地询问我在画什么，有人则直言不讳地说是幼稚。为了不被打断专注，保留一点所谓的艺术气息是必要的。\n\n可惜我没有那么艺术，我只是在看文档，最普遍的、常人看不懂的、只知消耗巨量脑力，需要放松的工作。事实上我不需要放松，我的目光与思绪无法从屏幕上挪开，仿佛一旦挪开就会掉链子，我渴望更多的，更完整的逻辑。若此刻被打断思绪，就如同电视剧的最终悬念揭晓前突然被老师叫起来罚站。\n\n此时我隐隐约约听到了脚步声。我一边强行维护着专注，一边用微弱的本能祈祷着，不要来推我的门，不要来推我的门，不要来推我的门。\n\n过了一会儿，脚步声渐远，我那微弱的本能松了一口气，把这次的小小分心忘掉了，无事发生。\n\n当下一轮越来越近脚步声响起，我明白之后会发生什么。\n\n门把手转动的吱嘎声音，把手转到底时门的活塞与木质的结构撞击声音，然后是木门被突然推开时，整个房间的气压微弱的升高，带起了一阵风，四扇塑料窗子在耳朵哐啷地轰鸣，似乎连带着整个墙体的共振。整个小小的空间，上演了一出 jump scare，扰乱了房间的气流，也打断了我的心流。\n\n我顷刻间变得无比厌烦。我没有表现，我仍然想专注，可事实上此时我已经无法边看边思考了。我只是非常厌烦带来了这一切中断的人。有人可能会觉得你房间是不是质量太差？不是的，这是一般的框架结构房屋，钢筋的牵拉具有良好的抗震功效。普通的开门在别人看来是平平无奇的，但对于此时的我，一切细节在经历数次后都被放大，是空间的打破，是对已知未来的预测，是对预测之事的厌恶。\n\n房间门口出现了不可忽视的身影。她可能直接进来，不管我做的一切，想和我进行一场严肃的对话。或者是带着水果，然后问你在干什么。尽管我做什么其实并不重要，她只是随口一问。我还要把这些她听不懂的东西试图用她能听懂的语言概括，亦感到无比厌烦。如果她真的有求知欲，那是值得费一番功夫分享的。事实是她并不想费脑子理解我做的具体事物，她只是随口一问，想知道我在干什么，想掌握我在干什么。\n\n我等着她下一句开口说的话。但这次她没有说话，瞟了一眼我的屏幕，盯了一会儿，离去了。没有关门。\n\n但从前太多次的厌烦已经深入人心，无法被消解了。门窗的轰鸣亦是这样，无法消解。\n\n\n\n2\n\n如果她进门，真的让我聊我做的具体事物时，那可能更加糟糕。这就是“严肃的对话”场景。又会拐到更宏观的存在主义话题上，说服我自己做的一切都是没有价值的，或者是她看不到价值的，摧毁我原有的信念。信念是强大的，不易被轻易摧毁的。\n\n此刻我有些不想再回忆了，上述场景有轻度 PTSD。我很长时间都不认为这是 PTSD，直到我发现一旦回忆就会开始哭泣，尽管我没有任何想法，我的脑子一片空白只是在哭。我没有用逻辑去思考为什么哭和有没有必要哭，这这反应是几秒内瞬发的，超越了逻辑本身，等有逻辑时已经结束了。\n\n然而这一切都源于我想有逻辑地回复每一句话。已读乱回，做不到。\n\n她看了很多爹味短视频，都是三言两语不深入的大道理，任何场景都能套用同一套说辞，加上她自以为的假设，形成逻辑闭环，百战百胜。我能背下来了，我能复述她那不断重复的大道理。要说道理有没有缺陷，有，只重视概率上的因果而无视信念。她至今也无法理解或利用特质，又或者应该叫“个性”，这个脱离她掌控令她恐惧的词。\n\n但我并不想在辩论赛获胜，我只是想解决具体的问题。\n\n\n\n3\n\n有时会是猫猫抓门，猫猫的抓门很有礼貌，猫猫不会轰地开门。猫猫很直白地一本正经地蹲在旁边跃跃欲试，表示想趴在我身上，等着我的反馈。我很开心，总是让猫猫上身。尽管被打断了，也非常开心。\n\n\n\n4\n\n有人说一看你的家庭情感挺好的。不是，那也是我贯于伪装，电视剧里有那么多健康、日常的家庭关系可以参考。每个人都有伪装，因为社会实质上依就无法容纳有太多特质或者特殊经历的人——至少表现上如此。这不是人的问题，而是社会的分工是本就是一种机器。机器的一环如果出错了，对于后续的产业链可能会造成灾难。可人不是机器，那就招更加标准化的人。\n\n有次看演唱会晚归时，我假装肚子疼去医院晚回了，把同行的室友惊呆了。但换到现在我想大概难以做到那种程度的伪装，即便一时有这样那样的好处，但任何事情上都在伪装，在脱离本心的道路上渐行渐远，会给自身带来更严重的灾难。不，已经带来了。\n\n总之现阶段，矫枉过正，会显得不懂人情世故，我想也是必然吧。\n\n我很讨厌我的说话风格，一二三总之，清晰的罗列和一堆逻辑方向的用词。我已经在尽量避免爹味的痕迹。但我很久没有看过文学作品了，天天看论文和文档免不了如此。\n\n\n\n5\n\n坐班工作的时候我反而没有注意力切换的烦躁感。叫我也肯定是讨论工作问题，我所说的对方能理解，大家有在认真地理解对方具体的行动。而不仅仅是三两句陷入存在主义的危机。\n\n但是注意力切换问题还是存在的，有次被打断去看什么，回来不知道写到哪里了，之前什么细节需要注意，然后写了 bug ……\n\n\n\n6\n\n你为什么不工作？\n\n在最想找工作、转行的时候，说我的所作所为一无价值，对赚的那一点小钱进行对比贬低，以此劝我写论文。在决定把论文写完后，发现我写不完，劝我赶紧找工作。\n\n这么说，导师才是第一个问，你真的想写完论文吗，的人。虽然我对导师并无好印象，但我可以理解他，我和他更像是一类人。\n\n我觉得不要劝了，真正的支持确实只有钱了。我不需要关心，我分不清你们的关心和控制。我也不需要很多钱，可以每天吃三块钱的面过活。趁我还有力气偶尔想死时让我自己决定，我不想，也怪不到你们头上。\n\n不是说我想死，而是想死之人必有不甘。无所谓生死时才是真的躺了。至少有人真的有人会很切实地鼓励我写论文，我已经非常感激了。你不是一个人，运气也不算太坏，不是吗。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[0,9]}]