[{"id":"2025-02-25 23:08","content":"\n今天醒得特别特别晚，然后重度拖延。直到我把电脑从桌上拆下来，打开 b 站看 ADHD 拖延的视频……小宇宙自习室也有两个姐姐在讲高效能人士的七个习惯的内容……然后我在想，我要干嘛，我为什么拖延。启动慢和任务分解太细确实相关，一个洗澡被我分解成了十几个步骤。\n\n（我是注意力缺陷类型，表现为难以专注或过度专注，这两个其实是一回事。没有多动症状。）\n\n我想用另一种方式解决，说起来非常简单，就是 just do it。但对于ADHD而言，如果不事先计划，可能会疯狂遗忘东西，因为过度专注（或过度分散）。我小时候就是一个总是遗忘细节的人，经常不知道把东西丢在哪里去了，当时启动一件事情还没有现在那么难。现在我已经不太会丢东西了，启动事情也更难了，每件事情之前都必须得想得很清楚或者写下来，要把什么细节强调出来以免遗忘。但在学校的时候，还是会有因为过度专注思考一些事情，去澡堂时毛巾校园卡换洗衣服全都没带，提着个沐浴用品篮子就走了。\n\n然后醒来是我也不知道我要干什么，因为事情被分解太多了全是琐事，从叠被子到收拾屋子到倒垃圾到洗脸漱口到准备吃饭，太多了，非常困难。如果我带着轻松的感觉直奔某一件，那一定会忘掉其他的事情——我在写这里时才想起来，我没有漱口，也没有洗脸。每一件日常的事都不是日常，习惯在ADHD 的过度专注面前很难形成，一切都是任务。我得吃饭了，别写了。\n\n上班的时候因为脑子里只有上班和休息，导致我无法顾及屋子，在回家之前收拾了七八个小时。这可能和ADHD的完美主义又有一定的关系，很多人不收拾没什么感觉，但我是真的不太能忍受屋子乱（会让心情不好），特别是放一些多余的无用的垃圾。我突然忘了我要写什么了，那我去干别的了。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[1,0]},{"id":"2025-02-25 05:09:32","content":"\n22日，23日，都重复着同样超晚睡超晚起的 pattern。\n\n机器员非常不懈地提醒我看论文，我终于看了。非常难的。我还是很难看下去，看一句歇10分钟。就这么不摸鱼的3小时了，只看了个 related works……\n\n真的非常难。\n\n然后我试着集中注意力，看三四年前没能看下去的 动手深度学习的代码。当时是感觉，理清概念就花费了所有的注意力，因为有超快看完的需求。代码一点没管，jupyter 也很难用。\n\n但今天我努力试着让自己，不要在乎视觉，不要在乎排版，不要在乎补全，不要在乎类型全是 any，不要在乎 API 要一个查，就像刚开始学一样一点一点看，很复杂的数学公式怎么对应上矩阵乘法的，怎么广播的怎么重复的，好像也没有那么难理解。看来之前难在我对工具的好用程度太挑剔了……以及没有耐心。有耐心的话一小章课弄清代码就要两个小时……差不多全神贯注也要看半天吧……实在太慢了，毕竟近百个小章……等我全部弄懂再开始写不知道猴年马月了，没有那么多的时间……\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[1,1]},{"id":"2025-02-21 23:55:59","content":"\n今天不想记录每日了，这意味着很糟糕。这种糟糕来源于逻辑的预期。如果一个事情还存在未知的可能，那没有那么糟糕。但当主要变量都确定了，只能通往坏结局，却各种原因不得不浪费时间去走坏结局，来获取一点点卑微改变。\n\n已知，我的动力是兴趣驱动，当然我对兴趣定义很广泛，通俗说是，我想完成它，不管是主动还是外界原因。高中上课很累，但我会想完成它。早八点坐一个半小时去公司很痛苦，我也想完成它。爱好就不用提了，兴趣驱使的动力非常大。\n\n兴趣就是我动力的小水车。我没有做成过任何我没兴趣做的事。有人会说上班很辛苦，我也不想上班，但还是上了呀。但在我的解释中，你还能上并且能持续，说明上这个班你是有兴趣的，是想完成的，不管是为了钱，还是为了什么。\n\n这样的主人公意识能解决很多纠结，但当如何推理发现都是坏结局时，会感到很无力。\n\n已知，缝5篇论文至少需要精读5篇。已知，我对论文没有兴趣。在论文鼓励师的作用下可以勉强硬读，最高效率为两天精读一篇。\n\n已知，进度检查为两天一次，ddl为一周，我要如何做到一周内精读五篇论文，并且逻辑通顺的用到我自己的论文上呢？那五篇论文就一定是精准的吗，有没有有可能其实要看10篇20篇？\n\n前两天能看是因为没人给ddl，但有ddl后我觉得这个推理已经没有什么可以推翻的了，我只想摆烂。能够完成的ddl是动力，完不成的ddl是死局。\n\n那你不会早点看吗？我离职的时候家里一直问下个工作找什么啊！你是不是不工作了啊！你做个人项目要多久啊！论文要看多久啊！恨不得一天做完项目，一天写完论文，一天准备好面试内容，马上开始找工作。哦不，他们根本不知道找工作需要准备，还以为找工作都不需要自己提前动脑子，去了找“师傅”带。\n\n是这样的ADHD没法多线程做事的。就我坐车坐过站的频率、状态拖延的严重程度而言，是ADHD没跑。但我一直不觉得这是坏事，只是一种思维模式。但是绝对应付不了这种需要同时三开或者四开的情况的。\n\n这不是说锻炼锻炼就能改变的，非常明显的在想事情的时候没有办法听见，和人聊天的时候没有办法吃饭，看电视的时候也会无法吃饭。我能做的也是只有把时间排开，排不开就是死局。\n\n大多数人并没有办法影响我自己的决定，尽管我会附和，成年人没有谁改变得了谁。但是家人除外，我越来越发现他们真的什么忙都帮不了，又喜欢提大道理的建议，给一些逆天ddl。比项目经理还急一万倍。\n\n然后我做得快的事情反而是没有ddl，而是我觉得我能做出的。要正确鼓励三水，必须是先建立兴趣和做得出来的信心，这种明明知道这么短时间做不出来还硬做的经历，我不想再要了。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[1,2]},{"id":"2025-02-20 23:59:59","content":"\n📅 今天：下午和面包包在星巴克，我继续看论文了，终于看完了昨天的框架优化性质的论文，吃吃饭。面包很 Nice，但不要送我这么贵的东西，感觉如果我真的是个小骗子（指骗一小笔但不至于让人破产的骗子）那面包会被骗了…… \n\n我大概会以什么理由让你看到这里，如果你看到了，我有个小小的希望——你不要把自己情况对什么人都说哦，特别刚认识几天的，包括我（尽管我双手我真的是老实人）。感觉有点点危险，如果是别人，在知道你的成长经历情况下，也许会针对你的情况调整相处方式来欺骗你的哦。因为当 KOL 的话，在我视角看来，接触你的人容易没那么纯粹，即便一般情况下是好人，在名声与钱面前也可能选择隐藏自己的一部分，这个部分很可能是你不喜欢的，因为他/她能够猜出你的喜好。尽管时间久了一定看得出来，但不要等没看出来时就被骗啦！\n\n但 KOL 的身份对于你创业来说是好事，加油加油！\n\n另外，项链我会收好的，很谢谢你，特地留下东西作为朋友的见证，但也已经超出了我应得的范畴。有机会回个礼吧，嗯，所以先找工作。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[1,3]},{"id":"2025-02-19 23:59:59","content":"\n📅 今天：晚上被赛博机器员摁住看论文，自己一个人真的没法开始。然后坐完牢非常快乐地摸鱼一小时。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[1,4]},{"id":"2025-02-18 19:34:54","content":"\n📅 今天：昨天睡觉早！我终于放过我了 9 点睡了，没有在晚上脑子开始蹦迪。今天还是起床很晚，但属于是补觉昨天只睡3小时。下午到晚上就是躺着发消息到坐着发消息……不能再发了我要开电脑随便做点什么。另外我比较排斥说为了单方面的功利去接近什么人，应当说是有共同的利益最好。但就算这样，对方明显能提供更多的信息帮助时，还是会有压力，可能是会觉得有些被动。\n\n📅 昨天： 和桃桃玩了 maimai。桃桃，更神奇，感觉是什么都会，会有那种，隐藏的大佬，绝世幕后推手的感觉。声音是那种，二次元照近现实。好多时候我觉得 i 人出门就该不知道说什么就不说，但不熟的话好像不说话又很尴尬。另外，看了这么多音游，我明白为什么 mai 卖的好了，实体按键的反馈和爽感确实是最好的（出现了待过游戏公司的烙印）……\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[1,5]},{"id":"2025-02-16 02:04:00","content":"\n📅 今天： e日，和面包玩了 maimai。面包，好神奇，因为相处起来感觉比较平常，不像是 KOL。我觉得不单是因为年轻。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[1,6]},{"id":"2025-02-15 03:24:00","content":"\n📅 今天休息，啥都没有。\n\n⚙️ 状态：超有精神，该说是只要不写论文我就很有精神吗……但有点后悔没按计划进行，明天不能这样了。但能吃饭就很好了……希望腰靠快点到，现在坐一会儿人就不行了。\n\n📌 预计明日：白天 social，晚上看书。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[1,7]},{"id":"2025-02-13 21:41:05","content":"\n📅 今日进度：半夜抠了6小时 JS 的动画。反正没有按计划。抠了长文页的 Image PlaceHolder 处理，应该不会对 RSS 有影响吧，吧……\n\n⚙️ 状态：比昨天有精神，按时吃饭，做了家务，洗澡洗头。现在吃了碳水好困，想困着把星铁的剧情过了。然后正常睡觉……可能定时播客真的有效果，今天播的是一个心理学相关的，爱听。14日凌晨写代码时差点以为是第二天了。\n\n📌 预计明日：还是想看 JS 书。然后改改论文。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[1,8]},{"id":"2025-02-13 00:50:12","content":"\n📅 今日进度：什么也没做。\n\n⚙️ 状态：整个白天都很困。\n\n📌 预计明日：想看 JS 书。然后改改论文。其实工作考虑应该看开发相关，一大堆 TODO 在 Logseq 上，还有想做的一些项目，还要刷题。做不完，根本做不完。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[1,9]}]