[{"id":"2025-03-16 19:32:05","content":"\n看了 [transformers.run](https://transformers.run/) 。一大堆数据集介绍和 relative works。是非常好的 survey。很好，很偏实践，\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[1,0]},{"id":"2025-03-16 04:17:00","content":"\n睡不着，心情很差。\n\n在我妈又在那里用嘲笑小孩子一般的语气说我幼稚之后，我用非常严肃的语气说，你有没有发现，你关于我的事，不会讲一句好话。\n\n然后她又开始笑，说。你看你同学不会对你毕业的事说什么，只有家人才会对你说真心话。\n\n我依然严肃的语气说，好，那我如你所说，是没有任何用的人，不会工作，学的东西全都没用，只能啃老，可以了吗。\n\n她说，真的是幼稚，还和你妈顶嘴。你意思是希望我把你当外人一样，尽说好话？\n\n我说，你先把我当个人。\n\n我现在好想出去把自己冻死在外面……如果是一个人真的会出去，但该死的我又并不想让她知道我现在心情是发疯状态。\n\n从来都是如此，她每一句话只为控制我的发展轨迹。幼稚是一种从我记事起就有的人格侮辱。为了不被她负面评价，表现得很上进很积极很听话，她开心了我就会没有那么难过。如果我真的心理很健康的人，或者说被溺爱的人，大可以说幼稚怎么了，多好啊幼稚鬼有妈妈做饭。但我太明白她只是为了否定我自身希望成为的那种人，因为说我幼稚只会出现在我不赞同她的精明观、表达自己的希望时。在她的世界里成熟的人只有一种存在形式，她由衷地希望我是那样的，以各种常见东亚家长 pua 话术令我自卑，什么神经多样性通通扯淡。\n\n想到这个世界他妈的全是这样的就绝望。\n\n刚刚去下楼下站了15分钟，穿着秋衣秋裤。回来看了一眼，-2度。感觉自己跟个疯子似的，半夜蹲街上。但我明白为什么会这样了。在极端的痛苦下，尊严不值一提，并且已经没有生存空间了，蹲大街冻死是最符合想象的归宿，至少没人打扰。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[1,1]},{"id":"2025-03-15 19:38:50","content":"\n每天吃饭都要被我妈的外放微信视频号烦死。我带着封闭入耳耳机把歌放到我地铁上的音量大小才勉强听不到。不知道她们那一代怎么就是喜欢大声外放这种垃圾音频。我对其反感可以说完全是频率上的，都先不说是不是垃圾内容，就算这么放我喜欢的歌我也觉得刺耳，响度爆表。而且这不是年纪关系，很小的时候我被他们放在 KTV 时进去我就得拿纸塞耳朵。还有过年的鞭炮声，摔炮可以听，擦炮的声音也是不捂耳朵听不了一点……\n\n非常 非常影响……太吵了。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[1,2]},{"id":"2025-03-14 12:49:19","content":"\n然后说又看到了[阮一峰说低代码状态](https://www.ruanyifeng.com/blog/2025/03/weekly-issue-341.html)了……嗯，鄙人2021年的 memo 也在大骂低代码（并不算）现在看来很多地方举例非常不恰当，显得很肤浅，但核心来说还是同样的，UI 重要的地方不是 UI 而是逻辑……有固定工作流的中台也许是可以的，需求是确定的，但这东西不要 toC，to 不了 C，to B 也不行，要 to 只能 to 有特定需求的程序员。即便游戏的程序还挺喜欢可视化的编辑的，这么说来 Unity Component 何尝不算一种低代码……给足够的 Component 游戏程序员还是死不了，天天查有没有人造过这个轮子，这个轮子要怎么结合项目，最后看完感觉不如自己纯代码手写一个……复杂的是业务逻辑，不是拖个 UI 本身。\n\n哦对了，Unity 里有个地方低代码是算是应用比较成功的…… shader graph，这就算是有固定工作流、非常特定场景的应用，不过我保证没有图形学基础还是一脸懵，以及，这东西能成功应用的还在于 HLSL 这门语言本身不够直观，把定义、指令、渲染流程混在一起了。UE 的蓝图，也是被评价为“能做那种模板的开放世界游戏，但稍微想做点不一样的就得自己写代码”。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[1,3]},{"id":"2025-03-14 12:08:06","content":"\n前天真的要被气死了出门找自习室了。从来都是这样的套路：“我中午约了一个哥哥，你要去吗”“你以为是来看你论文的吗”。\n\n我还记得几年前要我背电脑参观一下一个跟风搞 AI大模型 的初创公司的工位，先是骗我只吃饭，然后骗我参观工位，最后变成了我在会议室连着自己电脑上答辩一样讲破毕设到10点。然后他说，还行，我就觉得这公司技术水平要完蛋……但我能说啥我只能说 AI 是风口拿到投资很有前途……难道要我说你们公司定位到大模型训练要是觉得我还行那就会被同行卷死吗……\n\n不过有没有前途都和我没关系了，他们有钱拿就可以了反正几年内也饿不死履历也好看也算是人生赢家了。但我是不会再信任何“你以为是去讲论文”的鬼话了。我论文不知道被他们拿去给多少“专家”看过了，解决个鬼，都不是一行的，我还得再讲一次又一次，我每讲一次都是折磨，我思考论文本身就是折磨，不用开始做想到要写就觉得无法做任何事了。\n\n一说工作就是我学的东西都是没意义的，学了几年也没见你找工作。这事我也吐槽过很多次了，不想再槽了，只会宏观套上填鸭式大道理的人是这样的，就好比律师一小时的挂牌咨询费一千，他们大概会觉得这律师一个月能赚72万。\n\n逼我和导师发没完成的论文，我实在想不出写什么，问她，首先叹气：“哎呀”，这是一个卖惨的前兆，“老师，你看我实在写不出来了，你看能不能帮我完善一下”……我听着就无语，要是导师我特么最烦这种人了，自己没有尝试过各种方案，说一句不会写就甩给别人。\n\n当然她控制别人的手段大概也就是常见的卖惨和道德绑架。比如，她想让我提东西，就以半开玩笑式语气说你都没有点孝心都不主动帮你妈提东西。同学请吃饭时在公司只能刷公司卡，同学买单了，她就是你事先都没有想到带点礼物啊（我草我是想到了的但到底是谁睡到4点半最后还迟到了半小时的，我从来没有主动责怪她过）。她想睡觉了，所以想让我睡觉就是，“做事不要没有个节制”。十几年都是同样的车辘轳话术，从来不思考背后有效或没效的原因是什么，有效是理所应当，没效就是我不听话罢了，要不就是我叛逆，要不就是我恨她。我一个（疑似） ADHD 做什么事都是非常容易被打断成无法进入的状态，即便打游戏这种事也只能是全神贯注，然后就变成了我沉迷游戏……沉迷画画还沉迷音乐。怎么没说我沉迷写代码沉迷工作？因为又回到了上面，我写的代码在她口中是无意义的，她传播她的焦虑却对此造成的心理问题不带来任何解决办法。我讨厌卖惨的和人身攻击，我也无法理解利用撒娇控制他人的人。\n\n\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[1,4]},{"id":"2025-03-05 23:37:13","content":"\n刚打了个电话很伤心……想打开写一下，但现在又懒得写了，一个时间点过去就过去了，不想状态再持续了。现在也无法持续很久了，太好了。\n……我刚又给雀打了一遍，复制过来好了。\n\n> 刚刚我妈打，电话。她要过来住。订机票时一直有绑定服务，不会取消。我让她打视频，她也不打。她点烦了说那就多被坑几十块钱，也不打。然后就无画面干说，说好久也不会取消绑定。\n>\n> 然后她就想甩一边，让我全自动帮她订。我说让她打视频。她生气了，说老子不来了，不订了。\n>\n> 因为，自从我上大学开始，她就没有网购过，所有网上的东西都是能让我买让我买，自己感觉麻烦。我可以花一天教，但不想她自己随便找个理由就甩我了，才 50 多岁就各种不会了，越来越脱节。\n>\n> 机票也是，开始都是直接让我买，我跟她说你去支付宝买，她说那些网站又要让人下App，我说不会的，支付宝你搜了就能买。然后就是今天了，她点了半小时不会，就生气了，怪我不给她买，让我做个什么事都麻烦和我爸一个德行。\n>\n> 好累。好像是我不做全自动网购代理她就无法出行了一样。让她拿我爸手机打视频也不拿，说我爸在睡觉。然后我说他睡觉你就不能拿他手机了吗，才去拿了。\n>\n> 然后2分钟就买完了……\n\n雀的回复：\n\n> 不一定是学不会，是她知道她学会了之后她就不能操纵你了。\n>\n> 而且她说喊你爸爸喊不动，就把那一部分的情感转移到你身上了，你是她一部分的精神老公，这一点我妈也是。\n>\n> （我：为何都喜欢，喊来喊去……啊！）\n>\n> 自身价值不够所以想要掌控什么以获得成就感，掌控不了的时候就会气急败坏。\n>\n> 改变不了，只能麻木地兼容。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[1,5]},{"id":"2025-03-02 01:16:31","content":"\n因为对论文没有兴趣，所以注意力进不去。因为注意力进不去，一下午都在看一段，而且会拒绝思考里面的逻辑。下次看的时候全部忘掉。所以就，好久都在看一段。\n\n我没法对写论文有兴趣。如果是对做什么东西有兴趣需要看论文，是可以看的。如果做了什么觉得还不错的东西写论文，也是可以写的。唯独写不了纯屎。\n\n如果我有兴趣，那我可能很久都在沉迷纯看论文。然后就会被质问，不知道我在干些什么，也不找人交流（特指线下社交），只会闭门造车。这个情况也会使我痛苦，似乎对事物感兴趣本身都是错误的。然后我不想再对任何东西产生兴趣了。\n\n“你就这样，天天被游戏玩。不是你玩游戏，是游戏玩你。”这是我妈常常说的一句话，只要有孩子在打游戏就说。逻辑本身是错的吗？本身可以说是对的也可以说是错的。“玩” 与 “喜欢” 最终是双向选择的事，游戏筛选玩家，玩家选择游戏。但我妈故意采用了“不是你杀他，就是他杀你的”的表述，所有的事情仿佛都是零和博弈。\n\n我讨厌这样的说法，我不明白这算是零和博弈，我只是本能的讨厌。怎么只有杀与被杀。各种作品会有喜欢“只有杀与被杀”的世界观？那是因为这是原始的恐惧，但可以从中看到除了“你死我亡”以外的感情，或者杀与被杀之外的道路。我讨厌只有争强好胜、把别人踩在脚下并以此为耀的人与叙事。\n\n虽然没有人和钱，很多事无法做，但通常逻辑是，你有想做到的事，才想方法挣钱。但现在的逻辑是，怕以后做不到而现在强迫自己做能力之外的事。这是恐惧驱动。\n\n是的，我妈非常喜欢恐惧驱动。她说“游戏玩你”，也是让你建立“因为一无所知所以被游戏玩了”的恐惧。她自己可能察觉不到，但所有事情都是这样的叙事。“现在不结婚是怕以后找不到优质单身的人，统计上就是这样的” “让你写是为了以后你啥也干不了是有文凭保底”。我太熟悉了，我知道这是恐惧驱动，但就是这么个成长环境已经习惯这种思维模式，不敢乱丢什么东西因为怕“万一要用到”，吃饭是怕“万一得胃病”。我被面试时感觉问了 HR 一万个公司怎么活下去问题，我也被传染了过度担忧。谨慎通常来说不是大问题，但会极大降低幸福感，看事情总是看到最坏最麻烦的一面，让人做什么都畏首畏脚。\n\n我不想分析，分析着心情很糟糕。逻辑可以改变，但感受过的情绪永远都会在。总之就这样吧。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[1,6]},{"id":"2025-03-01 00:59:59","content":"\n……只要开始看论文，一切事情都变得有趣了起来。\n\n昨天看论文，然后给 paperlib 写了个插件。嗯，只是无聊的复制文件链接，也很有趣的咧……\n\npaperlib 代码架构、设计、文档如此工整像有强迫症一样深得我心……要说问题可能还是传统这套生命周期+事件机制解耦的写法，解多了就得跳类型体操吧…… anyway 不重要，在前司最大的感想就是先别管这么多细节，理解了思路糊出来再说……\n\n三天不打游戏（2月29日，2月30日，2月31日）挑战，瞬间结束。不过我也真的是不太打就是了，不好玩。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[1,7]},{"id":"2025-02-26 05:55:55","content":"\n今天，努力早点睡，但不行。非常后悔看剧，我真的不能看，ADHD特有的出状态慢。然后从剧中开始胡思乱想了……以及还吃得超辣。但做了很多家务。我得想好明天要干什么。主要是吃早饭，然后看论文，然后晚上问问紫紫她在哪找她吃饭。然后，我不知道，我在想要不去雨疏家一起住几天，白天回我家上班……好神经病的想法。\n\n哦播客，昨天晚上的好像没听完。面包的那期也发出现了还没有听。那随便放一个睡觉吧。打败胡思乱想的方法，只有更无聊的胡思乱想，花半小时到一小时强行切换 context……\n\n……面包为什么录出来好严重的气泡音，实际听起来就还好啊，怪全损音质收音。\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[1,8]},{"id":"2025-02-25 23:08","content":"\n今天醒得特别特别晚，然后重度拖延。直到我把电脑从桌上拆下来，打开 b 站看 ADHD 拖延的视频……小宇宙自习室也有两个姐姐在讲高效能人士的七个习惯的内容……然后我在想，我要干嘛，我为什么拖延。启动慢和任务分解太细确实相关，一个洗澡被我分解成了十几个步骤。\n\n（我是注意力缺陷类型，表现为难以专注或过度专注，这两个其实是一回事。没有多动症状。）\n\n我想用另一种方式解决，说起来非常简单，就是 just do it。但对于ADHD而言，如果不事先计划，可能会疯狂遗忘东西，因为过度专注（或过度分散）。我小时候就是一个总是遗忘细节的人，经常不知道把东西丢在哪里去了，当时启动一件事情还没有现在那么难。现在我已经不太会丢东西了，启动事情也更难了，每件事情之前都必须得想得很清楚或者写下来，要把什么细节强调出来以免遗忘。但在学校的时候，还是会有因为过度专注思考一些事情，去澡堂时毛巾校园卡换洗衣服全都没带，提着个沐浴用品篮子就走了。\n\n然后醒来是我也不知道我要干什么，因为事情被分解太多了全是琐事，从叠被子到收拾屋子到倒垃圾到洗脸漱口到准备吃饭，太多了，非常困难。如果我带着轻松的感觉直奔某一件，那一定会忘掉其他的事情——我在写这里时才想起来，我没有漱口，也没有洗脸。每一件日常的事都不是日常，习惯在ADHD 的过度专注面前很难形成，一切都是任务。我得吃饭了，别写了。\n\n上班的时候因为脑子里只有上班和休息，导致我无法顾及屋子，在回家之前收拾了七八个小时。这可能和ADHD的完美主义又有一定的关系，很多人不收拾没什么感觉，但我是真的不太能忍受屋子乱（会让心情不好），特别是放一些多余的无用的垃圾。我突然忘了我要写什么了，那我去干别的了。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[1,9]}]