[{"id":"2024-02-13 16:01:25","content":"\n #沉思 感觉手游攻略是非常会引导玩家氪金的存在。我开始玩O神的时候，最开始很大的乐趣就在于拿着垃圾越级打雷电将军，就像玩塞尔达时3颗心练人马一样，算是玩法上的乐趣。但是在攻略里，这个配置是打不过雷电将军的。并且大部分的推荐配队都是两个以上的五星角色，只有一个角色的就要算低配。\n\n以我自己为例，4.4 纳西妲卡池两周，有春节活动加成，全期抽到大保底（180抽）才出了一个。如果要做到攻略里推荐的低配组队“草行久”，至少需要3个纳西妲，更不要提行秋和久岐忍还得各抽5个。完全按攻略组一个队，在不氪金的情况下至少半年。如果去追求这样的玩法，对大部分人来说和坐牢没什么区别。手游为了维持运营，大培养周期可以设计到按年算。\n\n即使是开服就开始跟的游戏也是如此，只要是抽卡为核心的游戏都逃不过的命运。\n\n这也导致游戏性本身打折扣。因为设计游戏性是折磨开发者的，想了很久的创意转眼就被玩家体验了，并且难以找到持续的利润点。但设计重复关卡、加大角色培养周期是折磨玩家的，玩家为了达到目标不停重复刷刷刷，再为了收益最大化去氪金。O神的游戏性做得本身也不是很强，设计低龄化，要么是一看就懂，要么是捉迷藏找找找这类我最烦的玩法，机关设计得很简单，但自造词太多，教程一眼看过去基本不知道在说什么。很少有觉得“哇，好巧妙的设计”的情况。\n\n","tags":["沉思"],"imgsmd":[],"sourceFile":"003.md","csrIndex":[10,0]},{"id":"2024-02-09 00:34:23","content":"\n#沉思 在思考创意性思维会不会和处境有关。感觉是有的。不完全有，和性格也有关系。有的人天生屎一样的想法就很多，称为A，有的人无论在什么环境下也不会有别的想法，永远直达目的，称为B。大部分人是两者的折中，会随着环境改变，但有一个改变的范围。通常 AB 是对立的小人，A 强 B 弱，B 弱 A 强。但如果 A 和 B 都很弱。对不起，我不知道有什么办法。A 快熄灭了，B 则本来就很弱。今天吃饭吃到了没煮熟的米饭，我知道没煮熟，但我吃完了，什么都没说。已经到了连目的是吃到煮熟的米饭都达不到程度了，目的大概只有一个：吃了不会生病吧。\n\n看着大人对着我表弟三年前分手的原因指手画脚也挺烦的，无时无刻充满了一种大人优越感，所谓说教就是在自己的高度上把自己已知的东西拿去凌辱别人，除了巩固自己地位与获得优越感外什么也学不到，西内。别在饭桌上好为人师。\n\n我刻意用了“大人”这个词，有教条式的刻板。\n\n","tags":["沉思"],"imgsmd":[],"sourceFile":"003.md","csrIndex":[10,1]},{"id":"2024-02-08 16:33:43","content":"\ngo 1.22 支持 range 接一个整数了，干掉大半的 for i 三件套 ​​。\n\n还把每个人都会踩一遍的坑——loop 里有协程会变量逃逸给改了。我测了一下。 python3 不用捕获，每个 for 的 v 是不同的实例。JS 和从前的 go 一样，共享 v 的地址。至于 rust，笑死，根本不会有这种问题，本来就要处理所有权，唯一的问题是写 rust 时有种把心里的草稿全部写下来的美……不不不，我其实根本没想那么多，但 rust 会逼迫你想清楚所有的细节。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[10,2]},{"id":"2024-02-04 23:52:59","content":"\nO神，启动！\n\n好吧，看了下，枫丹的剧情真的做的挺好的。\n\n我好困啊啊啊啊啊！！！不过终于可以睡得更久了。难道被认为是精神病是有什么特权吗？我很好哦。堂弟：姐姐求求你和我一起毕业吧。我，好哦。\n\n随处中断的白日。稳定而有安全感的夜晚。畸形的熬夜、睡不醒的疲乏、分分钟和世界爆了的怨气每天重复着精彩。 ​​​我不是多肉，不需要刻意去补充光照哦。\n\n愿意去做的事，有什么困难，都会想办法克服。而不愿意做的事，劝退只需要遇到一个环境问题。\n\n想法太多了实现不过来，终有一天会被各式各样的东西压垮。Ne 人是这样的。Ni 人就没有这样的烦恼。很多时候觉得社会功能上只需要 Ni-Te，其他类型都是需要“被教育”的。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[10,3]},{"id":"2024-02-03 22:01:49","content":"\n虽然树莓派确实降价了，但现在越来越从这些东西退烧了。不太清楚到底有什么需求，这些也这只玩具。虽然我是很想做一下个人的全屋智能方案。但是这个东西有一个前提，就和手游要有素材养卡一样……总体说来就是足够有钱。还有些别的前置条件，在能达成前无法启动。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[10,4]},{"id":"2024-01-31 嘎","content":"\n1. 人类与人生本身是没有任何意义的\n2. 活着只是因为感到被人拜托了要活着，就算这个委托是假的。如果感受不到这样的联系，我想快点消失掉\n3. 保持精神状态美丽的秘诀是少听说教\n4. 精神状态不好时只想摆烂，死得越痛苦越好，上慢性折磨\n5. 很多时候家长会说孩子开心就好，实际的行为却是对孩子的笑起来的原因视而不见，只想看到下一代和他们一样，为了从前与将来的事情一生惶惶不可终日，才会安心。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[10,5]},{"id":"2024-01-29 18:51:43","content":"\n竟然就 1 月 29 号了。没什么，就是好像时间很慢，但又很快。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[10,6]},{"id":"2024-01-25 21:49:37","content":"\n大家好，我是……算了。我什么都不是。\n\n我知道没有大家，我是在对着空气说话，但我还是会假设有一个“大家”。我需要模拟一个对象，或者说仅仅是假设阅读这段话的人是我，以确保我说的还是人话。\n\n我回家了。我想成为一个很平均的人。\n\n这两者有什么关系呢。嗯，本来是没有什么关系的，只是始于家庭谈话。\n\n相信我，没有什么比一回家就要被拉住谈各种负面事情更糟心的了。没有在家时也是如此。\n\n是的，我没有找工作，我也没有毕业，所以我就是一个以后工资会降级到农民工水平的、非常“可惜”的，底层、大学生。我妈的例子总是很极端，不是社会精英，就是工地农民工。受够了谈论这些无处不在的阶级感，整天挂在嘴边，谈论地越多反而越是毫无作用。\n\n我只有谈论负面消息、担忧、恐慌的资格，我没有资格谈论买空气炸锅的事情。\n\n我已经放弃谈论空气炸锅了，以后需要的话再自己买吧。我其实也并不想用，也并不想做饭，我只是想节省洗油锅的时间。还有，炸烤时，我不用一直盯着火候，可以去做别的事情。\n\n我说空气炸锅也不是在说空气炸锅本身，我想如果阅读者是我的话，会立刻快明白我在说什么。\n\n人没有必要活到60岁，当然这个想法会随时改变，但现在是没有的。也许当我准备找对象那天，就会有了。\n\n我把这些全写在这里，为的是，当我不再需要的那天，我可以一并销毁掉。我不想再在推特谈论有关的事情，加上性别因素，十分容易让人觉得我在卖惨。我感谢所有关心过我的网友，但我明白事情都只能自己解决……不是说不接受别人的善意，仅仅是我知道事情只能由我自己解决。我只是想找个自己可控的，说话的地方。\n\n我画了一点撕掉过去的画面。但是现在，我有点想画大家是怎么谈论空气炸锅。但考虑到太抽象了，好像只有我会看，也好像除了我没有人可以看懂，这样的话，文字已经足够了。\n\n爸爸妈妈为什么要在一起。他们之间没有对话。那也这样对我好吗，我想被这样对待。\n\n前几天看了“鸣鸟不飞”的漫画，说话语气越来越像矢代了。我不在乎从前的人又会如何看我，反差过大也好，怎么也好。其实仅仅就是有一段时间没有随大流而已，随大流是偶然，我还是我，没有变化。\n\n对了，我想干什么来着。最开始的时候，我仅仅是懒，所以想学计算机，为了在很多事情上可以偷懒。所以很喜欢看大家为了偷懒都做出了什么新东西。除此之外，我还想让大家都能够偷懒。\n\n但我明白了偷懒不是技术问题，是制度问题。我并不是说是人的问题，而是自然界本身就是残酷的。\n\n后来我想做的事情转变了，仅仅变成了表达，这样微不足道的事情。而我害怕被关注，所以越抽象越好。也许当我想要被关注那天，就能重获一个正常人的身份。一直以来，我想要被关注都太过容易，很容易地就超过了我能承受的阈值。终于没有任何人关注我了，我爽了。我想用变态一些的比喻，比如一个变态不穿衣服在家里对着猫SM。但果然我不是那样的人，我也不玩变态 play。我只是一个普普通通的 i 人，连对对象说“我们来做吧”都絶対無理。\n\n我还想说，让我去学画画吧，我会自己997，不会浪费钱。但我说不出口，是吧，其实明明没事就有在画，想要就有在画，为什么要藏起来呢，为什么要保护起来呢，为什么要说自己不看动漫呢，为什么要说自己没有画画呢。\n\n啊，要是手边有乐器就好了，可以就这样写歌词的demo啦。\n\n“那你平时都在干些什么呢”为什么人总是这么关心别人平时都在干些什么呢。不说难道不就是不想说吗，可是不说，信任关系就会崩塌。信任关系是这么容易崩塌的吗。\n\n我没有想通，等我想通时，就画下一波的漫画吧。每次看到 lofter 的点赞都觉得很可怕，我又被关注了，这不是我能承担的，我没法定时更新，这也不是我的 oc。我没有oc，我也不热衷于制造oc，因为我太抽象了。我画仅仅是我想画，目前来说，仅此而已。我画画会因为表达无力而痛苦，但我依然喜欢。\n\n谢谢，谢谢大家。我要早睡了，祝大家早睡。\n\n由 三水 写于 2024-01-25 22:45:27。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[10,7]},{"id":"2024-01-22 头发","content":"\n时常在想头发能不能掉一些，养不起了。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[10,8]},{"id":"2024-01-17 00:54:32","content":"\n看完了米奇与达利，这部动画开头的节奏没有坂本那么喜欢，但是后面非常喜欢，结尾也结得非常好，一如既往地又巅又温暖。最后一幕是缅怀作者我哭了。\n\n游戏那边在线好友1一起打双人成行，不愧是21年的年度游戏，设计非常好。\n\n我把 Getting Over It 通关了。对，就是那个没腿硬要用锤子爬山的罐男。其实通关完发现也没有用很久的游戏时间，断断续续玩了三天，最后显示5小时多吧，是吧这破游戏也没有说要用上20小时去练什么的。但过程是真的痛苦，中途会让你觉得一辈子都过不去。但最终还过去了。还是因为有在线好友1看着。\n\n博德3我玩不下去。虽然是年度，但对我来说这游戏可以说是 debuff 叠满吧……场面是常见的欧美风格写实荒野，没有什么创新的感觉也没有想截图的欲望。传统的血腥暴力元素很多，一言不合杀杀杀，地图中充满无用也不好玩的物品，对于探索党来说算是极其不友好了……还有本地化也有一些问题，查攻略时发现有的翻译把表面的词藻改得很华丽，但既空洞还更加让人难以理解了。还有新手引导，没有玩过dnd规则的，一开头真的会被这密密麻麻的面板和各种属性搞得头大，完全不知道是干什么的。当然这其实主要还是一个看剧情的游戏。但就剧情而言，东亚很难共情到宗教相关的。我个人也不喜欢什么权利、力量崇拜有关的东西，也不喜欢用故意用刺激性的画面和剧情去博人眼球的作品。好莱坞的剧本写作中会教你动机要原始，就是“生存”“性”“贪婪”一类的动机，这样才能引起人们的共鸣。但如果仅仅到这里戛然而止，未免太索然无味了，只能说非常安全且合理，但根本看不到几千年来的文化积累下了什么。然后背景设定也是经典的西方，对于东亚文化且不常玩游戏的人，初次接触是一脸懵逼。\n\n我小时候看偶像剧时，对偶像剧的评价是：“除了谈恋爱，就没有别的事情可以做了吗”。我现在对打怪涨经验这类游戏的看法，“游戏除了杀人，就没有别的事可以做了吗”。小孩子为什么会看动画看哈利波特，在随便一切台就是情情爱爱或者打打杀杀的电视剧里，动画的题材是在小孩能看懂的前提下最多样化的……柯南不香吗，魔幻手机不香吗。游戏也是一样的，我心中的年度依然是王国之泪。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[10,9]}]