[{"id":"2023-09-21","content":"\n草，突然刷到 [GPTK](https://www.applegamingwiki.com/wiki/Game_Porting_Toolkit)，可以在mac上直接运行windows游戏，有 Steam 和Epic 的教程。总觉得有亿点点魔幻。\n\n然后b站搜了一圈，前几个月就已经有人拿来运行赛博朋克2077和原神了……7瓦的GPU玩高画质原神，嗯更魔幻了……\n\n翻译一下：[Game Porting Toolkit(GPTK)](https://www.applegamingwiki.com/wiki/Game_Porting_Toolkit) 在 Wine 兼容层的基础上结合了苹果自家的D3DMetal，支持了 DirectX11 和 DirectX12 的游戏。但是用了反作弊驱动或DRM（版权保护相关的技术）的游戏通常没法运行。\n\nD3DMetal具体是个什么东西没搜到介绍，果子特色闭源，只能从名字上看出来是微软D3D到苹果Metal的直接转译。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[10,0]},{"id":"2023-09-20","content":"\n感觉需要扩大圈子，以免赛博社死……很奇怪，被夸会让我感觉负担很重，因为总觉得期望越大，失望越大，特别是当我觉得其实我所做的一切好像还有很多改进的地方并不值得被夸的情况下。当会受到越来越多的关注时，我就不自觉地想把这件事情停止了。明明知道经营个人IP和流量是当今社会下至少可以用作副业的路，但性格和想法完全背道而驰（笑）。要担得起个人形象，要学的越多；要学的越多，越觉得真正厉害的人都不是经营出来的。经营出来的只会给人一种华而不实的印象，算了吧。\n\n---\n\n这是一个长达半年的几乎什么也没做的时期。我开始回想一些仿佛发生在上辈子的事情，虽然不过也只是过去了三四年。如果说人一辈子都是江山易改，本性难移，那这三四年已经让我进入了下辈子。\n\n我第一次感受到什么是PTSD是在2019年的1月，只用不到一个周，听到某个人的名字就会应激、看到和某个人相似的长相就很恶心，提也不想提一句。起因无非是新环境的价值观不合一类的惯谈。如今连找工作都是双向的，但上学不是的，没有实习，没有试错的机会，周期很长，选择主动退出就是异类。就好像18岁前禁止恋爱，一上大学开始要求擦亮双眼找对象结婚生娃一样。本科专业是自己选的，不然在本科期间读不感兴趣的东西可能会发疯，也不知道是幸运还是不幸。\n\n大学开学时，俞敏洪来开学演讲，顺带推荐了一本书，就是吴军的《浪潮之巅》第二版。这确实是一本对行业历史介绍不可多得的好书，但一定角度上也是对于如今的互联网感到悲观的来源。书中的预言现在来说失效了许多，充分映证了人其实没有办法用发展的眼光看问题，因为人无法准确预测未来，开放的架构在走向封闭，互联网精神终归只是程序群体的幻想，人还是得吃饭。\n\n第二次感受PTSD是现在，只要一听到类似于“迁移学习”“数据增强”“Loss优化”“面试xx”一类的词，就会感到一股油然而生的厌烦。这很矛盾，因为我自己平时也常常把专业名词挂嘴边，但听到别人闲聊时说到这些就会烦到突破天际，而当别人带着一腔对AI领域的热爱来交流这些时我更烦了，但又不得不交流，一种堪比坐牢的体验。我对AI的烦从专业本身开始蔓延到了生活中，在大家都在吹大模型大数据新风口时，我边用边骂。很少出现好用的产品不想了解原理只想骂的情况。是什么原理呢？Transformer + 钞能力……目前没有一家公司能复现 OpenAI 的效果，这个东西从出生的那一刻起就是充满随机性的黑盒。「哔~ 您的丹炉天赋不足，建议回炉重造」即便AI真的是很火，现在好好研究一定能吃上饭，我也不会想在这里多呆一分钟了。\n\n想转专业的人又得成绩好，成绩好的人又得是想在自己专业有所成就的人，考王除外。况且在一个本来就很卷的专业，努力考前几名就为了转去一个排名差很多的专业，大部分人看来都是脑子进水。我不是一个会考试的人，不管题难还是简单，我永远都是差不多的分数，因为没有人会像我一样在碰上极简单考题的情况下靠着算错丢掉 30 分，在题很难全年级挂一半人时又因为没算错太多考90分。考研的专业课也差不多，很简单的题，但差点不及格，排名远不如平时成绩排在我后面的室友，纯靠那一年运气好录取线低考上的。总体而言，考试、刷题对我来说是一件很无聊很枯燥的事，我之所以会做题因为题库无穷无尽总有一些不会的东西，我想能理解到全部。但精准套公式算结果，精准地记住每一个时间点，记一大堆三纲五常，非常不擅长。\n\n我曾经在毕业后做ACG，但现在感觉确实太天真了。我不了解二次元，比起混圈只想好好画画。朋友说你可以从头引流接单的，现在画哈基米就可以赚钱，但我无法商业起来。我难以想象为了赚钱而每天花时间在重复固定的风格和题材上，明明最开始画画是发展副业，但越到后来越挑，同一种风格和完成度的极限是三张图，后来不满意这种画法又开始补基础。有时候真觉得以现在能接触到的资源已经做到了极限，即便曼奇助教说你画得已经比我的很多学生好了，但是学生永远还是学生，之所以是学生而不是助教就是因为水平不够。再之后必须要花很多钱和时间抛弃现在的一切去进修，并做好三年纯支出没有一点收入的准备。那时候就三十岁了，已经没有这个时间让我去耗了。家里是很普通的工薪阶层，父母在他们各自的同期同学里都算是混得最差的。我能做的只有独自坚持，没法向他们要求什么，也无法乞求他们能理解我。至少我的父母都在世，已经是万幸了。\n\n不想打字了，现在很混乱，很久没看过文学作品，句子都老长老长的，还喜欢用英文句式。又草草了事了，有空再说吧的很开心没有人关注我。说实话真的有人告诉我他订阅了时我第一反应是吓一大跳。\n\n\n\n\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[10,1]},{"id":"2023-09-15","content":"\n写 md 渲染时无数次考虑重构……封装好的轮子真是好难用，插件生态的版本不一致，光是处理接口一致性问题就要吐了。不管了先加再说。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[10,2]},{"id":"2023-09-14","content":"\n哇其实雨疏发招聘消息过来时真的会有想和雨疏一起工作的想法，但我不行啦，写不了论文啦。长久以来我都不觉得我是不适合工作，只是不适合瞎编。当然也没有很适合工作……但也就一般般啦\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[10,3]},{"id":"2023-09-08","content":"\n想想距离我所熟悉的互联网的历史已经八年了。虽然也没有到跟不上时代的地步，但也有点不想继续了，倒也不是累，而是渐渐觉得没什么意思，起初报相关专业仅仅是自己的兴趣，还有作为一个懒人，觉得好的科技真的会造福人类。现在产品都做得差不多了，每年都有新的概念可以炒，但炒来炒去好像又都是那些。屎山没有因为概念而变得不屎，新的屎山也没有因此减少。八年前不说多好，也算是有个清楚的视野。现在已经看不清前面的路了。我不否认AI在一些场景下很有用，但你们真的觉得AI是风口吗？AI即便能成为成熟的行业，在未来也是垄断大户，倒不是分发便宜和兼容性的原因，而是高成本、闭源、加上随机性不可解释性。这绝不是什么独立开发者和小公司可以承担的东西，这是互联网行业的重工，小模型的水平又明显太差，真不适合炒。\n\n虽然不像炒币是纯粹的不靠谱，但如果真的可以训练到替代人类，或者说至少代替我这样水平的人没问题，现有的体制还不变革，依旧没有养闲人的能力，还是在为卷而卷（现在已经有这种趋势了），那社会真的会完蛋。三四年后再看吧。\n\n我是很乐意看世界一起毁灭的混乱中立派，但其实会精神崩溃的人不太多，比如七年前我是不可能会这样的。只能说有时候不要同时接触太多方面，接触的方向越多，似乎真的越来越感觉没意思。但明明是因为觉得有意思才接触的。反而不如看童话。\n\n我清楚地知道童话是童话，也能清楚地感受到童话对立面的悲惨。2005年的恶作剧之吻，收视很高的台偶，当时我对偶像剧不感冒也没有看，只觉得电视剧难道除了爱情就没得拍了吗。最近又刷到看了一下，发现是个过于美好的童话。童话不是没有波折，而是总能以现实不可能的方式将波折收尾成美好的结局。江家一家开开心心招待湘琴时我居然一直在哭，怎么说就是自己好没良心（？）我好像有他们拥有的一切，但我感觉又是什么也没有。我非常讨厌江直树的性格，网上也有很多人说，江家的环境不可能有江直树这样的孩子。但同时我又非常能体会到，他在老爸生日和家人撕破脸的那一段的真实。他妈这么嗑CP，骗他俩在家。他爸骗他去公司实习，这些情节都太熟悉了，真的在里面不会觉得有一点好笑和幸福，读书是为了能选择，不是为了没得选择。但到头来，发现读不读书其实都没得选择，反而可能读了书更没得选择。因为真的有主观选择的人，不会选择读这破书。在线好友一和我反而到现在非常佩服能选择不读研的人，但他说你显然不是这种人，他说得一点也没错。\n\n感觉写太多了。无所谓哈哈，趁着博客衰退没人知道我是谁多写点。可能等我死后扒出我的几百个账号会被认识的人看见吧。\n\n---\n\n手动把之前的博客搬过来了。也没多少，写格式转换程序的时间都够我搬50篇了，不如 typora 粘贴，还补了一些新的字段。不过要是再来一次我不行了，我选择写脚本……现在来说会有点多了。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[10,4]},{"id":"2023-09-03","content":"\n恶补 [TS 类型体操](https://github.com/type-challenges/type-challenges)。因为每次想写可扩展的库就会发现，笑死，根本不会类型推断。总不能写啥都定死配置吧……说到底还是缺对 any 类型的把控，any就是动态类型，要写类形推断必定是因为有动态类型，在这都不说。像Go这种泛型出前，不同类但同样的逻辑的签名也要重新写一个函数。虽然可以在外层再封装到公共函数里，但调用方式就不一样了，有的方法抽象出来就应该在类上，还是泛型合适。强迫症这样真的很影响写东西，有一半多的时间花在标注上。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[10,5]},{"id":"2023-09-01","content":"\n为什么，ts的装饰器，不能单独修饰方法只能修饰类啊！反复写 try catch 很累的好吧！还不如被吐槽一万年的 go 的 if err 呢！我需要snippet……而且类只是个原型链的语法糖，但我用不到类啊！我真是只是想给一个文件里的方法都加个统一的错误处理而已，求求了。vscode没有什么好用的snippet插件\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[10,6]},{"id":"2023-08-31","content":"\n又写到了 Promise，感觉快忘完了汗，还是 chatgpt 教我转换写法。形式上的区别大概是  \n- 需要包一层 Promise 的异步方法需要一个回调函数，大部分时候参数是 err 和 data。而能使用 await 的方法无回调函数，直接返回 data。对于 err，使用 try catch 处理。\n\n在 fs 中的 fs.readFile 是基于回调函数的，只能在外面包一层 Promise，但是 Promise 写起来很长，并且不是人读的顺序。可以使用 `fs.promises.readFile` ，直接包好了一层promise，然后可以await 写了。\n\n我当时学 Promise 也挺痛苦面具的。JS 这一语言抽象方式不知道算不算是独一无二另辟蹊径格格不入个性十足……但由于是浏览器的唯一指定语言嘛，嗯大家都在用就不显得小众了。真的是纯拍脑袋做的抽象，和现实哲学抽象没有毛联系，生态决定一切\n\n另外chatgpt 感觉比bing好用，不得不说 bing 的实时检索反而是拉垮了回答质量。不相关的检索回答相比迭代了这么多次逻辑清晰的 chatgpt 的生成，哒咩哒咩。外部知识库看来有时候不一定是好事，还是得看怎么用吧。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[10,7]},{"id":"2023-08-30","content":"\n#工具 强烈推荐 Chrome 的这个[侧边标签页](https://chrome.google.com/webstore/detail/vertical-tabs-in-side-pan/akahnknmcbmgodngfjcflnaljdbhnlfo?hl=zh-CN)插件，得益于 Chrome 新版自带的侧边栏，这个插件比之前用过的所有页面内/外的侧边栏都稳定，当查文档几十个窗口时太有用了，看得全标题也方便随时关。有 Arc 的布局那味了。\n\n改东西改智障了，居然忘了 JSX 转 JS 是 React.createElement。我直接调用函数，汗，还在想怎么改个语法就没法使用 ServerSide Rendering……最后居然是做最小复现时用 Next.js 的组件发现这个弱智问题的。好想有大佬交流哇，好想去能问问题的环境。虽然自己的犯问题似乎都很傻逼……\n\n","tags":["工具"],"imgsmd":[],"sourceFile":"002.md","csrIndex":[10,8]},{"id":"2023-08-21","content":"\n由于之前的电脑接近丢失状态，找不回之前的文件，博客也停止活动了相当长的一段时间。嗯。现在决定清空，回到我的快乐小窝。还是需要一个没有任何人看的地方来吐槽的。推特吐槽着吐槽着就渐渐有人看，可能是整天中二精神病非主流言论过于显眼，吓得我现在只点赞……我都忘了我的第一个互关是怎么来的。微博倒是没有什么人看，但微博，额，各种东西都很难发出去，总觉得有人在监视你，和平台去斗智斗勇太累了。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[10,9]}]