[{"id":"2021-06-02","content":"\n找不到地方吐槽了…………\n\n真的想大倒苦水，前端的环境是个什么玩意儿！是在考记忆力吧！！！\n\n浏览器本来是让人公开更容易地获取资源的，做啥 App。还不是因为 UI 框架不通用，不然至于搞成现在这样？\n\n然后就是JS的标准，不同的runtime适配，天知道我最开始学 JS 模块找了一个 ts 写的 node module，教程上说得极其简单。然后发现，不知道浏览器怎么用。先是编译成了ES3发现怎么这么像commonJS，浏览器对 require 是不支持的。然后用ES6的语法，couldn't find the module。我知道为什么有这个问题但不知道怎么才能解决。折腾了快一天，最后还是打包工具解决的。别提打包，我本来是在学习来着，打包全都打好了我还学个啥？\n\n还行，虽然烦，比纯写文章好。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[11,0]},{"id":"2021-05-15 凌晨","content":"\n说真的， 最近就是间歇性的，没有兴趣。\n\n一个本该是不撞南墙不回头的人，放弃了一切，落得一身的空虚。竟然还妄想让别人把他从前的一切还回来。凭什么？\n\n一直都明白自己倒底想要什么，可冲突了，放下了。不是自己的问题吗？是自己的问题吗？是不是自己的问题？回答我到底是不是！！\n\n「返せ！取り返せ！」\n\n蹲着，头埋在胳膊里，没有灯光。\n\n妈的时常觉得自己内心戏太多快疯了。快去找工作吧上天，我一个人呆着会出事。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[11,1]},{"id":"2021-05-10 凌晨","content":"\n累了。\n\n我运动了很多，喝水喝了很多，因为我平时不发动态，反正不会被相信。\n\n就是努力了很多很多，最终小心翼翼地拿出来夸夸自己，也不被相信，还被倒踩一脚，我讨厌这种事。\n\n终究是不合时宜的自我感动。\n\n我希望有人可以相信我说的话，我希望我可以感受到别人在相信我说的话。我希望下次能听到的是“你很有进步啊”，而不是“我不信”。我不想为了获取关系中的信任而着急，而扯谎吹牛，而勉强自己，这就是pua，除了斩断联系我毫无办法。\n\n我想听正常的说教而不要充斥任何上下级“权威”的关系。上次在超市，一个小孩偷吃生鲜有冰块吐了，他妈妈在旁边气炸了，一直骂，非常引人注目，揪着孩子耳朵边走边骂，从商场负一楼到商场外，我们走时还在骂。要说是教育没错，可我想，孩子吐了已经很难受了，肯定下次也知道了，有什么好骂的。真的只是教育吗，还是一种“不听家长指挥”的发泄？\n\n我明白无条件的相信与爱是不存在的。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[11,2]},{"id":"2021-04-14","content":"\n靠，前段时间是什么诡异的发言。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[11,3]},{"id":"2021-03-22 下午","content":"\n一个认识很久的网友去参加从前很出名、现在依然在播但不那么出名的综艺节目了。大概是因为参加节目所以才注册了微博账号，然后每期营出来个业。我知道这事还是因为这位大v来主动关注了我的账号。感觉他能这样认识到更多的人，真是好事啊。\n\n但关于营业这一点我一直有不同的看法。他会组建粉丝群，有时候营业不知道说什么，就发点才艺什么的，作为粉丝福利。关于这一点其实没什么不好，我没有资格去说别人，只是以我的角度大概率是不会这么做。虽然是公众人物，毕竟也不是艺人，也没那么多粉丝，更多是一个圈子的人。要作为公众账号营业的话，还是多产出一些对大众有意义有价值的东西吧。做做教程、说点有意义的观点什么的。除非真的是艺人，或者有十分突出的个人气质，没什么人想看打游戏弹琴养花这种无聊的日常。当然如果是私人账号那想发啥发啥，开心就好。\n\n这个博客就是不考虑受众想写啥写啥的，爱灌水就灌水。\n\n给人看的东西和自己觉得好看的东西永远是两回事。给人看的东西以他人价值，换言之，用户需求为核心。自己觉得好看的实在是太小众了。当时小学期的小程序课想写rss被老师怼得体无完肤，说这有什么意义你该做个推荐系统。现在想来是角度不一样，我作为学生考虑的自然是能不能技术实现，当时连推荐系统的大概框架都不知道，而老师的重点这东西是有没有用。谁知道这课原来一点技术都不讲只是个画大饼的课呢。我为什么要折磨自己，还连累信任我的舍友逼他做数据格式转换。选个实验水课不好吗。\n\n要不我还是去前端吧，还是喜欢有社会心理学在内起作用的东西，反正最终目的是转行。\n\n------\n\n我最近被种草了一个洗袜子的机器，虽然很多人会觉得是交智商税，但我真的不觉得。\n\n为什么是交智商税呢？因为这个机器一次只能洗一双袜子，洗一次要一个多小时（因为要杀菌和烘干），而且不能洗脚皮和灰尘，只能洗能溶于高温水的东西，比如汗之类的。\n\n但我觉得，日常的袜子也没什么灰尘脚皮，我又爱出汗。每天只需要把袜子一放加点水，我就可以去做别的事了。想穿时直接拿出来就可以穿。我洗袜子所花的时间只有“加水”“放袜子”。我再也不用堆着手洗袜子了，还要想着晾干取袜子叠好收起来。洗袜子从一件一周一次的大事变成了每天微不足道的小事。\n\n不过以上的前提是，我不能忍受袜子和衣服一起洗，加了消毒液也不行。天天洗袜子又很麻烦，我就会尽量穿久一些，但这样鞋也容易脏袜子也会臭。所以我只能堆着手洗，每次洗很多的袜子，烦死了。\n\n同理，做清洁也是一样。我喜欢环境干净整洁一些，但是真讨厌把美好的周末花在家务上。要是有足够好用的扫拖一体机器人我就天天让它们扫三天让它们拖，反正白天人也是出门。这样周末躺着就行了，顶多清理下机器人。\n\n花钱请人也行。但由于我没有钱，我对人也不够信任又不喜欢去控制别人，还是作罢。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[11,4]},{"id":"2021-03-18 晚上","content":"\n回来就能感受到压力了，这是好事，省得整天瞎想。还没过年时他们就开始卷了。与我何干呢，我又何德何能呢。\n\n老S说他娘的不想打工了点儿生活都没有，打算去国企了。他这人之前加班很厉害的，多少还是让我有点惊讶。果然还是做自己喜欢的事才能忍下去，还真是天时地利人和，缺一不可。\n\n我才是对生活最不抱期待的那一个，却是最混吃等死的那一个。只要能满足我一点点精神上的需求就能当工作的永动机了。我庆幸自己有明确喜欢的工作，我厌恶自己抛弃了喜欢的工作，我憎恨没有勇气去做喜欢的工作。\n\n所爱的人来得不合时宜，更好的人依旧不合时宜；热情来得不合时宜，消失得不合时宜。\n\n来来回回四个字，不合时宜。\n\n不合时宜非天非地，惟我而。\n\n只希望能开心，有钱赚。有钱赚的秘诀就是开心着赚钱，这是沉没成本最少的做法不是吗。\n\n最近也不是很能控制好情绪。虽然我已经在逐渐恢复成INTP了，但Fi还是很高。Fi高时就会感受痛苦，整个人就会变得很艺术像发疯一样。说艺术家多少是疯子不无道理。昨晚哭过又草草画了个草图，觉得自己真的是越来越不讨人喜欢了，醒来自己都看着不舒服，是我画过的我最讨厌的画。\n\n\n","tags":[],"imgsmd":["![最讨厌的画](https://i.loli.net/2021/03/18/KiXjpdTtaoN1Hhy.jpg)"],"sourceFile":"001.md","csrIndex":[11,5]},{"id":"2021-03-16 晚上","content":"\n没有人是孤岛没错，但也没人规定非得是爱人。可社会规定了。\n\n六楼看出去，高楼林林耸耸，路灯是最忠实的守卫，静静眺望着每一个行人。永远直直地站在那里，看着很安心。\n\n楼也是生命，以人为血液。人在楼里衣食起居，熬夜加班。穿梭不息，远远看去就像蚂蚁一般。楼是稳定的，人是不安分的。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[11,6]},{"id":"2021-02-19 凌晨","content":"\n很久没有写过代码了。不停的与我无关的饭局。春节期间的厌食与社恐达到了顶点。对于内向型人格，不停的社交无法提交社交技能，只会更加讨厌社交，大概唯一的用处是能看到真实的人长什么样。\n\n很不容易，今天下午终于宅着开始写了点无关紧要的代码，心情终于好了一点。真正的工作还远着，还没开始，可能也永远不会开始。\n\n至少对于我，F是后天逼出来的，我确信这一点。如果说社会把外貌与性格联系成了刻板印象，那我原本就是与刻板印象格格不入那一卦的。什么人就该做什么这种话，可以硬生生把Ti逼成Fi。ルールはルールだ这种也是真他妈的讨厌，他の選択ねーじゃん？那人类社会进步个啥？\n\n“大过年的”“来都来了”“还是孩子“都不容易”\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[11,7]},{"id":"2020-12-04 凌晨","content":"\n昨天看到很久之前和Ayuくん写的歌词，又想写歌了。但想了很一会儿，还是没法先有歌词再写旋律。歌词于我而言真是音乐中最次要的东西了。\n\n然后打开garageband，又被其鸡肋的功能劝退了，还不如caustic一个小小的合成器。写歌这事，还是得等有钱再说吧，至少得有钱装4T的音源同时加载不会卡。不愧是最花钱又容易失业的行业。\n\n但还是感谢之前喜欢学理论的时期，让我用音乐可以表达的范围广了很多，现在不用太在意和弦调式音程不够丰富的问题了，但还需要研究旋律写作、节奏和制作。啊 ，东西还是有一些多的，都是后话了，先处理好身边的事吧。我完全没有资格谈论这些。\n\n要是对别人说“你事情没做完没资格谈论这些”想想就很残忍，理论上也不应该是这样，谁说一事无成就不能谈论音乐了，音乐是包容的。但对自己说这些话就非常的理所当然，因为我研究这些总会到一种吃不上饭的程度。\n\n野田洋次郎真是音乐天才啊。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[11,8]},{"id":"2020-12-03 05:05:50","content":"\n又没睡着。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[11,9]}]