[{"id":"2023-09-08","content":"\n想想距离我所熟悉的互联网的历史已经八年了。虽然也没有到跟不上时代的地步，但也有点不想继续了，倒也不是累，而是渐渐觉得没什么意思，起初报相关专业仅仅是自己的兴趣，还有作为一个懒人，觉得好的科技真的会造福人类。现在产品都做得差不多了，每年都有新的概念可以炒，但炒来炒去好像又都是那些。屎山没有因为概念而变得不屎，新的屎山也没有因此减少。八年前不说多好，也算是有个清楚的视野。现在已经看不清前面的路了。我不否认AI在一些场景下很有用，但你们真的觉得AI是风口吗？AI即便能成为成熟的行业，在未来也是垄断大户，倒不是分发便宜和兼容性的原因，而是高成本、闭源、加上随机性不可解释性。这绝不是什么独立开发者和小公司可以承担的东西，这是互联网行业的重工，小模型的水平又明显太差，真不适合炒。\n\n虽然不像炒币是纯粹的不靠谱，但如果真的可以训练到替代人类，或者说至少代替我这样水平的人没问题，现有的体制还不变革，依旧没有养闲人的能力，还是在为卷而卷（现在已经有这种趋势了），那社会真的会完蛋。三四年后再看吧。\n\n我是很乐意看世界一起毁灭的混乱中立派，但其实会精神崩溃的人不太多，比如七年前我是不可能会这样的。只能说有时候不要同时接触太多方面，接触的方向越多，似乎真的越来越感觉没意思。但明明是因为觉得有意思才接触的。反而不如看童话。\n\n我清楚地知道童话是童话，也能清楚地感受到童话对立面的悲惨。2005年的恶作剧之吻，收视很高的台偶，当时我对偶像剧不感冒也没有看，只觉得电视剧难道除了爱情就没得拍了吗。最近又刷到看了一下，发现是个过于美好的童话。童话不是没有波折，而是总能以现实不可能的方式将波折收尾成美好的结局。江家一家开开心心招待湘琴时我居然一直在哭，怎么说就是自己好没良心（？）我好像有他们拥有的一切，但我感觉又是什么也没有。我非常讨厌江直树的性格，网上也有很多人说，江家的环境不可能有江直树这样的孩子。但同时我又非常能体会到，他在老爸生日和家人撕破脸的那一段的真实。他妈这么嗑CP，骗他俩在家。他爸骗他去公司实习，这些情节都太熟悉了，真的在里面不会觉得有一点好笑和幸福，读书是为了能选择，不是为了没得选择。但到头来，发现读不读书其实都没得选择，反而可能读了书更没得选择。因为真的有主观选择的人，不会选择读这破书。在线好友一和我反而到现在非常佩服能选择不读研的人，但他说你显然不是这种人，他说得一点也没错。\n\n感觉写太多了。无所谓哈哈，趁着博客衰退没人知道我是谁多写点。可能等我死后扒出我的几百个账号会被认识的人看见吧。\n\n---\n\n手动把之前的博客搬过来了。也没多少，写格式转换程序的时间都够我搬50篇了，不如 typora 粘贴，还补了一些新的字段。不过要是再来一次我不行了，我选择写脚本……现在来说会有点多了。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[11,0]},{"id":"2023-09-03","content":"\n恶补 [TS 类型体操](https://github.com/type-challenges/type-challenges)。因为每次想写可扩展的库就会发现，笑死，根本不会类型推断。总不能写啥都定死配置吧……说到底还是缺对 any 类型的把控，any就是动态类型，要写类形推断必定是因为有动态类型，在这都不说。像Go这种泛型出前，不同类但同样的逻辑的签名也要重新写一个函数。虽然可以在外层再封装到公共函数里，但调用方式就不一样了，有的方法抽象出来就应该在类上，还是泛型合适。强迫症这样真的很影响写东西，有一半多的时间花在标注上。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[11,1]},{"id":"2023-09-01","content":"\n为什么，ts的装饰器，不能单独修饰方法只能修饰类啊！反复写 try catch 很累的好吧！还不如被吐槽一万年的 go 的 if err 呢！我需要snippet……而且类只是个原型链的语法糖，但我用不到类啊！我真是只是想给一个文件里的方法都加个统一的错误处理而已，求求了。vscode没有什么好用的snippet插件\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[11,2]},{"id":"2023-08-31","content":"\n又写到了 Promise，感觉快忘完了汗，还是 chatgpt 教我转换写法。形式上的区别大概是  \n- 需要包一层 Promise 的异步方法需要一个回调函数，大部分时候参数是 err 和 data。而能使用 await 的方法无回调函数，直接返回 data。对于 err，使用 try catch 处理。\n\n在 fs 中的 fs.readFile 是基于回调函数的，只能在外面包一层 Promise，但是 Promise 写起来很长，并且不是人读的顺序。可以使用 `fs.promises.readFile` ，直接包好了一层promise，然后可以await 写了。\n\n我当时学 Promise 也挺痛苦面具的。JS 这一语言抽象方式不知道算不算是独一无二另辟蹊径格格不入个性十足……但由于是浏览器的唯一指定语言嘛，嗯大家都在用就不显得小众了。真的是纯拍脑袋做的抽象，和现实哲学抽象没有毛联系，生态决定一切\n\n另外chatgpt 感觉比bing好用，不得不说 bing 的实时检索反而是拉垮了回答质量。不相关的检索回答相比迭代了这么多次逻辑清晰的 chatgpt 的生成，哒咩哒咩。外部知识库看来有时候不一定是好事，还是得看怎么用吧。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[11,3]},{"id":"2023-08-30","content":"\n#工具 强烈推荐 Chrome 的这个[侧边标签页](https://chrome.google.com/webstore/detail/vertical-tabs-in-side-pan/akahnknmcbmgodngfjcflnaljdbhnlfo?hl=zh-CN)插件，得益于 Chrome 新版自带的侧边栏，这个插件比之前用过的所有页面内/外的侧边栏都稳定，当查文档几十个窗口时太有用了，看得全标题也方便随时关。有 Arc 的布局那味了。\n\n改东西改智障了，居然忘了 JSX 转 JS 是 React.createElement。我直接调用函数，汗，还在想怎么改个语法就没法使用 ServerSide Rendering……最后居然是做最小复现时用 Next.js 的组件发现这个弱智问题的。好想有大佬交流哇，好想去能问问题的环境。虽然自己的犯问题似乎都很傻逼……\n\n","tags":["工具"],"imgsmd":[],"sourceFile":"002.md","csrIndex":[11,4]},{"id":"2023-08-21","content":"\n由于之前的电脑接近丢失状态，找不回之前的文件，博客也停止活动了相当长的一段时间。嗯。现在决定清空，回到我的快乐小窝。还是需要一个没有任何人看的地方来吐槽的。推特吐槽着吐槽着就渐渐有人看，可能是整天中二精神病非主流言论过于显眼，吓得我现在只点赞……我都忘了我的第一个互关是怎么来的。微博倒是没有什么人看，但微博，额，各种东西都很难发出去，总觉得有人在监视你，和平台去斗智斗勇太累了。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[11,5]},{"id":"2023-03-17","content":"\n有点烦，换了个电脑，但有Git 有挺多分支是没有同步的，比如博客就是……但又不想建一个私有仓库，一个博客建立 3 个仓库多少有点无法接受……\n\n决定了，开个全是私有仓库的小号吧……\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[11,6]},{"id":"2023-03-05","content":"\n每次写 1000 字就到头了，真的硬编。有什么好写的。可能也是我做 summary 有一点困难。我很难非常详细地去描述一个事情，包括自己做的，因为我倾向于用最简单的方式去理解它，细节先通通省略掉，这样会使得我写的东西架构看起来非常简单。我画图也是这样，草稿就真的没有细节，细化时在疯狂加东西为了看起来丰富。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[11,7]},{"id":"2023-03-04","content":"\n我发现我只要不是写学术都挺快的，或者说不拘泥于文风（可以拘泥于格式），把事情说清楚为目标，就真的挺快的，并写会因为想到什么写什么，补充得还比较多，就是逻辑最后得整理。日更两万不是梦（误）\n\n但一旦要字数要求、风格要求，这就变成了噩梦。最不擅长的就是装了。字数要求就是毛病，真的，毕业论文写得比期刊的投稿都多，含金量不到十分之一。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[11,8]},{"id":"2023-03-03 03:55:01","content":"\n真的写不完了，我还想早点睡觉。每天都在写垃圾乐色rubbish。还通知要中期补答。我他妈……不好意思见笑了。\n\n继续熬夜。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[11,9]}]