[{"id":"2023-11-03 22:50:03","content":"\n今天是 Clash 全系删库的一天。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[12,0]},{"id":"2023-11-02 22:20:54","content":"\n#工具 IPA签名工具：[轻松签](https://esign.yyyue.xyz/)。\n\n今日重要新闻：Clash for windows 删库。原因不知道。有说是晒车牌的，有说是推发了太多个人信息的，有说是内置机场被抓的。\n\n对不起我写着写着代码又开始画画了……这次是一个能画完的独立故事！不是片段了！加油！不加戏的话，九图可以画完！但我是真的会一边画一边加戏……\n\n啊好肝，肝起来根本没有时间写论文。\n\n\n","tags":["工具"],"imgsmd":[],"sourceFile":"002.md","csrIndex":[12,1]},{"id":"2023-11-02 03:39:17","content":"\n说来面包推荐了一下 [nextra](https://github.com/shuding/nextra)，我哭了，这不就是，我要的 60% 的功能都有，在这重复造啥轮子呢……\n\n然后想看看他们 rehype 这一圈的文件是怎么组织的，学一学，要被这生态圈里类型不一致问题和版本兼容性问题搞疯了（真的先学后端语言的人会有强类型强迫症）。\n\n然后我就看到了：`// @ts-nocheck` \n\n（手动拜拜微笑脸）\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[12,2]},{"id":"2023-11-01 03:33:06","content":"\n看了一下 [next-mdx-remote](https://github1s.com/hashicorp/next-mdx-remote/blob/HEAD/src/rsc.tsx) 的 SSG 实现，汗，原来 getStaticProps 直接传的函数字符串。然后用渲染时还原函数。相当于函数的序列化与反序列化吧……\n\n```ts\nconst fullScope = Object.assign(\n    {\n      opts: jsxRuntime,\n    },\n    { frontmatter },\n    scope,\n)\n```\n\n其中的 jsxRuntime 是通过 process.env 动态获取的，也就是可以区分是生产还是在是 Dev。\n\n总结一下就是，核心功能包括 SSR 依赖的是 mdx.js，只要能传函数 render 为一个 RSC (React Server Components) 就可以了嗯……这个库只是包装了一下下静态渲染的功能，核心渲染还是 mdx.js 做的。mdx.js 的解析核心又是unist……但比起解析我更想看 rsc 的底层是什么……我又不行了……\n\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[12,3]},{"id":"2023-10-31 14:22:26","content":"\n抠完样式和搜索了，现在要抠交互，交互写起来有时候很有成就感，有时候又没有，但大部分情况下是没有。\n\n架构的部分写起来很痛苦，但是后续开始复用时，就觉得我草我真牛逼。\n\n后端除了架构外大部分是在 debug，成就感取决于日志的输出情况。\n\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[12,4]},{"id":"2023-10-29 01:13:43","content":"\n对于 #博客 我也有另外的打算。\n\nmemos 页我要考虑重新布局，做成动态页当主页，还是多一些社交元素进来，确实我现在用比较多。\n\n- 有可能做成无限滚动的吧，留言板放侧栏，手机上的话，嗯，确实算是个有点麻烦的问题呢…………我是比较讨厌手机常驻浮动图标的……\n\n- 把 date 的统计数据加上，再做一个流行的小日历。\n- 支持带九宫格图，主要影响渲染，解析又得重写。之前为了省事直接用的现成的mdx的渲染，现在就是一把心酸泪，要重写的东西还挺多的……而且，emmm，图文分离真的是好事吗？其实对于图像博主来说确实是好事。但对长文就不是了。但长文我又有 Posts 页面。\n- 另外还有图床的问题，由于我白嫖的 github 倒是从不考虑图像大小问题，上传图片前我也有压缩强迫症。但万一以后我想换到别的图床……算了，到时候再改吧，短期内没这个打算就是了。\n- 支持标签的解析，memos 支持标签过滤，但这又是个对于静态博客来说非常麻烦的搜索问题，需要提前生成索引文件，索引文件的维护也是个大问题，每个分析都得带有原文件位置和CSR文件位置防止失联。有时候真的想上sqlite3来存这些乱七八糟的东西。真想问问有没有一个库叫逆ORM，就是把一个 的 object list  当关系型数据库使，来构建一个新的Object……结构转换太常见，我觉得得有这种库，只是我不知道。\n- 另外要分析的东西比较多的话，memos的底层设计就得重新考虑了，必要时直接读进内存吧，不然又是在不停对磁盘io……特别是当要分析的东西比较多的时候。\n\n然后还有i18n，我突然又怀念起了中文UI，觉得中文UI很好，直接放字在那里也很精简。之前设计博客的时候，我就只想装，几何感强的英文是就特别好的选择。但现在的瓦塔西非常实用主义……\n\n另外，随着页面增多，构建速度越来越慢了。\n\n对于memos和索引，我可以构建索引改变build时的状态。但是pages这个我是真的没法控制会不会被重复build，除非我去改变Next.js框架的build行为。但这样的话，额，我又是为什么要用这个框架啊（扶额）\n\n如果谁还说 Next.js 适合个人静态博客，我就先给他个大逼兜。要么老实用 Hugo 和 Hexo，至少人家有针对博文的 build 优化。要么做成动态的，上 CMS 。千万不要用 Next.js，会变得不幸，嗯。\n\n不说了，一把心塞泪，原来静态博客的尽头是动态。\n\n\n\n","tags":["博客"],"imgsmd":[],"sourceFile":"002.md","csrIndex":[12,5]},{"id":"2023-10-24","content":"\n最近把作息调过来了！撒花ヾ(≧▽≦*)o～\n\n嗯……不过调整的过程不具备任何参考价值。我已经纯白天睡觉超过3个月了。中途试过调整几次都失败了，还会半边脸长满痘。同时做什么事情都感受不到时间的流逝，很容易两三个小时刷地就过去了。\n\n下面内容的省流版：因为用爱发电而恢复了执行力。\n\n这次调整开始于国庆时，也就是10月1日的那一天，我特别想画同人（因为原作者停更了，但我想看日常……），然后就开始写小剧本。用2天配好环境，顺便发了个视频，摸索了下流程，画了3天，50多格，最终画了5条。这时候我都是全程晚上画的，虽然我很想白天画，但白天撑不住。\n\n然后开始画花絮，有4条。我的计划是2天画完一条半（不过分吧真的不过分吧）但是我发现，我每画一条就没力气了。创作有一种类似能量条的东西，MP耗尽了需要缓缓。\n\n之后的第三篇。这次只有约20格的小短篇，只有一条半长。但我竟然画了4天。下午起来处理一下生活上的事，上上网，晚上画4个小时后，吃饭，又不想画了，在阳台上看天明，一坐一个多小时，过一会儿就到了白天，感觉很困。\n\n熬夜会使精力变差，几乎除了凌晨，我无时无刻都很困，没有精力进行任何主动的脑力活动，但也睡不着觉。\n\n画完第三篇后，花了整整两天想第四篇的脚本。第四篇画下来可能有80格吧，还有一天画了废稿，边画边改剧情，很慢很痛苦。由于需要精力，困了就睡，这时候睡觉是两头倒，早上睡4小时晚上睡4小时，醒来就开始强迫自己想剧本或者吃饭。我当时觉得要画7天，没想到7天过去，我只画了两条。\n\n这时候我自己先受不了了，太低产了，这么久就画这点东西。我一没创作MP了就会开始看 Lofter 数据，到后面可能十分钟一刷。这不行，于是告诉自己，如果连续三次看 Lofter，那我立刻滚去干其他事情。\n\n事实上非常奏效。虽然我每天能画的时间还是只有三个小时左右，然后依然是陷入创作MP耗尽的状态。但我干的事情变多了，也没有再无尽地刷视频。\n\n两天后，我在淘宝下单了缺了好几个月的生活用品，并且隔天就去拿了，没有拖延。换到从前我可能会拖三四天才去。\n\n期间我的本科室友来出差，吃了个饭，很庆幸，她来的时候我是两头作息而不是白天睡觉，白天一整天都可以约。她说她心态变了很多，不是很能理解我了，也不能理解过去的她自己。不过我不介意。\n\n再往后，我试图把两头睡的时间慢慢合并。\n\n三天前，我是9点睡的，2点醒了一次，很清醒。又睡，早上5点醒了。\n\n两天前，我是10点睡的，5点醒了一次，又睡，早上7点醒了。\n\n昨天，我是11点睡的，5点醒了一次，又睡，早上8点醒了。\n\n今天和昨天一样。\n\n中途醒的原因主要是饿的。看过一个说法是，睡得太少因为什么激素的关系，会觉得饿，即便你其实不饿。确实如此。\n\n在开始画同人那几天，我12点刚吃过饭，画了两个小时，2点就饿得不行，感觉饿得胃痛。但是我躺下去5分钟什么都不想，立刻不痛了。\n\n为了让自己不感到饿，我几乎每4个小时就得开始吃一顿主食。5点正是我一般吃主食后的时间。\n\n还有一天白天睡觉时，我都是刚吃过就去睡。但还没睡着就肠腹空鸣。醒来胃痛，整整两天怀疑自己是不是有胃穿孔。\n\n现在每到凌晨5点左右，我是会被饿醒，但强迫自己睡着，至少到7点。\n\n希望可以坚持下去，至少为了我想看的 cp 有后续。\n\n我也很开心有人看我的作品是和我是一样的想法——原作代餐。同人圈有很多人是为了展示的画技、提高知名度去画插图类的。插画画得好可以让人一眼入坑。\n\n漫画是费力不讨好的事情，一页插画的时间画一页漫画画面质量至少降低50%，只有在坑底的人才会去看，画了又不能找工作（国内漫画躺平好多年了）。不过还有更惨的，就是同人文作者……如果原作本身就是图片类的，写文基本没人看……\n\n幸好我的 cp 原作是火柴人漫画，谢谢作者为了画得快用了火柴人。不过很多人是动画入坑，看插画的人远远多于漫画。但漫画本身的铁杆粉也是不少了。加上最近第二季也在动画化，虽然制作很拉，但有在播就有热度。\n\n实际上这个坑也不算真的冷坑。在今年6月份，原作的剧情创作类停更一年半后，我也心血来潮画了一张插图发在微博，那张有700多赞，对于一个粉丝不到30、流量全靠扶持的人而言，在同期超话的产出来说也算多的。后面我上号看的时候也吓了一跳，以为最多一两百吧，因为那个超话里做饭日常有50赞都算好的了。\n\n说着说着又开始分析数据了……我想说的其实是，如果所有的坑都能有办法延续就好了。我也想过，会不会有一种写故事模式，类似开源软件，由 maintainer 去 pull request 支线故事。但这个点子刚冒头，我就掐了。\n\n“您是否在找：SCP基金会？”\n\n软件没有那么多因果论，可以这么做模块化。但故事不行，大家需要的只是一个完整的、前后通顺的、精彩的故事，碎片化的、很多的支线绝大多数情况都不是什么好事。你以为你是东方？是FGO？\n\n打字打了快一个小时，去吃饭了，再见。\n\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[12,6]},{"id":"2023-10-12","content":"\n啊，愁怅，写了2000字又写卡壳了。\n\n啊，原来是惆怅，不是愁怅。\n\n怎么收尾都不满意，太浮于表面，共情不到，也就体会不到。\n\n只有不同的设定、深刻的意义去想。但我写它的目的就是为了避开设定和意义去讲故事。\n\n但我同时一想，感情讲得很拉的故事、烂尾的故事、为了戏剧故意制造冲突的故事，也是不要太多……其实大家普遍都很废，嗯。完全真实的发展，叫生活，作为故事讲出来挺无聊。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[12,7]},{"id":"2023-10-06","content":"\n《献给阿尔吉侬的花束》是有生以来看过最刀的一个小说，没有之一。从一开头就能闻到刀味，后半本差不多是哭着看完的。\n\n这本书有着我非常喜欢的行文方式。内容很刀，但行文如同书名那般亲切与温柔，节奏恰到好处，用简短的话语交代完复杂的事情，情节的衔接有画面感。没有冗杂的长句，没有晦涩的词汇，没有翻译腔。大概是“让所有人读得懂”和“意识流”之间我所憧憬的最完美平衡。\n\n--------\n\n写完发现下面越写越自我了，大概是知道心理学上需要从记录中认清自我，所以一看人文类的书就会触发这样的习惯。算了，划个分界线吧，下面只当是反思好了。\n\n---\n\n最近感觉内在匮乏到了一个极点，所以想把笛子从前推荐的书目都看一看，不管看过的没看过的。自从上大学后看的书都变成了类似教学目的的书，已经很久没有看小说了（网文除外）。从前看到笛子书单时，也不是阅读的时候。那时看了我也不会太理解。\n\n高中时为了学英语，路过一家装修环境特别好的饮品店，书架上有一堆原著书，于是在那里呆了三个小时看了不起的盖茨比，却连人名都记不全，让我坚持三小时的，只有一个学好英语的信念，好像学好了英语，我就能了解更多我不能了解的事情。就像白痴的查理•高登说，我想要变匆名，这样就有很多人会喜欢我，可以坐在桌前，能谈论很多我不知道的是情。尽管相比于查理•高登，我没有智力障碍，但从心理成熟度说，我和他没什么两样。\n\n当我真正开始理解后，宁愿永远不要明白，只想远离人群，这个世界就是一团乱，从来都是。不过并没有太大性格转变，可能是因为智商并没提高吧（笑）如果说人的现在由过去塑造，我既不是智力障碍，对过去的认知也没有发生什么根本性的转变，清楚地知道所有人在某时某刻说的话有什么隐藏的情绪。只不过渐渐认清了自己是个十足的理想主义者，我的一切行为基于理想主义。有人基于权势，但有人基于自尊，有人基于最本质的玩劣。同样的话，同样的情绪，背后的却有着根本性的不同。我第一次认识到，相同的表象背后本质却有如此大的不同，人与人之间的壁垒是如此之大，是如此的不可相通。\n\n很庆幸我是在明白这一切后看的 EVA，特别是剧场版的真心为你2，那一大段意识流讲述的就是类似的事情，碇真嗣在此时感到绝望而主动接受人类补完计划（破除心之壁），直接把这部动画上升到一个原本没有的高度。但结尾他最后还是接受一切的痛苦回归了现实，突然感到自己也被鼓励。尽管至今不理解为何会如此结尾，但不论原因，这是对所有抱有同样心理的观众的救赎。理想主义者是这样的，当无路可走时，会鼓励自己去相信而忽略逻辑。如果真嗣君选择让人类归于混沌，那才真的是一部致郁动画。\n\n有一段时间我非常喜欢拿这一段解压，看了之后仿佛人重获新生。EVA对于科技描述也非常抽象，不是考古式的古代科技，也不是现代的商业科幻美术风格，而是介于人与现代科技之间的抽象，去探讨哲学意义意外搭。\n\n--------\n\n下面更自我了，全是回忆过去。和书没有任何关系。\n\n--------\n\n20岁之前逻辑占绝对上风，现在怎么看都是心智有部分缺失，总想追求什么东西，但我不知道，学业也让人没有时间去思考其他的事。初中时录精品课比赛，我在油纸伞上画抽象的线条，蓝色的，像是蛇，又像藤蔓。美术老师问我我在画什么，我却一点也无法回答，我不知道为什么我想画，只能说，我在画线条。老师一顿，说，是在画抽象的东西吧。我很疑惑，想问抽象是什么意思，但对着镜头与麦克风实在说不口。\n\n画画是一个从小自来的兴趣，我完全没有学画画却报名了画画的比赛，还向老师要了速写的图，天天在宿舍画室友，比赛当天却睡过了头，靠着同学的比赛完的电话吵醒了我。我没什么意图，也不为此感到可惜。后来看柯南，高一时画到凌晨3点第二天上课哈欠连天，数学老师点名批评数学科代表，教室里传出一片的不可置信的声音。但我一直画不好画，如同木偶般僵硬，我不知道为什么，只是觉得我好像是在追求一种我得不到的东西。现在看来就是人文素养。智力占上风，会依靠模仿表演才艺，内在却是迟滞的，和这些人文类的事情扯不上任何关系，当涉及创作时我的脑子里不是无法表达抽象的想象，就是无法表达的感情，之后再空无一物。我一直在寻找能表达的方式，文字非常匮乏，所以转移到了音乐，转移到了画画上。但对于大部分人，当一个会表演的木偶就足够了，我无法触及到这些事物的核心，直到外界矛盾尖锐到严重违背潜意识，开始读心理学的书籍才渐渐明白一切。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[12,8]},{"id":"2023-10-05","content":"\n绝大部分情况下我都不希望回到过去，但看老漫画时还是真的很想回到小时候。很大的页面，不用挤在巴掌大的屏幕上看小字，一篇一篇翻着书，还有编辑的吐槽。是精心编排的东西。更重要的可能还是每周、每月看到更新时的期待吧。去报亭前什么也不干，只有那本书，路上没有博眼球的推广，也没有乱七八糟的想法，那种心情是无论如何再也回不来了。\n\n现在来看那个时期的漫画，杂志连载的小四格有那个时期的文化，现在变得太多了。其实在印象里也不是很久远的事情，但一算时间竟然过了十几年。也不是说现在不好，但有的体验就这样永远没有了，挺可惜的。自从网络平台出现后，选择多了，但反而更难看到好作品的出现，越来越多快餐流水线，漫画作者也越来越难。有妖气上原来有好多个人灵气十足的作品，现在也已经关了，但作者的作品也没有迁移就这样消失掉变成绝版，只能去贴吧考古。近些年看到国漫崛起，都是动画仰卧起坐，漫画永远躺平。\n\n总之就是只是上了个大学，回头才发现好像世界全变了一样。我适应互联网可能也是仰卧起坐。有时候觉得很好，觉得科技会让世界变得更好。但有时候无比讨厌，觉得由于互联网的介入少掉了很多原本重要的东西。科技在带来方便催生新事物的同时，也让会让旧形态消失。表现形式是次要的，整个环境变得这么快这么浮躁时，就已经不单是表现形式的问题了。当年混贴吧十几个人评都觉得很热闹，感觉每个人都是活生生的可以交流人，可以加十几个好友一起聊。但在微博发贴，只有十几评就仿佛是没人看一样，很多人也只是路过看个乐子，面对的是冷冰冰的数据而不再是人。bbs的氛围不是如今靠转评赞推荐系统可以替代的。\n\n有时候也在想是不是自己的原因，毕竟从前发贴动不动就说“大家一起交流\"。现在：好累啊，自嗨就够了，没有精力再交流了。\n\n还好有博客，只有这个博客会让我觉得没有那么多的浮躁，目的是单一的，也不纠结有没有人看。如果有一天我死的大概这个博客是我的最后遗产吧哈哈。听说人死后警方会把死者生前所有的账号都发给家人。我不知道会不会被发现，毕竟一百多个账号整体起来也是一件困难的事情，即便是都有，也得有人知道我这些一大堆的服务东西都部署在哪的，特别分散哈哈，可以不花时间维护全感谢平台的稳定性，当你不维护时总有平台在负重前行。\n\n另外最近看贴吧，发现有人给我 FGO 的那个页面评论了说数据没更新……但我没法回应了，这就是想一出是一出的结果吧，不玩了就弃坑，蛮不好的，我也不知道我有什么能长期坚持的稳定创作型项目，这个角度想，还是上班比较好，能平衡一下我想一出是一出的体质。所有的创作感觉都是需要不断学习，又不断想新的点子，要维持下去个人压力非常大，绝对不是能以 KPI 去评估的。我心态也远不如小时候那么好了，年龄和钱的焦虑不可能没有，不过二者选一的话主要还是钱的问题，也就是生存问题，确实无法生存是不配谈创作的，即便创作是工作，生存不下去时也不过是创一些机械式的流水账。总有人觉得生成式 AI 会代替创作，只能说这些人根本不知道什么是创作。表象很花时间，或许可以用AI代替，但创作真正需要的你的经历、情感、主旨，独一无二，无可替代。\n\n我比任何人都希望有一个 AI 笛子去续写笛子再也不会写的故事。但很显然，不可能，不管是单恋史，还是你什么都没看见，还是绿蓝的两个长篇，那样独特的、温暖的、细腻的、非套路的故事再也不会出现了。她的独立故事很多是可以拍成电影的，确实一些中篇独立故事也有比较长的动画（40分钟左右）但现实就是有大量好的个人剧本无人问津，能搬上屏幕的都是深谙处世之道的人。很矛盾，怎么来说都觉得，太可惜了。\n\n罗小黑是幸运的，找到了投资人，第一部大电影成功了，木头也是有很强执行力的人，不过寒木春华在动画毕业生找工作界还算是黑名单公司w 个人工作室总体来说都是条件艰苦，到现在也不是什么有钱大公司，只能负担小成本的制作。要说出活又快又好还是得看大公司的流水线，但目前明显就是流水的工业糖精。这又是一件另很矛盾的事情了。AI只会让工业糖精变得更加工业糖精，AI对于文化环境的影响，我始终持悲观态度。\n\n---\n\n还是很开心，同人作品画了两期，还是有人看的，大概是近期内的这冷圈里的最热贴了，平台也没限我流，有推荐机制都给推了出去，如果能坚持下去数据上应该会有好的结果（除了无法解决吃饭问题）。但我也是那种想一出是一出的人哈哈，懒散惯了，需要更自律一点才行呢（感觉台词写多了直接改我口癖……）\n\n值得一提的是 Lofter 的推荐机制的存在感超强，每过一段时间就有“恭喜你的作品获得持续加热！原因是blablabla”，好像生怕作者以为没人点赞是平台在限流。微博那个靠超话管理员加精推出去的。b站的专栏我不懂怎么有人会看见的，只知道有的是从别的平台跑过来看。毕竟专栏还在公测，我也不是新人up，没有流量扶持什么的。不过b站专栏的 SEO 非常不错，也不知道怎么做到的，我只知道视频页他们是有专门做 SSR 优化 SEO 的。感谢B站专栏，用来放漫画超级合适，不然国内我还真不知道要放哪里合适，嗯。说来b站最离谱的应当要属于我在18年随手发了第一个视频结果那个视频有1w播放，在18年还算不错了。现在可以确定的是b站对新人up都有流量扶持。只要第一个视频质量不错能看到的人会挺多的。\n\n---\n\n天啊，为什么我写论文不能保持这种两小时2000字的水平？\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[12,9]}]