[{"id":"2023-01-30","content":"\n今天是长篇的闲吹。\n\n自从谷歌翻译退出中国，Chrome 自带的翻译不开全局代理就没法用了。一直没有管，因为要翻译的场景比较少，遇到真的需要翻译/懒得看长文的时候就用 Bob 划词翻译了。今天有需要又看了下，发现还挺怪的。只要开一次全局代理，后续翻译走的就是 SwitchyOmega。看了一下 v2ex，有人测试说只有第一次会强制直连，后续的 API 请求是走代理的。好怪，不知道什么原理。\n\n经常看到有人把博客背景色设成黄色，说是白色太刺眼了，为了护眼。我寻思着白色的书也没人说刺眼，你们就不能把显示器的亮度调低点？舒适的白色应该和你在当前环境下翻开一本白色的书差不多，略微亮一点。我一直都习惯比较低的亮度，亮度稍微一高就觉得晃眼睛，不拉窗帘睡觉到早上绝对是蒙着头的，晚上手机亮度调到最低后还要降低 50%的白点值才会比较舒服……除非是有专门设计夜间模式的应用。要是问“你为什么想到设计夜间模式”，我还蛮想说 Why not，晚上的这些电子设备真的是很刺眼，久了容易青光眼。而且，比较暗的环境光会更容易集中注意力。\n\n类似于我爸每次看我拉上窗帘都要打开，说眼睛看不到对视力不好。得了吧，让我看屏幕反光吗？\n\n有好多有用的 C 端工具是大量的数据 + CURD 整合。说实话，CURD 容易复用，处理数据却是必不可少但又脏又累的活，是一切的前置条件。连 ai 也不能例外。能有好的数据集，那什么都有了。正对应着内容产业一向重要但也一向不被受重视，因为是需要大量人做、谁都能做的重复工作，程序员会觉得麻烦，除非是一个爬虫就能搞定的了。医院很多病其实都比较常见开方也比较重复，我妈说这么多处方，不能写一个系统把常见病自助开方吗。我：？？？不是处方多了机器就能开出正确的处方的啊喂，病人的身体信息还得全面，知道是什么常见病就开方不如网上搜……也就感冒狂吃中成药可以这么干了。而且医院也会有“流行药”，中成药经常在换着流行，也有万年不动的抗病毒和板蓝根。抗生素还得看生产厂家，一般是新药出来的时候，吃的时候比较少，基本每次到需要依赖抗生素的时候我都发现换了个流行的抗生素。电视上经常打广告的复方药在医院不怎么流行，~~可能是觉得有损他们的专业水平~~因为医院供货商通常不需要在电视打广告做零售生意。胃药就是的碳酸铝镁和奥美拉唑。真的就网上都能搜，开方有什么好开的，还是看病比较难一些。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[13,0]},{"id":"2023-01-27","content":"\n我爱上网冲浪，被迫营业一个多月了终于可以静下来，还是冲浪看 Tech News 比较放松，不管是多无聊的新闻都觉得很好看。RSS 攒了很多没看，看的太多了列举不完，印象最深的还是 2022 年前端生态圈的统计数据。\n\n- [State of JS 2022](https://2022.stateofjs.com/)\n\n再关注一下裁员问题\n\n- [Apple: The Only Big Tech Giant Going Against the Job Cuts Tide](https://blog.pragmaticengineer.com/apple-job-cuts-tide/)\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[13,1]},{"id":"2022-12-27","content":"\nMac鼠标软件推荐：Mac Mouse Fix。主要是解决接鼠标的体验问题。\n\n- 最开始用的Scroll Reverser解决鼠标滚轮方向问题（是的2202了mac还是不能单独改鼠标滚动方向）发现无法控制滑动距离，也没有平滑滚动，VSCode里看文档时滚一次都不知道滚到哪里去了。\n- 后面用的Mos，加入了滑动距离控制与平滑滑动，但似乎平滑曲线得有点太过，游戏时切物品栏滑一次切好几样。\n- 上述两个在更改鼠标方向后，垂直滚动的方向对了，但按shift水平滚动方向是反的\n- 鼠标不能对图片放大缩小。由于mac是触控板操作，app大多不会把垂直滚动映射为放大缩小。\n- Mouse Fix解决了上述所有问题。对于放大与缩小，操作是cmd+滚轮。\n- 但是Mouse Fix默认设置给了中键很多别的功能，建议关掉，不然没法中键关Chrome标签页，很多3D软件（如Blender）的操作也受影响\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[13,2]},{"id":"2022-12-23","content":"\n读书不会磨人棱角，但打工会，所以读研=打工。根本没有从中获得任何学习的感觉，只是单纯在重复写上十几遍没有需求也没有实践的事物，然后花大把的时间在忽悠人上。有意思么，没意思。有钱么，没钱。学到了什么东西么，没有学到。我不觉得手工耿做的东西没有，但硕士阶段所做的东西是真的没用。虽然现在AI绘画火，我抽了不少卡，还因为这事被网上一些初高中的妹妹冲了，我也依然觉得这玩意儿目前不能称作“程序与艺术的结合”，并没有觉得AI画得好所以我自己可以不用动笔了打点关键词就能表达我想表达的，不如做游戏开发的。真他妈烦怎么会有硕士培养这种东西，要科研的早该上路了，要工作的早该工作了，四不像的算什么。\n\n很烦一天三个视频电话一天两个小时。我只有闲到没有任何目标没有任何想做的事情才会想到要花时间在打电话上，只要有想学的，对于电话多余的时间增进感情这种事也会觉得是浪费时间，npy来了也一样。注孤生，但是挺快乐的，反倒是一般人打打游戏看看剧的生活，没事打个电话的感情联络会觉得让人无聊得慌。和基友也不会私聊，基本是在群里1v1……大部分基友都属于事业奋斗逼，传统型的已经出现意见不和了。就这个样子我还进国企？啊？我是有什么毛病啊……虽然我是冲着反正空闲时间多，只要一个人住我还是下班后想干啥干啥……只要上班不那么烦心就行。但也深刻意识到如果不能走专业，技能提升是真的慢。而且我个人技术栈很新，JAVA虽然不至于忘得差不多，但只是会个语法对于这门语言的底层机制、常用实践一窍不通……虽然表面的业务逻辑相通不是不能写，但更底层的改动是需要长期接触的。\n\n准备换个机子学下某最讨厌但避不开的某轮子。但是这之前还需要编完毕设。天杀的又回到了毕设，已经因为这玩意儿鸽了半年多的代码没写了。虽然仔细一看只有半年，但给我感觉是一年多。只能说写这种没用的东西时太过于思念原来在做的事情，导致时间的流逝仿佛被拉长了。写代码的时候时间是过得很快的。我又不是喜欢靠刷题来获得成就感的类型，自从20岁之后成就系统对我几乎无效了，变得越来越不去攀比和功利，只要不影响日常生活就行，要得到满足还得是创作与表达。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[13,3]},{"id":"2022-12-11","content":"\n人固有一阳，但为什么要阳在体检之前？\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[13,4]},{"id":"2022-12-03","content":"\n之前有妖气要关停，写脚本下了个漫画来看，当时就想着测试一下，其他漫画之后再下。结果后面给忙忘了，直到昨天微博有人戳我说前端页面里没东西了，才发现已经关停了，啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊！但 oss 其实还在的啊！但是服务端渲染已经爬虫不了了啊啊啊啊啊啊啊！\n\n上面有一些作者是从小关注到大的，还有一些冷门但好看非商业漫画的作者，作品就没发布过别的地方，之后也不会迁，永远都看不了。我之间下好的是一个话数很多，但不算很冷门、别的站也还能看的漫画。以后先下冷门的。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[13,5]},{"id":"2022-12-03 01:19:24","content":"\n通宵了两天了。 今天是第三天。\n\n对于写文章，要是我不了解，字数往往是不够的；要是我很了解，字数往往也是不够的，因为“连这种基础中的基础也要讲？”；只有当半了解半不了解的时候，字数才往往是会超过规定的。但一天也是写 600 字就差不多了，又不是文学或者纪实，600 字已经足够说明很多东西了，一页 ppt 的 80 个字很可能是我看了四五篇论文和无数网站才写出来的。\n\n室友在打地下骰子城，一个 rough-like 的棋牌游戏。类似的我之前打过月圆之夜，小时候还挺喜欢打算的，但目前来说对小游戏不太感兴趣了，还是喜欢 RPG，所谓的“大作”。明天应该便携基座能到，两个人的宿舍简直是游戏快乐屋。但是我也没见过比我还能宅和熬夜的（如果不是写文章我也熬不过她），而且微软现在是居家办公，她现在还没办入职约等于放假……\n\n明天……啊不今天是周六来着……最近两个周根本没休息过好吧，面如土色。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[13,6]},{"id":"2022-12-01 06:19:08","content":"\n写完了一版。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[13,7]},{"id":"2022-11-24","content":"\n真他妈烦，400 字不到就可以说清楚的架构，为什么要用 1400 字写？多出一堆废话有意思吗？难道答辩组老师会没学过 ML 基础吗？知道的人都知道是怎么回事，能简明的大白话说的非得说成任谁看了都得吓一跳的诘屈聱牙的文字，淦。\n\n一个小时过去了，用尽全力编了 400 个字。还剩 2500 字和 5 张图，ddl 还剩一天，时间效率为 50%。熬夜吧，熬夜也不一定有用，狗屎写不成金子。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[13,8]},{"id":"2022-10-27","content":"\n首页：樱井孝宏出轨十年。哦又是什么不认识的娱乐圈……啊谁？？ 555梅林你怎么这么惨，被削弱后还拿出来抽，现在声优也塌了😭\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[13,9]}]