[{"id":"2020-12-03 05:05:50","content":"\n又没睡着。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[13,0]},{"id":"2020-11-30 凌晨","content":"\n我开始讨厌夜晚了，夜晚才有机会痛苦，所以每个夜晚开始的时候都非常痛苦。\n\n我听着タコタ，想着在一个孤独的星球上，没有大气层，所以天是漆黑的。没有别人，有个看起来就很脆弱、竹竿一样的小男孩笑对我伸出手。而我是白色吊带裙的小女孩。\n\n没有开题的状态。明天就是截止日期了，我一个字没动。可当我打开word，就被没有夜间模式的面晃瞎了眼睛。\n\n从本科毕业开始，我就觉得毕设是我做过的大学期间最没有意义的事情。研究生入学考试放在毕业设计之前，目的就是为了让我这样不明所以的人去读研吧。如果放在毕业设计之后，不知道会少多少读研的人。\n\n无所谓了，明明很多时候没意义到想死来试试看，但总觉得还是有没有尝试的很好的事情，所以非常痛苦。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[13,1]},{"id":"2020-11-28 凌晨","content":"\n特别喜欢「蝶々結び」3:30那里一片寂静后突然从#f小三度转入C开始合唱的部分，感觉这样真的很好，瞬间从孤单的状态解脱出来了。\n\n名词什么的现在忘了，好像是同主音大小调转换？不重要了，感觉好就很好。\n\n想到很久之前我也是音乐理论的追求者，觉得好听是有规律的所以花了很久的时间看和声学，还有很长一段时间追求复杂的调式讨厌流行歌千篇一律的1645（小时候也中过1645的毒很久）。那时候Faded很火，有人让我听了之后，我不知道说什么好，心想这整个作曲编曲也太简单了，又非得夸点什么，只能说“啊，这个弯音好特别”（= =）如果换一般人大概该翻白眼了，幸好对方也很理科能从技术实现的角度接下去……\n\n对于音乐“感觉至上”似乎是一般人的常识。我不知道大家是怎么理解这一点的，但对我来说绝对不是如此简单就能说出这么一句话的。如果能去看一点点有关和声学的基础的话，会发现大部分流行歌“好听”真的是建立在非常简单的理论基础上，甚至会产生出“有了这点知识我就也能写出好听的音乐”的错觉，实际上仅仅是能听而已，自我沉醉于和声带来的基础感觉中什么都没有表达出来（我骂我自己）。是为了什么写歌的，是为了学习“好听理论”让不明白人觉得很自己很厉害吗？\n\n过了很久我才意识到，传统的和声、调式等等只是类似于地基一样的东西，还有很多东西能改变一首作品的感觉。即便是地基也不是必须的，也仅仅是前人对于感觉的总结，现在要创新的感觉都朝无调式的音乐方向走了……\n\n现在觉得理论不是没用，没有理论的只有感觉的时候仅仅是在靠着感觉的积累照搬，仅仅是“别人这么做很不错我觉得用在我这也不错所以我也这么用”，可能就是所谓的没有天赋吧，就算弹得再好又幸运到创个省记录也无法掩盖没有心的实事。但若是把理论的高度作为天花板就更加本末倒置了。\n\n啊，为什么又写了这么多，高考作文这么能扯就好了。\n\n------\n\n哭是一种很厉害的情绪表达。人悲伤的时候会哭，高兴的时候会哭，放不下的时候会哭，放下的时候也会哭，心痛的时候会哭，释然的时候会哭。\n\n继续看书，觉得连这样的人也能好好地活着，仿佛人生有了希望也会哭。\n\n我也算是不怎么看得下去书的人，总是思考得太多。比起语言本身的优美这些东西，更喜欢凝视其中的想法。\n\n> 语言永远都敌不过感情和思考，很迟钝，因此有时会远远超过于我。明明是我在写，却变成了对我诉说。发怒、说教、激励、嘲笑。我肯定会被语言一直注视着。有时手握着手，和睦相处，有时不管写什么都不对。今后也会一直像这样重复着，时而紧贴，时而远离吧。就像是超越恋爱与友情的独一无二的存在。\n\n------\n\n母亲打电话时在非常真心地和我交流，我就像是一个机器人一样嗯嗯啊啊，什么也说不出来。\n\n人在社会上究竟是什么呢，是商品吧，每个人都有标价。口头上说着“首要是谈得来”，又说着要把握机会，趁年轻抓住优秀的人，早早在喜欢别人之前就盘算好了想要对方什么条件。或者说，谈恋爱这个事情在他们看来就应该和恋爱分开来看，恋爱是“幸福”的事情。而结婚是寻找一个物质上能长期共处的“谈得来”对象，生子是寻找优秀的卵子与精子，以诞生更优秀的人类。如果你没有恋爱，也不要耽误你找好的结婚对象。如果你谈了恋爱，也要注意这是不是好的结婚对象。\n\n我还是不明白，这两者是这么无关的事吗，谈恋爱与对方一直以来所受的教育、思考无关吗？不会考虑以后的相处吗？难道有人对你很好就能喜欢上，就算“谈得来”？母亲说她年轻时甚至很难拒绝别人的介绍的人，当然以我的时代立场我没有资格批评这种做法，如果我在那个环境里可能也一样。我只是单纯觉得，如果跳过了自己的的感觉而去勉强接受对方，就不要把找对象的事情贯以“幸福”的名义，这不是什么值得庆贺的事情，也不想看到别人对我谎话连篇地祝福。\n\n喜欢什么人自己也得有去追的想法才是对的吧。\n\n在为数不多的欲望最强烈可以随心所欲的年纪，盘算的全是这些事情。\n\n不恰好に蝶にしないでよ。\n\n真抱歉，在这么真心交流给人生建议的场合，我想的竟然是这些。\n\n然后还说到了蚂蚁金服的事情，说到虚拟经济，又说出国家出面管控了。让我不禁想到ss作者说的那一段话。\n\n> 很多人要么一窝蜂的支持，要么一窝蜂的反对，还要把它给封禁掉，大概这种心理鲁迅先生也曾批判过。我还记得当年极路由在 V2EX 被冤枉的时候，也是一边倒的说极路由窃取隐私。如果你们真的那么讨厌商业，那你们应该首先把你们的苹果设备给摔了，因为它就是商业社会巅峰造极的产物。我反对不喜欢一个东西就要拿出简单粗暴的制裁手段，正是这种习性成就了 GFW。\n>\n> 维护这个项目到现在大概总共回复过几千个问题，开始慢慢想清楚了一件事，为什么会存在 GFW。从这些提问可以看出，大部分人的自理能力都很差，只是等着别人帮他。特别是那些从 App Store 下载了 App 用着公共服务器的人，经常发来一封只有四个字的邮件：“不能用了？” 我觉得这是一个社会常识，花一分钟写的问题，不能期待一个毫无交情的陌生人花一个小时耐心地问你版本和操作步骤，模拟出你的环境来帮你分析解决。Windows 版加上 GFWList 功能以来，我反复呼吁给 GFWList 提交规则，但是一个月过去了竟然一个提交都没有。如果没有人做一点什么，它自己是不会更新的啊，没有人会义务地帮你打理这些。最近 net-speeder 又开始流行，害人害己。我觉得，政府无限的权力，都是大部分人自己放弃的。假货坑爹，让政府审核。孩子管不好，让政府关网吧。有人在微博骂我，让政府去删。房价太高，让政府去限购。我们的文化实在太独特，创造出了家长式威权政府，GFW 正是在这种背景下产生的，一个社会矛盾的终极调和器，最终生活不能自理的你每天做的每一件事情都要给政府审查一遍，以免伤害到其他同样生活不能自理的人。这是一个零和游戏，越和这样的用户打交道，越对未来持悲观态度，觉得 GFW 可能永远也不会消失，而墙内的这个局域网看起来还似乎生机勃勃的自成一体，真是让人绝望。\n\n可能不只是国人吧，全人类都在以追逐利益的行动自相残杀。出了什么问题只好依靠国家管控，不要去祸害更多的人。人们无法做出不伤害别人的事情，这是人类有趣的地方，也是我讨厌人类的地方。但为何连一点点相互帮助也做不到？没有人做贡献，只会越来越糟。开源是程序界的共产主义，但没有那么多人是忠实的信徒，所以越来越有被拉垮的趋势。\n\n如果，现在的官僚体系的思想，能与纸上描述的一模一样，我觉得我会挺支持的，不管是GWF也好什么也好。但我完全无法确定，太多的现象让人觉得是在往纸的另一面走了。\n\n我也赞同发展实体经济，这也是说为什么要是我做完全艺术（探索自我）的工作会感觉毫无价值。哪怕能让别人感觉世界有那么一点不一样的色彩，我也是有价值的。我的他者贡献基础分值很低的喔。但就连这样我可能也做不到，也没有人在意这些事情，仅仅是不断接需求，实现别人的需求，循环、重复，维持着整个“人类社会”机器的运转。\n\n明明人类的产能翻了几番，还是有很多人在饿肚子，人们的休息时间反而更少了，和他人交流的时间也更少了。人类社会机器就是这样，大家在不断自我优化。就像股票一样，如果是运行平稳的公司大家都不想会买，大家都喜欢买不断上升的。什么时候是极限呢，什么时候会崩溃吧，拭目以待吧。\n\n以后要是我自己有固定房子，一定会买88键的便携电钢琴，还想弄个隔音好的小小的音乐的工作室，现在只有吉他一个乐器太难受了，人也很多，情感无处发泄。真的很期待在一个人那种创作情况下会变成什么样子，总是期待着可以完全释放自己的一天。\n\n画画其实自己也意识到不太搭，没天赋没训练是一回事，还是太具象了，尤其商业作画的精度，离随心所欲完完全全相反。其实真的随心所欲的摸鱼……也挺爽的吧。但我内在是个话唠，总想着，要以一种方式说出来。用音乐（即便是纯音乐）也比画画顺畅很多。\n\n也只是想想，可能是这辈子都无法实现的愿望。我会努力的。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[13,2]},{"id":"2020-11-29 晚上","content":"\n海鸥每年冬天飞几千公里，我却呆在一个舒适的地方不肯出去。我不如海鸥。\n\n明明只用一步，踏出去就好了，却连这点勇气也没有\n\n------\n\n中国油画院里走进去是有一栋几何上很简单的房子，简单到任何一个幼儿园的小朋友用7条直线就能惟妙惟肖地画出来。整个房体纯纯的肉色，与周围的建筑格格不入。门前有很长很长的台阶。因为独特而简单成为了网红圣地。\n\n说网红可能有一点过了，因为它位于五环以外，附近一片荒芜，连地铁站都要走很久。我去的那天是十一，有好几对新人在拍婚纱。看到的时候就有一种奇妙的感觉。长长的阶梯加上普普通通的屋子，在摄影师的镜头下拍出了迈入宫殿的气势。简单的屋子放在这里很容易就变成了大家所认为的艺术。从古典的油画到几何抽象派，“好看”的技法与理论随着变革创新了很多很多，有时候到了普通人难以欣赏的地步。人们所说的“艺术感”大多也是不同于常规的视觉效果，是难以诼磨的东西。生活去了哪里呢？似乎一定要做出夸张、不被理解、甚至出格的事才会被称为艺术家。有的人甚至觉得艺术家都有点精神病，造就这个概念的不正是你们吗。\n\n一些仅仅是反应生活的绘画语言，因为不够“美”而被人遗忘。若这样的人有幸被奉上艺术界的神坛，人们又开始用不同的目光欣赏它。虽然仍然无法欣赏，但，“艺术家就是不被人理解的”“看不懂很高级就对了”。嘛，也正好符合了这个概念。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[13,3]},{"id":"2020-11-27 凌晨","content":"\n为什么这么讨厌科研不讨厌写程序。\n\n我对于编程的认知可能不太一样。我觉得编程和做音乐、做手工、做动画没什么区别，就是用一个工具是实现一个想法。只不过这个工具是与或非的逻辑，和数理逻辑有相同的部分却是两码事，并且重点也不在有多么复杂多么先进的逻辑，而是用这个工具实现想法上，还有能不能让代码看起来美丽一些——代码是有风格的，任何编程语言都是。就像听歌的风格能反的内心世界一样。\n\n不得不承认“想法”其实就是需求。但不喜欢需求这个词。因为这提醒着我把它当作纯艺术看总有终结的那一天。我甚至觉得，如果整天只是纯粹在实现别人的需求，那我肯定会讨厌写代码的。\n\nINFP还是无法工作啊。\n\n大学里面没有程序设计这个专业，毕竟现在是全员机器学习的环境。程序设计本来就应该和科研是两码事，已经用上了Design而非Study就已经足以说明问题了。学校的体系却仍然只有Study，对于Design甚至有种嗤之以鼻的态度。其实自己也明白为什么，基础的东西是更应该被重视的。正如同明明视觉传达无处不在，对整个社会有着潜移默化但无法忽视的影响。但要说做设计——不就美工嘛。插画的话就更惨了——大街上100块一张素描的？音乐是最惨的。这些都漂浮在天上，最终和人的生死没有关系。\n\n要是真做了那么“艺术”的工作，我肯定又觉得自己的工作毫无价值。我没有对社会有任何的产出，我是靠着农民种的地、工人盖的房子活下来的。我甚至没有参与其中的任何一部分，只是在边缘不断空喊“加油加油”。如果这些加油的信号没有人接收到，那也一定是做不下去的吧。\n\n编程挺好，至少参与了社会生产的一部分。还能保留一点点对艺术的幻想。\n\n但如果为了这样，不得不从Design变成Study……果然我还是无法理解。和大佬聊过，逻辑上完全能够理解，但感情上无法产生一点点的共鸣。\n\n可能和经历有关。比起“科研是对人类的贡献”这样的认知，我更觉得科研像是炫耀的工具。小时候研究生都很稀缺，“他是研究生”就像个不得了的招牌，如果给每个人的脖子上挂一张价格牌，这个文凭就是张翻倍卡。然后呢，博士就说明这个人很厉害。然后就没有然后了，没有任何一个地方让我感受到“研究是对他人的贡献”，就像是名利场，人们都习惯于自我陶醉其中，显得自己真的做了点什么事的样子。\n\n想要毁掉一片最美好的地方，只需要往上面放金苹果就足够了。\n\n我也无法和将我最珍视的东西踩在脚下的人和平共处。\n\n只要条件允许，个人开服务器永远也不会有营利性质的东西或影响体验的广告。支撑我的东西很简单——他者贡献。和live上的他们一样。\n\n这和从前拼命“让别人满意”是完全不同的。\n\n------\n\n看到网上大家做食物的照片，有时候就觉得人类的对于“看起来好吃”标准真的很神奇。\n\n一堆被剁碎的生物混杂在一起被精心烹饪过，就变成了美食。而如果是大家吃剩的菜混放在一起，就变成了潲水，谁去桶里看一眼都嫌脏，最后给猪吃得津津有味……\n\n当然可以解释为潲水味道不好，但我认不仅如此。如果告诉你这是味道特别好的潲水你会吃吗？还是会看一眼都嫌脏吧，至少我是如此，我会觉得里面有大量不属于自己的细菌。这只是人们对仿佛属于“我的东西”的执念。\n\n尽管中国的美食喜欢使用各种方式消毒（尤其高温消毒），但有些文化中的美食就是没有消毒需要生吃的，人类去食用食物的过程就是不断的“玷污”着食物。或者说，整个生物链大家就是靠不断的“玷污”连接在一起并以此生存。\n\n但只有人类以如此奇怪的方式嫌弃着自己玷污过的东西。“不要扒垃圾桶啦，好寒碜啦”，整个世界的人都拼命在往上爬，想做人上人，这些事大概只有有心的街头的流浪汉才能完全明白吧。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[13,4]},{"id":"2020-11-26 晚上","content":"\n又开始吃一天唯一的一顿饭了。感觉再不吃就有点低血糖了。\n\n抱了一大堆垃圾食品，还送了一大杯的爆米花，想想这个场景大概是所有人小时候都羡慕的。但也仅仅是我的自我刻奇罢了，可能有人并不羡慕呢，比如小时候的我。\n\n进门的时候我想着，谁要是帮我扶一下门我就请他吃爆米花。但没有人扶门倒是有人关门，我抱着一大堆零食跑过去说等等，他才停下快关门的动作。好吧，其实这也是帮我扶门了，我没有请他吃爆米花是我食言了。但更重要的是大家都是行色匆匆的样子，被一个陌生人叫住“来吃爆米花吧”想想也觉得很奇怪。人们都喜欢往大城市挤，很多人住在很小的地方，很大的地方只有很少的人。然而人们住得越挤，对于左邻右舍反而越是冷漠。可能是对人司空见惯了吧，物以稀为贵，人在大城市是最不起眼的生物，这时候连一只猫都显得如此稀奇。如果在沙漠中遇到一个人那肯定可以聊上很久，还说不定可以遇到小王子。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[13,5]},{"id":"2020-11-25 下午","content":"\n去看了野田洋次郎的写的日记。\n\n可能吸引INFP的只有极端的INFP吧，认知总是有些与众不同。他在日记时描写状态，让我觉得也许我也是一个正常的人类。并且有了可能终生如此的准备。\n\n看起来像疯子一样的想法，是极端的自我消化，实际上却是一个“因为很多年轻人在这所以我不能讲自己曾经逃课的事情”的人，和人说“好好学习”。他说他以为的理所当然被人说成极端，其实也完全没有自己想得那样“理所当然”。上面这句话也是对我自己说的。\n\n很感谢这样的日记他愿意分享出来和发行出来，也没有被禁止。就如同五月の蝿的歌词一样，放到国内的话，一定是无法过审的吧。\n\n我已经4天每天只吃一顿饭了。当然我也知道有的地区认为一天只吃一顿饭才是正常的，虽然我不明白为什么会是这样的认知，从医学上讲从体感上讲都应该少食多餐，也许就是文化差异吧，也正因为有这样的文化差异，我也不太担心一天一顿饭带来的问题。换作别人肯定会说“天啦，怎么一天才吃一顿”。有人这样问，是因为他会这么吃会饿；但有人这样问只是因为“大家都这么做就你不这么做”，或者是“这是生存的基本”，我实在无法理解是后者。就像说“谢谢”已经被训练成了“这是人情世故的基本”。难道不应该真的心怀感激才说“谢谢”，哪怕是一点点感激也好。许多本身源自于内心情感的事，为了表现出所谓的“道德”与“家教”，被组织成了教科书一般的语言，和正常的感激混杂在一起，我已经分辨不出我的哪一句话是真的了。\n\n也许就是我不太对，很多该感谢别人的地方我感受不到。不管是被强塞的糖，还是被强迫的“提升自我”的事。尽管全都是大好事，可完完全全违背了自己的意愿，厌恶感远远大于需要感谢的部分。\n\n很早之前就有被人说有生人勿近的高冷感，实际关系好的觉得我很好笑。但现在从内到外都是生人勿近。也可能是现阶段我没有关系好的现实生活中的朋友了。\n\n记忆力不好对我而言是好事。我之前上学时很苦恼为什么自己记忆力差。不记得很多东西就会忘掉很多烦恼，也不会没事去思索“当初为什么是这样现在怎么就变成了这样”而陷入无端的思考漩涡。但以上也仅限于Se的记忆，Ni和Ne的记忆超强，就像音乐，这东西与其说是用记的不如说是直觉，如同肌肉记忆那样的东西。还常常因为缺乏Se不知道到底为什么有这样的感受。\n\n------\n\n小D在和我出主意，说“不管怎样摊开说然后说我尽量写完开题报告”。其实和家里是一样的，只不过没有长幼有序的关系，听起来顺耳了很多。\n\n而我说就算我这么说了我也没法写开题报告。我讨厌画饼和不切实际的承诺，我变得无法对自己撒谎了，不再無理にして。这是好事吧，这应该是好事吧。\n\n但我不明白为什么会想哭。为什么哭呢，是因为我为了自己的生活能有点意义，要让别人感觉没意义了吗。明知自己的生命在万年生灵前，在别人的生命中也只是渣都不剩的蝼蚁，却还是不停想满足别人的期待。这是为什么呢。\n\n即便，好吧，即便那个人是たいせつな人，对于双方都是，无法满足对方的愿望，是这么值得哭泣的事吗，亦或只是想避免惩罚，忘掉那些Si满满的话。毕竟我对直觉的记忆和对Se的残缺到了一无法再严重的程度，自己都不明白感受如何而来。\n\n既然生命不过是世界中再平常不过的东西，为什么看到拉姆的事情又会流眼泪呢，为何唯独对生命的美好那么看重。巴黎圣母院也是美好的东西，被烧时也没有特别大的感触，艺术其传承不在于恢弘的美丽的宫殿里的遥不可及的挂画，宫殿里有很多代表作，但烧毁了宫殿艺术不会消失或是断层，艺术就是生活本身。即便四大古文明唯一没有历史断层的只有中国，可其他文明会因为断层影响到什么吗？当时的事只有当事人可知，生活还在继续，延续了一代又一代，不也是携带着断层的meme吗？而生命没有了，生活也就没有了。果然人类还是最看重的生命，即便知道比起世界上的所有生物来说算不上什么。自私是丑陋、邪恶的想法吗？自私只是自私，再普通不过了。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[13,6]},{"id":"2019-07-16","content":"\n不写程序了，也不会做科研。到此为止吧。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[13,7]},{"id":"1980-01-01 00:48:28","content":"\n这一条是 #博客 相关的memo 测试。\n\nmemo 目前还处于初期阶段，支持标签搜索最近50条。需要做到的是：\n\n- [ ] 搜索范围自定义\n- [ ] memo相册展示\n\nParsing 测试：\n\n正常文 **Bold** *Italic* ~~No~~ `inline` 正常文 [Link](./)\n\n- 正常文 **Bold** *Italic* ~~No~~ `inline` 正常文 [Link](./)\n\n```\n代码\n```\n","tags":["博客"],"imgsmd":[],"sourceFile":"000.md","csrIndex":[13,8]}]