[{"id":"2023-11-05 21:04:56","content":"\n以一个极其复杂的方式解决了 #mdx 渲染后的标签点击事件绑定问题。因为这不是 html 原生标签的替换，就有一点点麻烦。最后是从自定义 remark 的 AST 入手，直接解析后转换标签为对应的 estree 节点，再加上三次传 clickhandler，闭包持有 clickhandler，进行元素替换，终于绑上了……不愿再来一次，有这种需求应该直接写一个替换的框架。\n\n所以我终于可以进行下一步了吗，写 img 相关的组件。但是其实 memo 后端 parse 还有bug，突然到某一条就停了。重构了之后 bug 真的多……search组件还没统一拆出来呢，可以说是因为不会……但主要还是设计问题，没有想好移动端和桌面端怎么做才能统一，不要渲染两遍……还有目录，目录又应该放哪。目录和导航，选一个没吧……\n\n","tags":["mdx"],"imgsmd":[],"sourceFile":"002.md","csrIndex":[14,0]},{"id":"2023-11-05 02:51:44","content":"\nscroll bar 好烦！！！还没有一个好的思路来处理 scroll bar 时隐时现导致样式shift的问题。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[14,1]},{"id":"2023-11-04 21:43:14","content":"\n看了一下 nextra 的解决方案…………额额额，他们重写了compiler，并没有用 mdx.js 原生的方法去 compile 成不可序列化的函数。他们的结果是可序列化的……不想重复造轮子。\n\n然后我又去搜了下 [discussion](https://github.com/orgs/mdx-js/discussions/1980) ，又看了看 mdx.js 的 doc。才发现人家其实有函数的序列化和反序列化啊！但是不要看 Guide 里面说什么 Next 有自己的 mdx 方法，那个真的很鸡肋，非常鸡肋！最后搞定了，把巨大的 [next-mdx-remote](https://github1s.com/hashicorp/next-mdx-remote/blob/HEAD/src/rsc.tsx) 移除了。这个库倒不是思路有问题，而是很久没有维护了导致不兼容新的插件。可能是 mdx.js 支持了所以停更了吧，没有考证，而且其实它做的事也不是很复杂，但引入的包是真的多，明明有 MDXProvider 但没有导出，又要多引入二十几个包……\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[14,2]},{"id":"2023-11-03 22:50:03","content":"\n今天是 Clash 全系删库的一天。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[14,3]},{"id":"2023-11-02 22:20:54","content":"\n#工具 IPA签名工具：[轻松签](https://esign.yyyue.xyz/)。\n\n今日重要新闻：Clash for windows 删库。原因不知道。有说是晒车牌的，有说是推发了太多个人信息的，有说是内置机场被抓的。\n\n对不起我写着写着代码又开始画画了……这次是一个能画完的独立故事！不是片段了！加油！不加戏的话，九图可以画完！但我是真的会一边画一边加戏……\n\n啊好肝，肝起来根本没有时间写论文。\n\n\n","tags":["工具"],"imgsmd":[],"sourceFile":"002.md","csrIndex":[14,4]},{"id":"2023-11-02 03:39:17","content":"\n说来面包推荐了一下 [nextra](https://github.com/shuding/nextra)，我哭了，这不就是，我要的 60% 的功能都有，在这重复造啥轮子呢……\n\n然后想看看他们 rehype 这一圈的文件是怎么组织的，学一学，要被这生态圈里类型不一致问题和版本兼容性问题搞疯了（真的先学后端语言的人会有强类型强迫症）。\n\n然后我就看到了：`// @ts-nocheck` \n\n（手动拜拜微笑脸）\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[14,5]},{"id":"2023-11-01 03:33:06","content":"\n看了一下 [next-mdx-remote](https://github1s.com/hashicorp/next-mdx-remote/blob/HEAD/src/rsc.tsx) 的 SSG 实现，汗，原来 getStaticProps 直接传的函数字符串。然后用渲染时还原函数。相当于函数的序列化与反序列化吧……\n\n```ts\nconst fullScope = Object.assign(\n    {\n      opts: jsxRuntime,\n    },\n    { frontmatter },\n    scope,\n)\n```\n\n其中的 jsxRuntime 是通过 process.env 动态获取的，也就是可以区分是生产还是在是 Dev。\n\n总结一下就是，核心功能包括 SSR 依赖的是 mdx.js，只要能传函数 render 为一个 RSC (React Server Components) 就可以了嗯……这个库只是包装了一下下静态渲染的功能，核心渲染还是 mdx.js 做的。mdx.js 的解析核心又是unist……但比起解析我更想看 rsc 的底层是什么……我又不行了……\n\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[14,6]},{"id":"2023-10-31 14:22:26","content":"\n抠完样式和搜索了，现在要抠交互，交互写起来有时候很有成就感，有时候又没有，但大部分情况下是没有。\n\n架构的部分写起来很痛苦，但是后续开始复用时，就觉得我草我真牛逼。\n\n后端除了架构外大部分是在 debug，成就感取决于日志的输出情况。\n\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[14,7]},{"id":"2023-10-29 01:13:43","content":"\n对于 #博客 我也有另外的打算。\n\nmemos 页我要考虑重新布局，做成动态页当主页，还是多一些社交元素进来，确实我现在用比较多。\n\n- 有可能做成无限滚动的吧，留言板放侧栏，手机上的话，嗯，确实算是个有点麻烦的问题呢…………我是比较讨厌手机常驻浮动图标的……\n\n- 把 date 的统计数据加上，再做一个流行的小日历。\n- 支持带九宫格图，主要影响渲染，解析又得重写。之前为了省事直接用的现成的mdx的渲染，现在就是一把心酸泪，要重写的东西还挺多的……而且，emmm，图文分离真的是好事吗？其实对于图像博主来说确实是好事。但对长文就不是了。但长文我又有 Posts 页面。\n- 另外还有图床的问题，由于我白嫖的 github 倒是从不考虑图像大小问题，上传图片前我也有压缩强迫症。但万一以后我想换到别的图床……算了，到时候再改吧，短期内没这个打算就是了。\n- 支持标签的解析，memos 支持标签过滤，但这又是个对于静态博客来说非常麻烦的搜索问题，需要提前生成索引文件，索引文件的维护也是个大问题，每个分析都得带有原文件位置和CSR文件位置防止失联。有时候真的想上sqlite3来存这些乱七八糟的东西。真想问问有没有一个库叫逆ORM，就是把一个 的 object list  当关系型数据库使，来构建一个新的Object……结构转换太常见，我觉得得有这种库，只是我不知道。\n- 另外要分析的东西比较多的话，memos的底层设计就得重新考虑了，必要时直接读进内存吧，不然又是在不停对磁盘io……特别是当要分析的东西比较多的时候。\n\n然后还有i18n，我突然又怀念起了中文UI，觉得中文UI很好，直接放字在那里也很精简。之前设计博客的时候，我就只想装，几何感强的英文是就特别好的选择。但现在的瓦塔西非常实用主义……\n\n另外，随着页面增多，构建速度越来越慢了。\n\n对于memos和索引，我可以构建索引改变build时的状态。但是pages这个我是真的没法控制会不会被重复build，除非我去改变Next.js框架的build行为。但这样的话，额，我又是为什么要用这个框架啊（扶额）\n\n如果谁还说 Next.js 适合个人静态博客，我就先给他个大逼兜。要么老实用 Hugo 和 Hexo，至少人家有针对博文的 build 优化。要么做成动态的，上 CMS 。千万不要用 Next.js，会变得不幸，嗯。\n\n不说了，一把心塞泪，原来静态博客的尽头是动态。\n\n\n\n","tags":["博客"],"imgsmd":[],"sourceFile":"002.md","csrIndex":[14,8]},{"id":"2023-10-24","content":"\n最近把作息调过来了！撒花ヾ(≧▽≦*)o～\n\n嗯……不过调整的过程不具备任何参考价值。我已经纯白天睡觉超过3个月了。中途试过调整几次都失败了，还会半边脸长满痘。同时做什么事情都感受不到时间的流逝，很容易两三个小时刷地就过去了。\n\n下面内容的省流版：因为用爱发电而恢复了执行力。\n\n这次调整开始于国庆时，也就是10月1日的那一天，我特别想画同人（因为原作者停更了，但我想看日常……），然后就开始写小剧本。用2天配好环境，顺便发了个视频，摸索了下流程，画了3天，50多格，最终画了5条。这时候我都是全程晚上画的，虽然我很想白天画，但白天撑不住。\n\n然后开始画花絮，有4条。我的计划是2天画完一条半（不过分吧真的不过分吧）但是我发现，我每画一条就没力气了。创作有一种类似能量条的东西，MP耗尽了需要缓缓。\n\n之后的第三篇。这次只有约20格的小短篇，只有一条半长。但我竟然画了4天。下午起来处理一下生活上的事，上上网，晚上画4个小时后，吃饭，又不想画了，在阳台上看天明，一坐一个多小时，过一会儿就到了白天，感觉很困。\n\n熬夜会使精力变差，几乎除了凌晨，我无时无刻都很困，没有精力进行任何主动的脑力活动，但也睡不着觉。\n\n画完第三篇后，花了整整两天想第四篇的脚本。第四篇画下来可能有80格吧，还有一天画了废稿，边画边改剧情，很慢很痛苦。由于需要精力，困了就睡，这时候睡觉是两头倒，早上睡4小时晚上睡4小时，醒来就开始强迫自己想剧本或者吃饭。我当时觉得要画7天，没想到7天过去，我只画了两条。\n\n这时候我自己先受不了了，太低产了，这么久就画这点东西。我一没创作MP了就会开始看 Lofter 数据，到后面可能十分钟一刷。这不行，于是告诉自己，如果连续三次看 Lofter，那我立刻滚去干其他事情。\n\n事实上非常奏效。虽然我每天能画的时间还是只有三个小时左右，然后依然是陷入创作MP耗尽的状态。但我干的事情变多了，也没有再无尽地刷视频。\n\n两天后，我在淘宝下单了缺了好几个月的生活用品，并且隔天就去拿了，没有拖延。换到从前我可能会拖三四天才去。\n\n期间我的本科室友来出差，吃了个饭，很庆幸，她来的时候我是两头作息而不是白天睡觉，白天一整天都可以约。她说她心态变了很多，不是很能理解我了，也不能理解过去的她自己。不过我不介意。\n\n再往后，我试图把两头睡的时间慢慢合并。\n\n三天前，我是9点睡的，2点醒了一次，很清醒。又睡，早上5点醒了。\n\n两天前，我是10点睡的，5点醒了一次，又睡，早上7点醒了。\n\n昨天，我是11点睡的，5点醒了一次，又睡，早上8点醒了。\n\n今天和昨天一样。\n\n中途醒的原因主要是饿的。看过一个说法是，睡得太少因为什么激素的关系，会觉得饿，即便你其实不饿。确实如此。\n\n在开始画同人那几天，我12点刚吃过饭，画了两个小时，2点就饿得不行，感觉饿得胃痛。但是我躺下去5分钟什么都不想，立刻不痛了。\n\n为了让自己不感到饿，我几乎每4个小时就得开始吃一顿主食。5点正是我一般吃主食后的时间。\n\n还有一天白天睡觉时，我都是刚吃过就去睡。但还没睡着就肠腹空鸣。醒来胃痛，整整两天怀疑自己是不是有胃穿孔。\n\n现在每到凌晨5点左右，我是会被饿醒，但强迫自己睡着，至少到7点。\n\n希望可以坚持下去，至少为了我想看的 cp 有后续。\n\n我也很开心有人看我的作品是和我是一样的想法——原作代餐。同人圈有很多人是为了展示的画技、提高知名度去画插图类的。插画画得好可以让人一眼入坑。\n\n漫画是费力不讨好的事情，一页插画的时间画一页漫画画面质量至少降低50%，只有在坑底的人才会去看，画了又不能找工作（国内漫画躺平好多年了）。不过还有更惨的，就是同人文作者……如果原作本身就是图片类的，写文基本没人看……\n\n幸好我的 cp 原作是火柴人漫画，谢谢作者为了画得快用了火柴人。不过很多人是动画入坑，看插画的人远远多于漫画。但漫画本身的铁杆粉也是不少了。加上最近第二季也在动画化，虽然制作很拉，但有在播就有热度。\n\n实际上这个坑也不算真的冷坑。在今年6月份，原作的剧情创作类停更一年半后，我也心血来潮画了一张插图发在微博，那张有700多赞，对于一个粉丝不到30、流量全靠扶持的人而言，在同期超话的产出来说也算多的。后面我上号看的时候也吓了一跳，以为最多一两百吧，因为那个超话里做饭日常有50赞都算好的了。\n\n说着说着又开始分析数据了……我想说的其实是，如果所有的坑都能有办法延续就好了。我也想过，会不会有一种写故事模式，类似开源软件，由 maintainer 去 pull request 支线故事。但这个点子刚冒头，我就掐了。\n\n“您是否在找：SCP基金会？”\n\n软件没有那么多因果论，可以这么做模块化。但故事不行，大家需要的只是一个完整的、前后通顺的、精彩的故事，碎片化的、很多的支线绝大多数情况都不是什么好事。你以为你是东方？是FGO？\n\n打字打了快一个小时，去吃饭了，再见。\n\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[14,9]}]