[{"id":"2023-02-17","content":"\n才知道 Bob 的谷歌翻译不用申请 API，有[插件](https://github.com/roojay520/bobplugin-google-translate)调取 web 免费版的服务。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[18,0]},{"id":"2023-02-15","content":"\n被踢了，那安心写论文吧！本来也是因为不想写论文所以想找别的东西写写，但是又因为必须写论文很多事情只能列计划和看看。我 Debug 时说了两次源代码没有 Debug log 合作不方便，有人觉得打断点就挺好是我管太多，于是我被踢了= =我：？？至于吗，多大点事？可能互联网只能用同事的语气说话比较能正确表达情感程度。行，咱不 Debug了，该干啥干啥吧。之前还想测测 API 看更具体怎么传参会出岔子， postman 先设定一堆情况放着，现在觉得自己修修能用就 OK 了。真对不起主播，用你的项目也没法再给你及时反馈和 debug 了，除了 star 也没别的了。可能有空会在 issue 提，但其实平时没有那么频繁地关注项目，不写代码的时候极少开 github。我还是先写论文吧。\n\n原理性的吵架一般是我会气别人走，别人如果是管理那就是踢我走了。因为理论上我觉得没什么好辩的，上万行的大项目不日志定位，纯从开头靠断点单步调试一个试试？但别人个人项目做不做其实都无所谓，我又不想在网上当爹。我的很多记录习惯都源于我记性差，为防止几个月后对着自己代码一脸懵逼不记得思路，会写一遍开发日志/日记一类的，过几个月就又是另一个人的记忆了。rust 的 webserver 也写过但现在让我看 rust 我真的会懵圈，感叹我当时怎么弄清楚这些乱七八糟的。不过不想造轮子了，除非轮子实现得太大了而我只用很小一部分。\n\n说来我上一次差点被踢，是我在画接龙的时候，用 AI 绘图 img2img 看了一下……然后哇，我发誓那次我真的是什么都没说，仅仅是因为有人问起了 AI，我就顺便说了下用 AI 跑的结果，结果群里有初中生反感 AI，碰巧也是个管理员……突然又被骂。不过那个群比较公开的，没有说意气踢人，后面我道歉说我不该用 AI 跑这个就完事了。面子说不要可以不要的，留着脸皮能吃饭吗？不破原则就行。\n\n说来好像这两次在被踢的边缘上摩擦，都是群主觉得其实没啥，管理踢的，嗯？确实 INTP 的时候没 Fi 和 Fe 什么事。这种意义上我这个 INFP 也够人格分裂的。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[18,1]},{"id":"2023-02-14","content":"\n配置了 neovim，十几天下来感觉算是没太大问题了，只是split的终端没有 filetype 还是有点瑕疵，导致 Lualine 不能忽略终端窗口。float term 不太喜欢用。不过 lsp-formatter也还有点 Bug，有的语言就是不 format 也不知道什么情况，主要是还不知道怎么看 Log。大杀器是异步，还有 LSP 和 Mason 做 LSP 的包管理。果然是能颠覆 vim 的存在。不过没有一个中心化的 GUI Package MarketPlace 还是挺烦的， 幸好网上有整合包这种东西，可以一键开箱用了。\n\n之后就是 Debug，我还没试过 Debug 怎么样，我觉得这点是很难做到 vscode 那样的集成度。 但前端的 Debug 基本上是在浏览器里进行了，后端的话就测测 python 和 go。Java 还是不推荐用这类，直接 IDEA 吧。\n\nvim 主要是编辑方式占优，但要是作为 IDE 全键盘流的上手难度实在是太高了，还是需要优化鼠标操作，否则光是切窗口就可以切到头疼。我也不觉得操作熟了之后定位的效率能超过鼠标， vim定位的方式太多了，而鼠标只有一种还很快。好的是删大段的 Text Obejct 和改 pairs。\n\n------\n\n（吐槽）最近加了一本书到书单是从 0 制作 CPU，不知道能不能看完。因为我还要写我 6w 字的水文。我已经对此麻木了，目前是只对这一件事有严重的注意力缺陷。但接下来 24 小时我都不能写，我得收东西。已经很多天没有在 4 点之前睡过觉，早睡睡不着。连续被拉出去吃局后前天早上终于崩溃了，那之后难受了一整天。而四年前的情况是，崩溃了，我还知道我要继续重复这种崩溃至少 3 个月，后来靠画画救了我。这是最初抑郁情绪的来源。就崩溃到那种只能躺着的程度都没法诊断出抑郁症，我是不知道抑郁症到底得疯到什么情况。我觉得远离强控制欲的家庭能治好 80%的抑郁，导师只能占 20%。了解我的人没有一个觉得我会找体制内的工作，好像所有人都觉得我应该是那种奋斗逼。但我还是没去私企，我没法对抗我长久以来接受的家庭教育，就算我知道有很多缺陷，就算我知道是束缚，我还是没法对抗，只能等待到下一次崩溃的边缘。我连转行都打听好了要怎么做，但是发现实在太他妈难了，除非我一天的时候足够干两人份的活，行内的人也建议我家庭这么反对还是算了。我姐昨天来试试平板画画，突然又说，不说画画了，免得你妈又说你不干正事。隔壁那个体制内画画的是天天画画，通宵画画。我没法通宵，不是不想而是受不住，有次只睡了 4 小时，早上 7 点起来拍照，整个人都困得随时倒下去，到中午开始浑身发冷胃痛，然后睡一觉就好了。就是这种一定要睡觉的体质= =\n\n我喜欢我的姐姐（非直系），因为她是真的会对我说的新东西感兴趣的，觉得很多也还不错……难道长得像的人性格也像？没有没有，至少她不喜欢五金工具，而我每次搬家都会说带上我最爱的五金工具……\n\n我还是希望我能在白天有点效率吧，但我不知道怎么做。我只会对想做/计划怎么做的事情有效率。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[18,2]},{"id":"2023-02-11","content":"\n年轻真好，年轻人做项目都更得劲。老年人就得考虑现在能不能做这个，做了会不会影响正事，会不会失业。\n\n自从新冠以来咳嗽好像一直没好全，稍微有点空气不好就开始咳，应该去检查一下了。而且标准睡眠时间从 8 小时变成了 10 小时。真的羡慕睡 4-6 小时的人。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[18,3]},{"id":"2023-02-10","content":"\n谁 Github 把 SVG 当 GIF 用啊！！电脑卡死了！现在办公完全不够用，至少 4 个 word 2 个 PDF 一个 Logseq 和几个 Chrome Tab，有时候还要开个 社交软件，再来个把 SVG 当 GIF 用的，真的是卡，太卡了。很多时候都觉得比较追求“新”的开发者是不太能考虑到大众的设备需求的，因为我就是这样。前端框架出来后有一堆减轻渲染负担的东西，但真的要减轻渲染负担的话，其实还是不要用这么新的东西，不要这么多嵌套，不要 JS 搞这么多动态渲染的操作。交互是要差一点，但少点动画和嵌套也不会差到哪里去，网好响应快才是真正的交互好。不过开发体验可能会变差哈哈。由于这个原因，我想把博客首屏的动画给取消了，或者是换一个更简单一点的。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[18,4]},{"id":"2023-02-09","content":"\n又是什么都没干的一天，拖延晚期。更新了 About 页的头图，很久没画插画了我看不得这些，看了之后现在非常想去画插画。太多对于自己不重要但又重要的事了。已经四年了，看到微博上有人说：“得过的人会知道，即便是事后恢复了，也不可能回到原来状态了”。非常真实，某种程度上这是永久性的，拖延症也是之前没有的，DDL 完全不管用了。虽然已经恢复了笑的能力，但很明显没法保持住开心了，需要刻意想很多能让自己开心一点的事情。理解痛苦的能力直接从 0 变成了 Level Max。 之前听鹿乃的 hello how are you（是日文名，念出来就是英文），第一次听我直接落泪好吗。虽然这首歌表面上很萌很开心，但我感觉其实唱的并不高兴。后面翻出来一看歌词，是真的不开心。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[18,5]},{"id":"2023-02-07","content":"\n- 最好用的 Chrome 网页翻译插件推荐：[Immersive Translate](https://chrome.google.com/webstore/detail/immersive-translate/bpoadfkcbjbfhfodiogcnhhhpibjhbnh)\n\n之前也提过 Chrome 浏览器自带翻译失效但不想开全局代理的问题，没有提插件级的网页翻译，主要是没遇到好用的。今天这个就非常好用，逐段中英对照，可配置多家翻译的 API。\n\n- 廉价储存服务：[B2 Cloud Storage](https://www.backblaze.com/b2/cloud-storage.html) 有 10GB 的免费额度，白嫖的选项又增加了。\n- 老文章但写得非常棒 ：[前后端分离模式下，前端与后端人员如何合作？](https://github.com/Liaoct/blog/blob/master/前后端分离模式下，前端与后端人员如何合作？.md)\n\n现在已经 API 设计的工具已经很成熟了。不过有点感触是，前后端分离在简化小型应用的开发流程上其实是负效果，增加人员成本与沟通成本，好处需要到大型单体项目开发才会体现出来。但是，这么大的单体项目有多少呢？外包还是 PHP 的天下。\n\n我从一开始就分离是属于个人强迫症，感觉各模块干各的，符合流水线工作，干净，PHP 写过，表示不能忍，为什么要在 HTML 里夹业务代码？ 不过这好像点和 JSX 也差不多的哈……而且真的比 JSX 简单。\n\n其它好处还是有的：\n\n1. 出现许多小型的单独前后端的项目，可灵活组合使用，适用更多业务场景。在此之前靠插件，现在靠 restful。\n2. 人员技术栈缩窄，便于在各自的领域做出更高的质量。如果仍然是前后端一体的开发，很给想象做到今天这种程度的复杂交互，即使是有设计师，因为总是后端比较重要。当然技术栈缩窄不代表学习的新东西变少，前端完全没有要停的趋势，因为很多问题依然没有得到解决，离生态稳定还有很长的路要走\n\n------\n\n最近想把 Memos 重构成有后端的，短文还是应该能在线发布，而且想重新设计一下不要把量感做这么大（但架不住我写得长啊……）。另一方面，依然想使用静态博客的部署，可安全性上，认证什么的又必需要用到后端，可我又不想维护一套博客的后端（~~部署时想白嫖很困难~~），就算开源有现成的解决方案，还是要自己部署和运维（到底是有多懒）。现在考虑的是 Netfify CMS 这类不用自己部署、有现成 Auth、存储可以继续静态页面白嫖 Github （不好意思）的无头 CMS 解决方案。不过能这样做也是因为我的东西不多，数据也不复杂。 mdx 本身也可以内嵌很多东西，调用外部的资源渲染也没什么问题。CMS 层也只是让我可以不开电脑写字，二进制数据还是会放在其他地方的。\n\n还有想把 Memos 做成可配置的插件什么的，以后再做别的插件。说真的，Next.js 的渲染方式反而不太好做插件系统了，启动一时爽，还是得要自己写路由。目前没考虑太多 ，完全没想要插件API要开放哪些，要定制哪些，以怎样的形式存在。 个人用是完全不需要的，只是为了方便别人用的时候把不用的功能好开关一下。 i18n也没有想好用不用，想做只是纯粹得想看看全中文 UI 是什么想的……我也不可能真的发布多语言版本文章是吧，机翻又不如不翻。\n\n为什么优先考虑无服务器，主要是降低运维成本（真的不是因为能白嫖）。稳定好用的服务器不仅不便宜，还容易一被打就嗝了。能在云平台托管的项目稳定太多，能用的 CDN 起飞。但问题是会造成项目过于分散，前端后端存储都是分开托管的，一个 Waline 就布署得够烦人了。但是！！像是，有 Github 这种平台，托管文件做 web 服务的同时可以解决认证和存储的问题，只是需要一个第三方做这个随时能操作 Github 仓库的中介，毕竟还是要个后端与 github 通信做认证，浏览器 API 还没有到如此神通广大的地步。\n\n------\n\n再说点题外话，今天看了一个视频，叫“那些只有长相普通的女生，才会知道的人生真相”。是有点好奇才点进去的。说真的，我从小到大的女性朋友， 80%都长得好看，而且有一半是长得非常好看，没有 gakki 和 kanna 那一卦的，但秒杀那啥 48 的绝对不止一两个。高中室友清晰记得一个长了我觉得世界上最好看的丹凤眼，一个长得很桂纶镁但比桂纶镁更好看。我的近亲姐姐都算好看，到我宿舍之后被我室友夸好看的那种，然后我妈还会被同学妈妈夸好看……总之就是不太会接触到“普通长相”，顶多是普通好看。我对普通好看的标准大概是关晓彤/杨紫这样的。但我看男生除了发小和几个哥哥，感觉大部分都很普通……发小是真的帅，我的几个哥哥还挺好看的。我面基的网友也超级好看，可以演电影的那种好看……然后这些人里要化妆的要双眼皮的通常不是因为觉得自己不好看，而是喜欢化妆或者走风格拍抖音啥的，只有一个由于肤色不均但只要肤色白了就非常好看的妹子算是美化性质的化妆。前些天还有个妹妹，有点刘亦菲，但比刘亦菲好看（毕竟刘亦菲全家最丑），吃了三次饭我都不敢提出和她合影，因为她实在过于好看了，好看到我觉得这不是普通人能去随意合影的长相，她大概都要被合影烦了吧。\n\n好了，我说完好看了。看到里面“普通长相”有一点是，不会因为自己的长相而心情变好，有好看的朋友因为长得好看，哭了之后在镜子面前补装，补着补着心情就好了，因为发现自己实在太好看了！我：擦，原来这不是所有人都会有的感受啊。我记得以前一个长得不太好看但人非常好的同学，觉得自己长的也还是可以的，以至于我一直觉得每个人应该都能看到自己好看的地方。反正我每次看照片，觉得自己哪里长得不太好看都要被室友骂，“你还嫌不够好看”？但是说穿得不太好看，就没有人有意见，因为我觉得，长得好看和穿得好看，有一个就行了（狗头）\n\n但是除了长相，还有一个问题，就算我没有表情，或者我维持着一个没有情绪但明显面部肌肉有在发力的表情，就能根据情况被自动解读出“诧异”“开心”“不解”“不满”等多种情绪，实乃餐桌万金油。但有时候也很苦恼， 因为我刚才什么都没想，我可能都没听他们在说什么，完全不知道他们怎么理解出这些的。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[18,6]},{"id":"2023-02-02","content":"\n居然就 2 月2 了。吃局的时间总是过得很快。\n\n然后饭局上有阿姨说到谁谁谁也在成都，让去吃饭介绍对象什么的，听得我想当场打电话告诉 HR 我毁约。上次是被迫，这次就是主动。感觉真的是没有办法，日复一日日复一日，这个世界对习惯孤独的人太不友好了。可以天天对着代码，对着画布，对着琴，对着书，都可以，但不是要，对着人。就一个想法，只会影响我学习，一群人聚在一起只想着为了他妈的繁衍后代。绝了。\n\n虽然我说得不好听，但并没有想骂他们的意思，因为没有人有恶意，我也没有机会表达自己的意愿。当然我也不愿意表达了，只会发生冲突，他们只会想“纠正”。人就不能别想着硬改变别人的想法吗？\n\n小时候我讨厌做每天一页还要写作文的假期作业，我妈说“你现在讨厌，你以后就得感谢了”，还有“你现在不觉得你妈是对的，等你长大了你就理解了”。到现在就是：“现在的年轻人说不想生二胎，到后来没几个不生的”，“当年不结婚的人，老了全后悔了”。尼玛，后面的我不知道，但前面的都是瞎扯，我觉得从小到大发生的根本性转变的只有一点：人不该用自己的视角去要求别人，多点换位思考。其他的，该喜欢的依然喜欢，该讨厌的依然讨厌。\n\n当然我现在都觉得每天一页的假期作业根本没必要，就是个做题修罗场，我到现在也不喜欢纯做题。就做数学题动脑筋还好，主要还得每天写作文……有什么好记的呢！我后来写手账尝试入坑三次都失败了，亏我排得那么好看，只有少部分人才能每天写日记。有写日记这时间不如投入到别的学习当中。写作一直以来对我都是修罗场，实在是不懂为了什么而写作。有表达欲有目的的话不用人催都能写很长。看我写 memo 的频率和长度都知道了。原本这个模块是想做碎片化的日记一类的，没有想到我这个人天生不适合碎片化的发言。而且用静态博客生成做短发言实在不方便，每次写都要打开电脑，还是得用上数据库。易用性和易开发维护性总是要做一些折中。用数据库有什么不好的？不好白嫖（对不起献丑了）还有我讨厌数据库的安装包带 GUI 的……老命令行工具人了\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[18,7]},{"id":"2023-01-30","content":"\n今天是长篇的闲吹。\n\n自从谷歌翻译退出中国，Chrome 自带的翻译不开全局代理就没法用了。一直没有管，因为要翻译的场景比较少，遇到真的需要翻译/懒得看长文的时候就用 Bob 划词翻译了。今天有需要又看了下，发现还挺怪的。只要开一次全局代理，后续翻译走的就是 SwitchyOmega。看了一下 v2ex，有人测试说只有第一次会强制直连，后续的 API 请求是走代理的。好怪，不知道什么原理。\n\n经常看到有人把博客背景色设成黄色，说是白色太刺眼了，为了护眼。我寻思着白色的书也没人说刺眼，你们就不能把显示器的亮度调低点？舒适的白色应该和你在当前环境下翻开一本白色的书差不多，略微亮一点。我一直都习惯比较低的亮度，亮度稍微一高就觉得晃眼睛，不拉窗帘睡觉到早上绝对是蒙着头的，晚上手机亮度调到最低后还要降低 50%的白点值才会比较舒服……除非是有专门设计夜间模式的应用。要是问“你为什么想到设计夜间模式”，我还蛮想说 Why not，晚上的这些电子设备真的是很刺眼，久了容易青光眼。而且，比较暗的环境光会更容易集中注意力。\n\n类似于我爸每次看我拉上窗帘都要打开，说眼睛看不到对视力不好。得了吧，让我看屏幕反光吗？\n\n有好多有用的 C 端工具是大量的数据 + CURD 整合。说实话，CURD 容易复用，处理数据却是必不可少但又脏又累的活，是一切的前置条件。连 ai 也不能例外。能有好的数据集，那什么都有了。正对应着内容产业一向重要但也一向不被受重视，因为是需要大量人做、谁都能做的重复工作，程序员会觉得麻烦，除非是一个爬虫就能搞定的了。医院很多病其实都比较常见开方也比较重复，我妈说这么多处方，不能写一个系统把常见病自助开方吗。我：？？？不是处方多了机器就能开出正确的处方的啊喂，病人的身体信息还得全面，知道是什么常见病就开方不如网上搜……也就感冒狂吃中成药可以这么干了。而且医院也会有“流行药”，中成药经常在换着流行，也有万年不动的抗病毒和板蓝根。抗生素还得看生产厂家，一般是新药出来的时候，吃的时候比较少，基本每次到需要依赖抗生素的时候我都发现换了个流行的抗生素。电视上经常打广告的复方药在医院不怎么流行，~~可能是觉得有损他们的专业水平~~因为医院供货商通常不需要在电视打广告做零售生意。胃药就是的碳酸铝镁和奥美拉唑。真的就网上都能搜，开方有什么好开的，还是看病比较难一些。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[18,8]},{"id":"2023-01-27","content":"\n我爱上网冲浪，被迫营业一个多月了终于可以静下来，还是冲浪看 Tech News 比较放松，不管是多无聊的新闻都觉得很好看。RSS 攒了很多没看，看的太多了列举不完，印象最深的还是 2022 年前端生态圈的统计数据。\n\n- [State of JS 2022](https://2022.stateofjs.com/)\n\n再关注一下裁员问题\n\n- [Apple: The Only Big Tech Giant Going Against the Job Cuts Tide](https://blog.pragmaticengineer.com/apple-job-cuts-tide/)\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[18,9]}]