[{"id":"2021-11-11","content":"\n**近期轶事**\n\n简述：一个学长，网恋被“女友”骗了。\n\n详述：一个学长女朋友闹分手，遂与同学咨询之。其女友，网线之交，北师在读，未闻未见，仅存画像。每至兴时，以“哥哥”相称，曰“哥哥我难受”。余闻之，奇道：“其人莫不为男？”\n\n近日细细寻之，查断欺佞之人是也，男女未知。学长三观已崩，近日勿言。\n\n------\n\n**今日导师语录**\n\n导师：让你发的 tripple ai 呢，这个进度，连 C 会都（小声）发不了。\n\n学妹：我觉得我可以，我比 C 会那些做得好。\n\n导师：你要是成天看那天屎文（指 C 类文章），只能比他们学得更烂。\n\n------\n\n大晚上狠狠emo了。呆在学校生产自己都看不下去的学术垃圾，不断被学术垃圾降低对系统、对技术、对工作的敏感度，对想钻研的领域毫无提升，纯粹的浪费时间。\n\nxqq 是因为太厉害了，对本科写那些无用的报告做无用的作业感到浪费生命。我是因为完全脱离自己的原本想学习的领域而觉得浪费生命。\n\n大四时 fhw 就劝过我去国外转游戏开发，当然如果去了我现在可能会因为疫情的机票破产……不当时既不太了解游戏也对图形学一无所知。还有一点重要的是当时 mac 太菜了，U3D 很早之前下了一次由于运行不起来而放弃了，后面因为想给人类一败涂地做地图又下了一次，还是卡炸……这说明不要为了屏幕好看而买 Mac……总之几乎放弃做 3D 图形渲染、特效合成类的工作都是因为电脑。几乎只有 blender 的纯建模还 OK，渲染也……我特别喜欢玩 MC，但是也因为渲染太辣鸡的关系坚持不久。因为 MC 的不（尤其后期）自动化严重依赖挂机（不然就太肝了），没法长期放后台。不要提基岩版这种存档不通用没 shader 和 mod 的版本……现在成为了所谓的 MC 云玩家，1.17 的正常配置我已经没法开了，渲染 20 帧超级烫……\n\n为什么不买新电脑……因为不管是哪个版本的 mac（除了尚未稳定的 M1），渲染性能都是渣渣。为什么不用 windows？还是 mac 的开发环境方便……为什么不买两个电脑？emm 我放哪？\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[19,0]},{"id":"2021-11-05","content":"\n又想写一个没有太多实际作用的、非常行为艺术的项目了……\n\n没有时间啊没有时间，要不还是延期一年再找工作好了……只要导师别push，一切都好说好说还能写写别的\n\n真的不太愿意写算法……有些领域真的不明白有啥用啊……而且他们只看 paper 不落地的。背后这几个师兄在这叭叭叭的，说导师不关注技术只画饼提些乱七八糟的要求，而且说话也不听重复早就说过的问题。我真的不明白人到这个年纪咋就这么自信了？之前也是，开个多模态对话系统，说真的我给你开个题很简单了，你把图像特征凑上去就是了……exm？你不考虑是开放域对话还是垂直领域对话？垂直领域对话你不考虑边缘知识？多模态你不考虑怎么融合表征？ CV 要怎么表征怎么训练怎么改进？我是找到了代码和数据集也能跑没错，反正现在又换方向了，因为我说多模态有点难做，所以换 NLP sentiment analysis了，说这个我感觉比你现在的要简单，你做个分类就好了……什么鬼啊？做主观分类就能毕业要咋找创新点啊？然后一堆做迁移学习域自适应的模型……这又很简单吗？“最后你随便找个一个模型跑，总行吧，网上那么多代码”尼玛啊我自己的论文不按论文写随便跑一个模型你逗我吗？真的真的是讨厌空口画饼的，这么多年了没有自己独立实现过哪怕任何一个小项目（学术型不要求代码），完全不知道实现上的困难，还张口就是“你要是说不清问题，把实验数据给我，把代码给我也没有用”。合着十几年的科研生涯就学会了怎么当一个产品经理？啊不，产品经理是高抬了，产品经理也是要看产品的。（没有看不起产品经理的意思只是作为一个乙方的 stereotype）\n\n对于我自已，首先，如果一个概念做不到完全的透明（即不了解下层的实现也完全不妨碍上层的理解），那继续下去非常困难。我能明白的东西一定是明白怎么写的。\n\n“一天一个变，哇我受不了，今天一讨论跟他讨论一个月前的东西，气死我了”来自背后的师兄。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[19,1]},{"id":"2021-11-03","content":"\n这两个月都不会关注开源项目了，也不会学新技术了。\n\n《被学术垃圾榨干的一生》\n\n（虽然这么说总是在倒 flag ，但这次真的不会了，私人时间我连电脑都没有）\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[19,2]},{"id":"2021-10-28","content":"\n关于之前想的分布式博客，发现已经有人做了。有一个项目叫 Solo，还一个叫 Pipe。\n\n不管是Solo是Pipe。都属于是分布式博客系统[B3log](https://ld246.com/article/1546941897596)的一部分，引用官网的话说是：\n\n- Solo 是独奏，[Solo](https://link.ld246.com/forward?goto=https%3A%2F%2Fb3log.org%2Fsolo) 也是独立博客系统，在音乐中相当于不同乐器演奏不同的声音\n- Rhythm 是节奏，用来让不同博客客户端和社区进行协同合奏，相当于音乐中的节拍\n- Symphony 是交响乐，[Symphony](https://link.ld246.com/forward?goto=https%3A%2F%2Fb3log.org%2Fsym) 以论坛的方式交互，聚合个人博客，需要很多人协同参与才能奏出美妙的乐章\n\n意思就是 Solo 是我们可以搭建/使用的博客程序。Symphony 是一个中心化的社区程序。Rhythm是在个人博客和社区之间通信的服务器。\n\n然后 [链滴](https://ld246.com/) 是一个基于 Symphony 的社区，可以在上面看到各个博客的推送。是否很像 feed 流？不过不同的是带有分类评论功能，还是更像社区。\n\n目前的问题还是推广起来太难了，虽然静态博客的生成已经不算是非常困难的事情了，但对于普通用户而言还是太麻烦，尤其是手机。而且博客端仍然以长文为主，评论系统也还没看接是哪里。社区上的设计总觉得有点十几年前的新浪博客社区文艺复兴的味道（只不过个人博客是自己的服务罢了）。\n\n------\n\n另外还想说说所见即所得的 [Vditor](https://github.com/Vanessa219/vditor)。最近用回了 notion，没法，笔记的迁移成本太高。但 UX 是真的香。下次吧。摸鱼太难了。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[19,3]},{"id":"2021-10-12","content":"\n忙了一个多月国庆回去放了下假，回来被说皮肤变好了整个人都白净了……可见工作对人的外貌影响……\n\n然后发现要做毕设几乎没有精力再做 Side Project 了，但真的还有很多想做和应该做的部分没有完成……然后技术文章也是堆着没看。在这之前科研的实验还得先跑。\n\n另外还有点别的想法，比如个人博客的形式感觉还是太老式严肃了，几乎被限定为“写长文和阅读长文比较方便”的媒介形式，对于短文字写起来负担太重，对于大量图片看起来麻烦，对于资源的收集与整理又过于死板，这大概是个人博客难以向大众推广的最重要原因。这个从上世纪遗留下来产物直到如今也没有什么大的变化，无法应对当今不断变化的媒介形式与需求，在这个时代看来从产品设计上就不够用。更通俗地说，就是当代产品把人的胃口养好了。如果要改，并不是多写几个 hexo 插件就能解决的。之前的 yilia 主题也在 hexo 中实现了相册，但比起当代新媒体的相册形式仍然缺乏灵活度和可扩展性。\n\n**不同的媒介一定要有合适的展示形式**。 File Manager 的进化就显示了这一点。在 Mac 上 Finder 有四种视图，对于文件的管理非常够用，尤其是 tree 那个层级的视图。但在大量图片的 preview 上依然不方便，其实可以更好一点的，参考一下 Edge2（尽管 Edge2 的视图上也还差个瀑布流）。\n\n社交媒体本可以由个人博客 + RSS 构成，从而达成去中心化，唯一的问题社交功能上，差个统一的评论系统以供 RSS 显示。这是 RSS 只能是一个阅读器的原因，关于评论互动无论怎样想不出一个去中心化的、适用于静态博客的、统一的解决方案。有后端的博客倒是好说，拓展一下 RSS 的格式就行了。之前的即刻机器人就挺好的， 添加 feed 到即刻评论，博客只管发布。但对于内容发布平台管得越来越严，尽管严格意义上 RSS 阅读器并不属于内容发布平台，想做个评论系统也可以根据博文生成标识符（比如来必力，其实带评论的 RSS 阅读器也最好就是这些评论系统来做……）\n\n睡觉睡觉，别想了，不是社畜有时间用爱发电的东西。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[19,4]},{"id":"2021-09-29 上午","content":"\nemmm，字节竟然面过了唉，之前也没有去实习所以是第一次面试。效率太高了。问题问得比较灵活，而且我是属于讲到熟悉或者感兴趣的东西会很能吹的人，导致我觉得我…………啊啊啊太抽象了。（反之不熟悉也不感兴趣的东西一个字也憋不出来）\n\n相对来说，美团就面得非常八股非常佛系，散发出一种“我们正常校招互联网白菜价”“我们正在完成面试的 KPI”的淡然。不管你说什么他都会按着八股走。\n\n然后，emmm，不知道诶，我也希望还是轻松点好，钱多事少离家近占个两样就很满意了。但我既讨厌墨守成规又讨厌卷。卷不是指加班，加班只是卷的一个副产物，卷是加班的是充分不必要条件。我讨厌的是卷的氛围。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[19,5]},{"id":"2021-07-07 晚上","content":"\n前端的内容终于勉强看完了（指到 React 为止）。\n\n我很早之前就想做前端，但一直被 JS 劝退，就没见过这么 ugly 的语言。然后也不习惯函数式编程，作为没事会去读别人代码的人，不得不说函数式的可读性相对于 OOP 真的太差了，再加上 JS 的设计，坑一大堆，又是动态的没有类型标注，函数被回调来回调去 IDE 参数提示也鸡肋，维系全靠文档，体验极差。\n\n还是想先自己写点项目再去找实习，然后找明年的春招。秋招是指望不上了，毕设也很难。论文一生的敌人。\n\n------\n\n家人今天在进行癌症的治疗。从上周五到现在我也很烦，人一不对劲就立刻强制自己听歌睡觉。能睡着，因为知道睡着会丧失掉一些记忆和感觉减轻一些痛苦。\n\n所有衣服的袖口都脏了。\n\n第 7 年。人生能有几个 7 年。\n\n不工作的人是我，骂自己的人也是我。朋友再说你其实挺强，感觉你都不用复习，你很喜欢钻研，我还是不觉得自己能找到工作。为什么呢，因为我不现实，我没有心。父母说我不干涉你了，我相信你，我觉得也是假的。你相信人是会无缘无故突然转变的吗。网友说其实你学啥都能学得不错，比他的一些学生好了，我问那我转你们那行吧，他说别来。然后专业的美院老师觉得我是个没有天赋的人。我觉得我也是个没有天赋的人。当有这方面天赋的时候人是不太正常的。 Ti 会画木头，Fi 讨厌画木头，所以我讨厌自己下笔只画木头。现在大概唯一有觉得自己天赋的只有乐感了吧……\n\n我不断学习，只是为了学习本身，只是为了逃避，我从中没有乐趣可言。像 m4ivt 说的那样，如果想开心地写程序，只会是写免费的让大家用，所有以盈利为最终目的的都给我滚开。\n\n如果表达自己也能获得认可，那就再好不过了。\n\n------\n\n仙剑1通关了。这么多年，还是个很好的游戏。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[19,6]},{"id":"2021-06-20 凌晨","content":"\n今天去央美看了看展。\n\n晚上走在无人的天桥上，看着不息的车流从脚下穿过，有点微风。突然开玩笑地说，要不就在这里大喊一句 jzszd 吧。\n\n朋友惊到了，说你喊吧，我给你录。然后我们就在天上录了一段此生可能都不会再做的中二的视频。\n\n（两个月后，我大喊的名字中的一个人，已经从全网消失了）\n\n晚上回去时心情很好，没注意何同学就在路边上拍视频，早知道上去合张影也好啊，算是留下一点我在这里生活过的痕迹。他就要毕业了，以后就抓不到野生的何同学了。\n\n6 年了。难以想象在相同的地方呆了 6 年。还有多少年。人生又有几个 6 年。\n\n从前好像很喜欢被关注，只要想有一百种吸引别人的方法，因为大部分人都是慕强而脆弱的，大部分都喜爱商品化的生产。近两年厌倦了成为这样的人，真是觉得从前不可理喻，一直致力于不要让任何人注意到我存在，厌倦了社会与关系，厌倦了被关注，不管是以打工人的形式还是以别人心目中的形式。没有人明白，没人能明白，没有人。\n\n两年前。\n\n> 我：“你画得真棒！可以给大家看了”\n> 雀：“为什么要给大家看，自己开心就好了呀”\n> 我：“别人看了开心也很好”\n\n现在。\n\n> 我：“为什么要给大家看，自己开心就好了呀”\n\n不知道那两个月改变了我什么，可以称之为突然的觉醒，一周之内没有了目标，没有欲望，随之而来是对世界无尽的感受，半年多看到任何好笑的事没有任何笑容，没有任何波动，神经性耳鸣，半夜 5 点睡觉，疯狂买不需要的东西， 花很多很多钱去画画。然后就再也回不去了。仿佛只要自己不被任何人需要，就能有理由让世界抹杀掉不需要的人了。\n\n需要，束缚，禁锢，绝对的自由，真是对立而无法统一的事。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[19,7]},{"id":"2021-06-13 凌晨","content":"\n除了身体不舒服，没有发生不开心的事，很好。\n\n> Here's plastic wounds for someday No more chemicals for you hurray Now here's 911 and 119 Whichever you like choose one of either of this\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[19,8]},{"id":"2021-06-02","content":"\n找不到地方吐槽了…………\n\n真的想大倒苦水，前端的环境是个什么玩意儿！是在考记忆力吧！！！\n\n浏览器本来是让人公开更容易地获取资源的，做啥 App。还不是因为 UI 框架不通用，不然至于搞成现在这样？\n\n然后就是JS的标准，不同的runtime适配，天知道我最开始学 JS 模块找了一个 ts 写的 node module，教程上说得极其简单。然后发现，不知道浏览器怎么用。先是编译成了ES3发现怎么这么像commonJS，浏览器对 require 是不支持的。然后用ES6的语法，couldn't find the module。我知道为什么有这个问题但不知道怎么才能解决。折腾了快一天，最后还是打包工具解决的。别提打包，我本来是在学习来着，打包全都打好了我还学个啥？\n\n还行，虽然烦，比纯写文章好。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[19,9]}]