[{"id":"2021-04-14","content":"\n靠，前段时间是什么诡异的发言。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[19,0]},{"id":"2021-03-22 下午","content":"\n一个认识很久的网友去参加从前很出名、现在依然在播但不那么出名的综艺节目了。大概是因为参加节目所以才注册了微博账号，然后每期营出来个业。我知道这事还是因为这位大v来主动关注了我的账号。感觉他能这样认识到更多的人，真是好事啊。\n\n但关于营业这一点我一直有不同的看法。他会组建粉丝群，有时候营业不知道说什么，就发点才艺什么的，作为粉丝福利。关于这一点其实没什么不好，我没有资格去说别人，只是以我的角度大概率是不会这么做。虽然是公众人物，毕竟也不是艺人，也没那么多粉丝，更多是一个圈子的人。要作为公众账号营业的话，还是多产出一些对大众有意义有价值的东西吧。做做教程、说点有意义的观点什么的。除非真的是艺人，或者有十分突出的个人气质，没什么人想看打游戏弹琴养花这种无聊的日常。当然如果是私人账号那想发啥发啥，开心就好。\n\n这个博客就是不考虑受众想写啥写啥的，爱灌水就灌水。\n\n给人看的东西和自己觉得好看的东西永远是两回事。给人看的东西以他人价值，换言之，用户需求为核心。自己觉得好看的实在是太小众了。当时小学期的小程序课想写rss被老师怼得体无完肤，说这有什么意义你该做个推荐系统。现在想来是角度不一样，我作为学生考虑的自然是能不能技术实现，当时连推荐系统的大概框架都不知道，而老师的重点这东西是有没有用。谁知道这课原来一点技术都不讲只是个画大饼的课呢。我为什么要折磨自己，还连累信任我的舍友逼他做数据格式转换。选个实验水课不好吗。\n\n要不我还是去前端吧，还是喜欢有社会心理学在内起作用的东西，反正最终目的是转行。\n\n------\n\n我最近被种草了一个洗袜子的机器，虽然很多人会觉得是交智商税，但我真的不觉得。\n\n为什么是交智商税呢？因为这个机器一次只能洗一双袜子，洗一次要一个多小时（因为要杀菌和烘干），而且不能洗脚皮和灰尘，只能洗能溶于高温水的东西，比如汗之类的。\n\n但我觉得，日常的袜子也没什么灰尘脚皮，我又爱出汗。每天只需要把袜子一放加点水，我就可以去做别的事了。想穿时直接拿出来就可以穿。我洗袜子所花的时间只有“加水”“放袜子”。我再也不用堆着手洗袜子了，还要想着晾干取袜子叠好收起来。洗袜子从一件一周一次的大事变成了每天微不足道的小事。\n\n不过以上的前提是，我不能忍受袜子和衣服一起洗，加了消毒液也不行。天天洗袜子又很麻烦，我就会尽量穿久一些，但这样鞋也容易脏袜子也会臭。所以我只能堆着手洗，每次洗很多的袜子，烦死了。\n\n同理，做清洁也是一样。我喜欢环境干净整洁一些，但是真讨厌把美好的周末花在家务上。要是有足够好用的扫拖一体机器人我就天天让它们扫三天让它们拖，反正白天人也是出门。这样周末躺着就行了，顶多清理下机器人。\n\n花钱请人也行。但由于我没有钱，我对人也不够信任又不喜欢去控制别人，还是作罢。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[19,1]},{"id":"2021-03-18 晚上","content":"\n回来就能感受到压力了，这是好事，省得整天瞎想。还没过年时他们就开始卷了。与我何干呢，我又何德何能呢。\n\n老S说他娘的不想打工了点儿生活都没有，打算去国企了。他这人之前加班很厉害的，多少还是让我有点惊讶。果然还是做自己喜欢的事才能忍下去，还真是天时地利人和，缺一不可。\n\n我才是对生活最不抱期待的那一个，却是最混吃等死的那一个。只要能满足我一点点精神上的需求就能当工作的永动机了。我庆幸自己有明确喜欢的工作，我厌恶自己抛弃了喜欢的工作，我憎恨没有勇气去做喜欢的工作。\n\n所爱的人来得不合时宜，更好的人依旧不合时宜；热情来得不合时宜，消失得不合时宜。\n\n来来回回四个字，不合时宜。\n\n不合时宜非天非地，惟我而。\n\n只希望能开心，有钱赚。有钱赚的秘诀就是开心着赚钱，这是沉没成本最少的做法不是吗。\n\n最近也不是很能控制好情绪。虽然我已经在逐渐恢复成INTP了，但Fi还是很高。Fi高时就会感受痛苦，整个人就会变得很艺术像发疯一样。说艺术家多少是疯子不无道理。昨晚哭过又草草画了个草图，觉得自己真的是越来越不讨人喜欢了，醒来自己都看着不舒服，是我画过的我最讨厌的画。\n\n\n","tags":[],"imgsmd":["![最讨厌的画](https://i.loli.net/2021/03/18/KiXjpdTtaoN1Hhy.jpg)"],"sourceFile":"001.md","csrIndex":[19,2]},{"id":"2021-03-16 晚上","content":"\n没有人是孤岛没错，但也没人规定非得是爱人。可社会规定了。\n\n六楼看出去，高楼林林耸耸，路灯是最忠实的守卫，静静眺望着每一个行人。永远直直地站在那里，看着很安心。\n\n楼也是生命，以人为血液。人在楼里衣食起居，熬夜加班。穿梭不息，远远看去就像蚂蚁一般。楼是稳定的，人是不安分的。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[19,3]},{"id":"2021-02-19 凌晨","content":"\n很久没有写过代码了。不停的与我无关的饭局。春节期间的厌食与社恐达到了顶点。对于内向型人格，不停的社交无法提交社交技能，只会更加讨厌社交，大概唯一的用处是能看到真实的人长什么样。\n\n很不容易，今天下午终于宅着开始写了点无关紧要的代码，心情终于好了一点。真正的工作还远着，还没开始，可能也永远不会开始。\n\n至少对于我，F是后天逼出来的，我确信这一点。如果说社会把外貌与性格联系成了刻板印象，那我原本就是与刻板印象格格不入那一卦的。什么人就该做什么这种话，可以硬生生把Ti逼成Fi。ルールはルールだ这种也是真他妈的讨厌，他の選択ねーじゃん？那人类社会进步个啥？\n\n“大过年的”“来都来了”“还是孩子“都不容易”\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[19,4]},{"id":"2020-12-04 凌晨","content":"\n昨天看到很久之前和Ayuくん写的歌词，又想写歌了。但想了很一会儿，还是没法先有歌词再写旋律。歌词于我而言真是音乐中最次要的东西了。\n\n然后打开garageband，又被其鸡肋的功能劝退了，还不如caustic一个小小的合成器。写歌这事，还是得等有钱再说吧，至少得有钱装4T的音源同时加载不会卡。不愧是最花钱又容易失业的行业。\n\n但还是感谢之前喜欢学理论的时期，让我用音乐可以表达的范围广了很多，现在不用太在意和弦调式音程不够丰富的问题了，但还需要研究旋律写作、节奏和制作。啊 ，东西还是有一些多的，都是后话了，先处理好身边的事吧。我完全没有资格谈论这些。\n\n要是对别人说“你事情没做完没资格谈论这些”想想就很残忍，理论上也不应该是这样，谁说一事无成就不能谈论音乐了，音乐是包容的。但对自己说这些话就非常的理所当然，因为我研究这些总会到一种吃不上饭的程度。\n\n野田洋次郎真是音乐天才啊。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[19,5]},{"id":"2020-12-03 05:05:50","content":"\n又没睡着。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[19,6]},{"id":"2020-11-30 凌晨","content":"\n我开始讨厌夜晚了，夜晚才有机会痛苦，所以每个夜晚开始的时候都非常痛苦。\n\n我听着タコタ，想着在一个孤独的星球上，没有大气层，所以天是漆黑的。没有别人，有个看起来就很脆弱、竹竿一样的小男孩笑对我伸出手。而我是白色吊带裙的小女孩。\n\n没有开题的状态。明天就是截止日期了，我一个字没动。可当我打开word，就被没有夜间模式的面晃瞎了眼睛。\n\n从本科毕业开始，我就觉得毕设是我做过的大学期间最没有意义的事情。研究生入学考试放在毕业设计之前，目的就是为了让我这样不明所以的人去读研吧。如果放在毕业设计之后，不知道会少多少读研的人。\n\n无所谓了，明明很多时候没意义到想死来试试看，但总觉得还是有没有尝试的很好的事情，所以非常痛苦。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[19,7]},{"id":"2020-11-28 凌晨","content":"\n特别喜欢「蝶々結び」3:30那里一片寂静后突然从#f小三度转入C开始合唱的部分，感觉这样真的很好，瞬间从孤单的状态解脱出来了。\n\n名词什么的现在忘了，好像是同主音大小调转换？不重要了，感觉好就很好。\n\n想到很久之前我也是音乐理论的追求者，觉得好听是有规律的所以花了很久的时间看和声学，还有很长一段时间追求复杂的调式讨厌流行歌千篇一律的1645（小时候也中过1645的毒很久）。那时候Faded很火，有人让我听了之后，我不知道说什么好，心想这整个作曲编曲也太简单了，又非得夸点什么，只能说“啊，这个弯音好特别”（= =）如果换一般人大概该翻白眼了，幸好对方也很理科能从技术实现的角度接下去……\n\n对于音乐“感觉至上”似乎是一般人的常识。我不知道大家是怎么理解这一点的，但对我来说绝对不是如此简单就能说出这么一句话的。如果能去看一点点有关和声学的基础的话，会发现大部分流行歌“好听”真的是建立在非常简单的理论基础上，甚至会产生出“有了这点知识我就也能写出好听的音乐”的错觉，实际上仅仅是能听而已，自我沉醉于和声带来的基础感觉中什么都没有表达出来（我骂我自己）。是为了什么写歌的，是为了学习“好听理论”让不明白人觉得很自己很厉害吗？\n\n过了很久我才意识到，传统的和声、调式等等只是类似于地基一样的东西，还有很多东西能改变一首作品的感觉。即便是地基也不是必须的，也仅仅是前人对于感觉的总结，现在要创新的感觉都朝无调式的音乐方向走了……\n\n现在觉得理论不是没用，没有理论的只有感觉的时候仅仅是在靠着感觉的积累照搬，仅仅是“别人这么做很不错我觉得用在我这也不错所以我也这么用”，可能就是所谓的没有天赋吧，就算弹得再好又幸运到创个省记录也无法掩盖没有心的实事。但若是把理论的高度作为天花板就更加本末倒置了。\n\n啊，为什么又写了这么多，高考作文这么能扯就好了。\n\n------\n\n哭是一种很厉害的情绪表达。人悲伤的时候会哭，高兴的时候会哭，放不下的时候会哭，放下的时候也会哭，心痛的时候会哭，释然的时候会哭。\n\n继续看书，觉得连这样的人也能好好地活着，仿佛人生有了希望也会哭。\n\n我也算是不怎么看得下去书的人，总是思考得太多。比起语言本身的优美这些东西，更喜欢凝视其中的想法。\n\n> 语言永远都敌不过感情和思考，很迟钝，因此有时会远远超过于我。明明是我在写，却变成了对我诉说。发怒、说教、激励、嘲笑。我肯定会被语言一直注视着。有时手握着手，和睦相处，有时不管写什么都不对。今后也会一直像这样重复着，时而紧贴，时而远离吧。就像是超越恋爱与友情的独一无二的存在。\n\n------\n\n母亲打电话时在非常真心地和我交流，我就像是一个机器人一样嗯嗯啊啊，什么也说不出来。\n\n人在社会上究竟是什么呢，是商品吧，每个人都有标价。口头上说着“首要是谈得来”，又说着要把握机会，趁年轻抓住优秀的人，早早在喜欢别人之前就盘算好了想要对方什么条件。或者说，谈恋爱这个事情在他们看来就应该和恋爱分开来看，恋爱是“幸福”的事情。而结婚是寻找一个物质上能长期共处的“谈得来”对象，生子是寻找优秀的卵子与精子，以诞生更优秀的人类。如果你没有恋爱，也不要耽误你找好的结婚对象。如果你谈了恋爱，也要注意这是不是好的结婚对象。\n\n我还是不明白，这两者是这么无关的事吗，谈恋爱与对方一直以来所受的教育、思考无关吗？不会考虑以后的相处吗？难道有人对你很好就能喜欢上，就算“谈得来”？母亲说她年轻时甚至很难拒绝别人的介绍的人，当然以我的时代立场我没有资格批评这种做法，如果我在那个环境里可能也一样。我只是单纯觉得，如果跳过了自己的的感觉而去勉强接受对方，就不要把找对象的事情贯以“幸福”的名义，这不是什么值得庆贺的事情，也不想看到别人对我谎话连篇地祝福。\n\n喜欢什么人自己也得有去追的想法才是对的吧。\n\n在为数不多的欲望最强烈可以随心所欲的年纪，盘算的全是这些事情。\n\n不恰好に蝶にしないでよ。\n\n真抱歉，在这么真心交流给人生建议的场合，我想的竟然是这些。\n\n然后还说到了蚂蚁金服的事情，说到虚拟经济，又说出国家出面管控了。让我不禁想到ss作者说的那一段话。\n\n> 很多人要么一窝蜂的支持，要么一窝蜂的反对，还要把它给封禁掉，大概这种心理鲁迅先生也曾批判过。我还记得当年极路由在 V2EX 被冤枉的时候，也是一边倒的说极路由窃取隐私。如果你们真的那么讨厌商业，那你们应该首先把你们的苹果设备给摔了，因为它就是商业社会巅峰造极的产物。我反对不喜欢一个东西就要拿出简单粗暴的制裁手段，正是这种习性成就了 GFW。\n>\n> 维护这个项目到现在大概总共回复过几千个问题，开始慢慢想清楚了一件事，为什么会存在 GFW。从这些提问可以看出，大部分人的自理能力都很差，只是等着别人帮他。特别是那些从 App Store 下载了 App 用着公共服务器的人，经常发来一封只有四个字的邮件：“不能用了？” 我觉得这是一个社会常识，花一分钟写的问题，不能期待一个毫无交情的陌生人花一个小时耐心地问你版本和操作步骤，模拟出你的环境来帮你分析解决。Windows 版加上 GFWList 功能以来，我反复呼吁给 GFWList 提交规则，但是一个月过去了竟然一个提交都没有。如果没有人做一点什么，它自己是不会更新的啊，没有人会义务地帮你打理这些。最近 net-speeder 又开始流行，害人害己。我觉得，政府无限的权力，都是大部分人自己放弃的。假货坑爹，让政府审核。孩子管不好，让政府关网吧。有人在微博骂我，让政府去删。房价太高，让政府去限购。我们的文化实在太独特，创造出了家长式威权政府，GFW 正是在这种背景下产生的，一个社会矛盾的终极调和器，最终生活不能自理的你每天做的每一件事情都要给政府审查一遍，以免伤害到其他同样生活不能自理的人。这是一个零和游戏，越和这样的用户打交道，越对未来持悲观态度，觉得 GFW 可能永远也不会消失，而墙内的这个局域网看起来还似乎生机勃勃的自成一体，真是让人绝望。\n\n可能不只是国人吧，全人类都在以追逐利益的行动自相残杀。出了什么问题只好依靠国家管控，不要去祸害更多的人。人们无法做出不伤害别人的事情，这是人类有趣的地方，也是我讨厌人类的地方。但为何连一点点相互帮助也做不到？没有人做贡献，只会越来越糟。开源是程序界的共产主义，但没有那么多人是忠实的信徒，所以越来越有被拉垮的趋势。\n\n如果，现在的官僚体系的思想，能与纸上描述的一模一样，我觉得我会挺支持的，不管是GWF也好什么也好。但我完全无法确定，太多的现象让人觉得是在往纸的另一面走了。\n\n我也赞同发展实体经济，这也是说为什么要是我做完全艺术（探索自我）的工作会感觉毫无价值。哪怕能让别人感觉世界有那么一点不一样的色彩，我也是有价值的。我的他者贡献基础分值很低的喔。但就连这样我可能也做不到，也没有人在意这些事情，仅仅是不断接需求，实现别人的需求，循环、重复，维持着整个“人类社会”机器的运转。\n\n明明人类的产能翻了几番，还是有很多人在饿肚子，人们的休息时间反而更少了，和他人交流的时间也更少了。人类社会机器就是这样，大家在不断自我优化。就像股票一样，如果是运行平稳的公司大家都不想会买，大家都喜欢买不断上升的。什么时候是极限呢，什么时候会崩溃吧，拭目以待吧。\n\n以后要是我自己有固定房子，一定会买88键的便携电钢琴，还想弄个隔音好的小小的音乐的工作室，现在只有吉他一个乐器太难受了，人也很多，情感无处发泄。真的很期待在一个人那种创作情况下会变成什么样子，总是期待着可以完全释放自己的一天。\n\n画画其实自己也意识到不太搭，没天赋没训练是一回事，还是太具象了，尤其商业作画的精度，离随心所欲完完全全相反。其实真的随心所欲的摸鱼……也挺爽的吧。但我内在是个话唠，总想着，要以一种方式说出来。用音乐（即便是纯音乐）也比画画顺畅很多。\n\n也只是想想，可能是这辈子都无法实现的愿望。我会努力的。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[19,8]},{"id":"2020-11-29 晚上","content":"\n海鸥每年冬天飞几千公里，我却呆在一个舒适的地方不肯出去。我不如海鸥。\n\n明明只用一步，踏出去就好了，却连这点勇气也没有\n\n------\n\n中国油画院里走进去是有一栋几何上很简单的房子，简单到任何一个幼儿园的小朋友用7条直线就能惟妙惟肖地画出来。整个房体纯纯的肉色，与周围的建筑格格不入。门前有很长很长的台阶。因为独特而简单成为了网红圣地。\n\n说网红可能有一点过了，因为它位于五环以外，附近一片荒芜，连地铁站都要走很久。我去的那天是十一，有好几对新人在拍婚纱。看到的时候就有一种奇妙的感觉。长长的阶梯加上普普通通的屋子，在摄影师的镜头下拍出了迈入宫殿的气势。简单的屋子放在这里很容易就变成了大家所认为的艺术。从古典的油画到几何抽象派，“好看”的技法与理论随着变革创新了很多很多，有时候到了普通人难以欣赏的地步。人们所说的“艺术感”大多也是不同于常规的视觉效果，是难以诼磨的东西。生活去了哪里呢？似乎一定要做出夸张、不被理解、甚至出格的事才会被称为艺术家。有的人甚至觉得艺术家都有点精神病，造就这个概念的不正是你们吗。\n\n一些仅仅是反应生活的绘画语言，因为不够“美”而被人遗忘。若这样的人有幸被奉上艺术界的神坛，人们又开始用不同的目光欣赏它。虽然仍然无法欣赏，但，“艺术家就是不被人理解的”“看不懂很高级就对了”。嘛，也正好符合了这个概念。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[19,9]}]