[{"title":"2022-02-15","content":"\n由于兴趣原因想扒一个 Vue 写的前端。虽然 Webpack 经常把变量打包得妈都不认，但对于字符串和 property 是不会替换的。大致步骤如下\n\n### 1. Network 选项卡查看数据文本\n按照现代前端写 WebApp 的惯性，数据量很大的情况都是 AJAX，请求一个数据文件由浏览器解析。这个数据文件在 Network 中找找很容易获得，是个 JSON 文件。文件 A 字段经过加密，其余都是明文存储。但是 A 字段是最关键的，接下来就是从源代码中找解密方法。\n\n### 2.  搜索 API URL  + 元素审查\n\n既然是 AJAX 必然是明文字符串请求的 API。那就先搜寻了一下 API URL 附近代码，发现经过 webpack 打包后，有一个 g 变量原型上绑定了很多方法。其中一个 replaceImgURL 引起了我的注意。因为之前在元素审查时发现，被加密的文本有一部分被替换为了图片。这个处理我不理解……你都加密过了还要换图片？换就换吧，还就换一个字？防得了谁呢……替换的 Img 的 label 刚好对得上。\n\n然后继续搜寻使用了 replaceImgURL 的代码。这下好了，方法就在原型上，直接叫decryption……\n\n### 3. 查看 decryption 的代码\n\n如果加密解密是自己手写的，那复制粘贴就完事。不过出现了报错，还是引入了 module。引入的 module 名自然是被打包成妈都不认的，但是这用法一看就是第三方库，因为让前端自个儿写加解密才不会设计得这么详细……\n\n```js\ne.enc.Utf8.parse('asdfac')\ne.DES.decrypt({ciphertext: e.enc.Hex.parse(a)})\n```\n\n一眼看到大写的 DES 还有 CRC 一类的，这不就巧了嘛。查了一下，这是 crypto-js 的库。把这几行代码搬到 TS 中写了解密 function，完美。\n\n---\n\n所以过程没有很复杂，完全用不到数学，甚至是直接调现有库。前端安全的话，嗯，还是觉得纯客户端解密没有绝对的安全。毕竟都不用和服务器通信，只要有时间总是可以还原出来。但也没有必要追求绝对安全，只需要提高解密的时间成本就可以了，人总是讲收益的。\n\n也是基于上述想法，我觉得本地差分隐私这个课题是就是扯淡。纯概率论，密码学都不用的，都先不说应用场景，当时看着看着就觉得谁真这么做那我可以去逆向了……\n\n---\n\n过年入了个 switch，买了个舞力全开。天生四肢协调小脑发达的我感觉非常不错，就是没什么场地可以动。路易吉鬼屋也不错的，就是太长了当时得在 3 天内刷完有点累。Mario Party 里面大富翁玩法还是 yyds，抢拍照的小游戏真的笑死了。然后入了几个之前 ios 上看过但没有玩的打折游戏，limbo, inside，勇敢的心，光之子。种田流星露谷也买了，可惜之前的存档不能导进去，没有 mod 少了一大乐趣。\n\n再到之前玩 MC1.18 的基岩版，改了个很久没维护的 Shader 的光照。之前 MC 是亮度 7 以下刷怪，所以 shader 写的是平方衰减。但现在是亮度 0 刷怪了，还是改回了线性。老实说差别也不是那么的大……物理强度和视觉强度还有一个 Log 的差异，不过在亮度 7 以下的地方要好一些了，之前一到亮度 7 以下是乌漆抹黑。\n\n然后最近有人留言问要不要玩 Java1.18 服，我加了一下，mac 好卡，卒。\n\n"},{"title":"2022-01-29","content":"\n晚上开始画一个基于兴趣的设计图。1 个半小时被叫了三次，真的画不下去了。没有一点大片完整的时间，所处的环境对于创作而言就是噩梦。\n\n之前报了个色彩 60 天打卡，也是在今天画完了，但自从回家后基本所有的事敷衍了事，基本两天画一次，1 个半小时水一张。之前了解过自由职业者的工作环境，基本上没有人推荐在有父母的家里工作，“他们会觉得在家里蹲就是很闲，隔三岔五就有人说「诶，我过来玩一下啊」，或者父母有事没事让你拿个东西”。真实。所以年后就去外地朋友那住几天。烦死了。\n\n呵呵呵呵哒。\n\n---\n\n和某学土木的同学联机了几天 MC。但每天我们都有 3 个小时的时差，经常是从北京 9 点联机到 12 点左右，那边就差不多是 3 点了。土木的同学打起游戏也是真的肝，从不搞红石不挂机，就硬挖硬附魔。后面突然面试了一家牛逼公司然后过两天就开始实习了没再打了，她又去肝牛逼公司的项目了……\n\n过年不回家，真好。\n\n我的朋友们，或者说是曾经的朋友们，要么就非常厉害，想赚钱的能赚到很多钱，想搞建筑的最终搞了想搞的建筑，想拿北京户口的本科刚毕业就拿到了，想去国企混的进了最好的单位；要么就是人超好，装完出租公寓就让我先去住几天。大家都过上了想过的生活，好像是只有我在逐渐摆烂的哈。就当是我承接了所有的非气，也没什么不好，毕竟我既不想赚钱，也不想生活。\n\n"},{"title":"2022-01-09","content":"\n记账之后，强迫性睡不着，干脆起来改点 issue。\n\n因为记账发现我居然一年有 1000 多的订阅，有点震惊，一直在整理思路，如果要整理大概可以写个文章叫，《普通用户一年会花多少钱购买互联网服务》。我个人需要刚需订阅的大概有 10 家服务，腾讯视频、B 站、微博、88VIP（网易云音乐、优酷、饿了么）、QQ 音乐、OneDrive、iCloud，还有机场。偶尔 Keep 健身、百度云也会买一点。\n\n互联网对于我的生活影响远比想象中的大。虽然个人不怎么看剧，优酷和腾讯视频一年可能就看一部剧，这么说买断（看观看次数付费）明显对我更友好。但由于爸妈会一起用所以续了，偶尔想看个电影或者小视频没有会员也看不了，又要忍受很长的广告。对于我这样的用户，由于平台的分散，互联网上看剧的花费早已超过了电视，换得片源和时间的自由。不过最近流传的某台出台的近百条傻逼规定，能不续费就不续了。\n\n除了娱乐上的花费，还多了一项和互联网存储有关的花费。几乎需要云同步的服务都需要花钱，不管是社交媒体还是文件存储，上网的成本比我想象中要高。微博大概是上述服务日常服务中最贵的，以图文为主的公域社交，没版权开销，把流量经营好就行了，会员也不会去这满天的广告，大部分主要是去买一些后来的功能，像是再次编辑、评论带图、改名字之类。 相比起来 B 站就很惨。B 站后面也开始买版权了，免费看番的时代过去了，在传统的内容创作方面，一小众圈子朋友在不到 1000 粉时就开始被运营盯上了拉到分区 Up 群，现在终于辛苦经营到 3000 粉。自己之前好好剪的第一个视频（也是唯一一个视频）大概也是被运营送上了首页，投过稿的人应该都能有事没事收到创作激励计划，现在这一块被也短视频行业分走了一部分，不过也没那么冲突，长视频做起来是真的慢，国内相关的Web2.0 性质的长视频平台除了 B 站也没别的了。另外，周围小红书用户也有一些，这些用户大致特点就是 ESFx……抖音用户没有，所以我至今也不是很明白抖音……文件存储，百度网盘靠免费垄断起家还审查个人文件实在令人无语，这不是网盘的该做的事。现在我是全下了下来搬到 OD 上了，但别人不会搬啊……\n\n虽然有博客记日记的恶习，但大部分时候是用电脑时才会写。手机上我是在用 Day One 记日记，因为买得早有永久会员。但是当时没买电脑，所以电脑不给同步账户。notion 记日记有种一言难尽的怪（这时 Web App 的缺陷尽数体现），logseq 的呈现方式又不适合记日记，纯 markdown 的有mweb，但日记还是希望是所见即所得的，结果绕来绕去还是 Day One 最适合。没法，专业的软件做专业的事。纸质日记本也有，但我又不是会固定时间写日记的，只是想起来就吐槽一波，大部分时候眼前连纸质日记本的影子都没有。\n\n游戏也没玩了，千石零宝伤到我了，这种 1% 概率不到的事情在我这一点也不罕见。\n\n困了，睡觉。\n\n"},{"title":"2022-01-07","content":"\n今天吉他练完了 Like a star，嗯，扫弦扫得很爽，手指甲给磨没了……已经没法再弹了，全是用肉弹不响了，扫着也痛。大概是因为之前没有弹过力度这么大这么频繁的扫弦，算一算半个月给食指磨了 4 mm 的指甲，中指也扫裂了一半大概 1.5mm，无名指弹泛音都出不来了。我会主动去做美甲也是活久见。\n\n"},{"title":"2022-01-01","content":"\n新年万事顺遂。\n\n然后就想谈点不那么顺遂的事……因为不是那么顺遂，所以决定仍然写在2021的 po。\n\n昨天是和两个高中同学一起吃的饭，当然能去的都是单身狗。一个整天叭叭的想出去玩儿非常吵，一个性情温和不太说话。然后谈到昨天论坛上一个被删和帖子，AI院一个学生去了一个巨坑的导师组，和导师院长说了想换导师的想法，院领导表示可以退学，导师不让换，并且把学生提出了实验室的群。学生和导师多次交涉无果之后，他说，这是第三次带刀去和导师谈判了，如果还是没有结果就切腹自尽。\n\n原文如下：\n\n> 本人ai院一，去年考研，进了实验室被暗示来了一个很坑的实验室，于是萌生换导师的想法。和导师以及院领导表达自己的想法后，他们都表示北邮绝不能因为导师不好就换导师，可能他们也知道没有导师两极分化差，导师太多，有一个先例北邮就要乱套了吧，期间刘院长还表示这种情况，我可以选择退学。已经和导师表示想换，到时候实验室肯定是呆不下去了，他也不出所料的把我拉黑，并将我踢出实验室群，拿走了钥匙让我离开实验室，如今也是年末，第一学期也快过去，我还是被晾着，也不知道这算不算冷暴力，但是我知道必须得做点什么了。其实我知道摆在我面前的除了退学，还有一条路可能有用，但一直没勇气去尝试，现在我必须下定决心，不能再拖下去了。\n>\n> 我准备和导师进行最后一场交涉，如果失败，就在他面前切腹，算是为我之前犯傻做的错误选择付出代价，这很幼稚，但也想不到其他更合适的不违法不违纪的办法了，我在网上查了切腹死亡，最快也要4小时，如果他们铁了心不想有人能在北邮换导师，只要不打120那我以后就肯定不需要换导师了，之后也能吓退所有想换导师的人，对我而言也是一种解脱，我把选择权交给他们。\n>\n> 现在是我第三次带着刀站在明光楼806门外。昨天和今天上午都在与之一墙之隔的楼梯间徘徊了，好久也没能下定决心，不知道现在能不能下决心，忽然又想起教务处老师在我提出想换导师并否决我后笑着说，最喜欢和我这样的学生交流，可能是因为我当时那种无助又绝望的感觉能给他的生活带来些许乐趣吧，希望他觉得我这个馒头足够好吃。\n>\n> 说了这么多，感觉思路乱糟糟的，我知道这样做后我的下场大概率不会太好，但是我撑不下去了。开学三个月来，每天晚上睡眠都很差，白天要当作个没事人一样，我既不希望有人能看出来，但又希望有人能够看出来，真是矛盾。无论如何，祝我好运，也希望之后的人能以我为戒，再见。\n\n在这篇帖子被删之后，许多相关心情帖也全是秒删。\n\n突然感觉相比起来，我导算是个正常人，不过是老pua，受不了pua不去实验室就按规定警告退学罢了。而我本来就是想退学的，这种学术圈不适合我，我也只是把选择权交给他们，如果不想让我退学，家长就会联系导师和我周围所有人不让我退学。尽管说“随便你”，但都这么做了你还退学，那就是你的问题，目光短浅不领情。\n\n有时候觉得人与人之间真是生下来就注定无法相互理解，十年，二十年，三十年，一辈子，都无法真正理解。唯有这件事，是再怎么努力也只能相行渐远。所有人都在以自我认知为中心。\n\n然后很吵的同学说，当时他动漫社的那几个群友，到现在全都变成了抑郁症互助群，是学校心理咨询室的常客，有个同学通宵在家帮导师干活，结果休克送医院了。然后那个不怎么说话的同学，他已经连续半年服用抑郁症相关的药物， 不过据他自己说倒是和导师无关，是因为太卷了，自己不想找相关的工作，又很迷茫。\n\n别的学校不知道这种情况，但不知道有没有那么多。老有人来羡慕读研的人，我实在不知道有什么可羡慕的，也不过做着讨厌的工作一边被pua一边没钱赚。我目前过得最好的同学都是已经工作的社畜。可能他们的工作要么相对轻松，要么他们很强，要么上司不算很傻逼。\n\n自从打卡画画之后好多了，可能是大部分的精神力都被画画给消耗掉了，画画是特别需要脑子的。\n\n---\n\n说点比较好的事情。\n\n我在食堂真的是遇到了很多奇怪的人，我遇到过尬聊要微信的人；遇到过一个基督教来传教的金发碧眼的外国妹子；帮别人刷卡多刷了五毛钱，他给了我一个铜色硬币，后面发现是新加坡币；还遇到过一个80多岁的老婆婆来问我什么是服务器。那个老婆婆真的非常厉害，她80多岁了，依然保持着对新事物的好奇，而且理解能力超级强，不过记忆力确实没有年轻人好。你追着我问了，一两个小时之后非得给我买西瓜吃，后面给我发微信，她说她记性已经不太好了，但是她记得我对她很好，所以想要记得我。我觉得这话应该反过来说，是因为她对我很好，在某种程度上她拯救了我。对80的老人来说，学会用现代设备和年轻人的沟通也许是非常残忍的。但是她很乐于折腾这些。\n\nUtopia。\n\n---\n\n说了这么多也没什么好总结的，虽然断断续续的，有需求就写几个个人项目，也按个人需求发发展方向学了一些新的技能，不算无事可总结，画画和指弹都有进步。但仍然不想总结，因为总体而言比以往更自闭了，不算是什么好事，本意并非如此，并非如此。\n\n\n"},{"title":"2021-12-15","content":"\n真不知道，现在这个情况，是大家自己一手造就的，还是外界的干预。\n\n我也不能指望每个人都会去寻找方法，即便是手把手地告诉他们，还是会觉得麻烦，宁愿日日被夹也不愿意换其他可以规避的方法。流量变现模式很现代，也很畸形，会让人忘了天下没有免费的午餐，付出更多隐形的代价。\n\n在国内产品推广永远打不过免费的，愿意付费的人太小众了。一个室友天天上王者，看到我打独立游戏感觉挺好玩，一听付费就算了，“不是还有类似的免费的游戏吗，为什么这个要收费啊”。啊，免费的那个是腾讯的……然后想到上周浅墨跳楼的事件，今天政法大学教授 B 站直播间也被关停，真是对环境绝望……\n\n前几天打到 fgo2.3（没错三年了居然才开 2.3……），故事是发生在中国异闻带，从秦始皇开始魔改的故事，大体意思是，秦始皇为了营造一个没有战乱与痛苦的世界，在成功不老不死后，花了两千年，把所有人控制在蒙昧的状态，不允许人们启蒙、探索、好奇，不允许产生文字，不允许人们生病，一旦老去就会死去（因为老去是痛苦的）。自己以控制着物资的运转，成为类似人神的存在，是人们唯一的仰仗。那个世界没有战争、人们被杜绝了人类恶，一生在一个小小的地方自娱自乐，也谈不上压迫，文明亦无法进化（除了秦始皇本人和他冷冻了几千年的手下）……真是难以评价的一章。\n\n"},{"title":"2021-12-02","content":"\nMac 的看图软件比较。\n\n![Mac看图软件](https://raw.githubusercontent.com/NamiLing/upic/master/uPic/picview.png)\n\n我的需求主要是拿来看参考图，不是拿来管理照片的。所以需要一屏能看大量图，同时方便在不同的文件夹之间切换。同时ipad同步依靠webdav，所以需要能直接支持本地文件夹。上面的图不严谨仅供娱乐。\n\n- 看图（腾讯出品）：速度快，不用导入库，界面为图片裁切后的GridView，比较清爽。内存占用一般，200M 左右。支持日期地点搜索。\n\n- EdgeView2：速度非常快，可以查看本地文件，不用导入库。界面是图片原始比例的gridview，三栏布局。内存占用最小，60M左右。搜索和Finder一样依靠spotlight。值得一提的是这个软件对于看漫画（连续的图）做了很多优化，我怀疑开发者只是想在电脑上看扫描版漫画。\n\n- Lyn：速度 OK，不用导入库。内存占用一般，100M左右。没怎么用感觉没啥特别。\n\n- Picsee：功能多，多种视图支持瀑布流。支持从颜色筛选图，软件有库但不用导入，和本地文件夹双向同步。\n\n- Eagle：素材管理，图要导入软件库，鉴于我在ipad会用webdav同步看图，不满足需求。而且是electron……内存控制就算了，有原生竞品的情况下不考虑。\n\n- PicHome：服务器端的相册系统，映射目录到网页上，可以按颜色搜索。基于php和mysql。\n\n"},{"title":"2021-11-30","content":"\n有一些社区聚合服务，我本来觉得，不能达成真正的去中心化，作用有限难以推广。不过现在觉得这么想也不对，价值在于反垄断。\n\n指路项目，链滴，Lemmy。前者聚合独立博客，后者为类似 reddit 的形式。土豆服务器社区好像很早之间有见过，但实在太独立了，和独立建站区别不大……\n\n目前用过还算比较中心化的大概是 zeronet……太占硬盘了。ipfs 还没有去了解。\n\n目前最大的购物需求是，换个硬盘大一点的电脑。\n\n"},{"title":"2021-11-28","content":"\n回看过去那一段时间，简直就是杀人诛心。\n\n在关闭 ins 账号时，甚至有人大字报都准备好了，等着他自杀后起诉。\n\n我在那时补看了“霸王别姬”，心情就如同那时的程蝶衣。放如今，真是无法过审的片。\n\n至少活过他沉冤得雪之时，再去死吧。\n\n为了让自己情绪不要太影响工作，做了张新的壁纸。\n\n![](/img/wallpaper.png)\n\n---\n\n我在关注的一个事件竟然有进展了，原来以为就会这样变成一个永远无法释怀的事。也因此发现了一位用爱发电的数分大佬。他的做了个 gitpage 来放他写的水军数据分析文章。在这之前，他放过知乎，后来无一例外被删除了。至于 CSDN 和简书，我投过知道肯定发不出去……之前 HLS 那一篇也没有过审。\n\n我总是和博客过不去，在博客里吹水，一个重要的原因是因为国内各种平台莫名其妙的审查。并不是写博客多有成就感，仅仅觉得，如果连正常的发言空间都没有，“伞兵”从此意思变成“傻逼”，“苹果好涩”从此变成“屁股好色”，这已不单是给 NLP 增加难度，文化迟早也会跟着衰落、倒退。\n\n网络空间不是法外之地。可我实在是没见到谁在现实生活中，谁说一句“我觉得不对劲”都能被封杀。即便公开演讲也是“有地方讲有人听”才够得成公开演讲。更加本质的问题是，**互联网天然开放，以现实中“公开发言”的形式去看待互联网上的每一句发言，这一模式本身就是不合理的**。有人说，“私聊不就好了吗”。私聊一样有审查，没遇到只能说明瓜不够大。我也仅仅遇到过一次，就是彭帅的事件。和朋友聊也得开本地局域网共享。\n\n另外，像“光遇”这样对于交流本身就很有限制的游戏，其信息传播的壁垒已经足够像现实世界了，依然要开一套十分奇特的言论过滤。当时国服出的时候，一大“乐趣”就是经常触发各种奇葩的关键词，比如“看下面”这句话违规，因为有“下面”……我真的，没办法，每次叫人看下面都要用英文。后面还是回国际服了，有时觉得语言障碍真是个好东西。\n\n并且在言论审核上，资本有很大的发言权。因为 IM 软件是企业做的，一个文件下来公司就关门，审查反而比实际上更加严格。更不用说有的资本有一些恩怨，在特定事件上甩锅审查也没人在意。妙就妙在，它不会让你以为是资本的操控，只会告诉你“这是大环境”。\n\n不吹了，想到再说。\n\n明年开始不会在 feed 流上吐槽了，大概网址也会换。先积累一些内容再说吧。\n\n 《WebGL 编程指南》进度 70%。\n\n"},{"title":"2021-11-21","content":"\n看着看着有重构博客的打算了嗯……但也是真的没时间啊……想做成一个可交互的、各种模块分离且可高度自定义的、内容可以完全由自己掌控（非简单 markdown parse）的。是我看到了一些别的博客受到了启发。开始需要会涉及到预渲染嗯……但还没有接触过相关的……\n\n"},{"title":"2021-11-20","content":"\n前几天也同时开始看《webGL 编程指南》，补一下 3D 渲染和动画相关的知识。\n\n看开头的时候，我觉得还是学了 GLSL SE 的基础知识再来看 webGL 比较快，或者直接在网上搜 WebGL 原理花几分钟看一看也可以。上来就接触 webGL API，最有疑问的不是 API，而是 GLSL SE 里的流程和数据类型。\n\n至于为什么没有直接看 Three.js……Three.js 做业务确实快，不过遇到渲染，我觉得还是尽量学得靠近底层比较好，之后还能上 wasm，JS 的效率会让我有一种想放弃它的冲动。如果不是因为历史原因浏览器长期使用JS跨平台，我大概率也是不会用 JS 的，如果能有选择，实在没有理由用 JS……过了这么久，依然是我心目中 ugly 榜首，ugly 到我要专门训练如何看懂 ugly。当然接受这一点之后写起来随便飞，不过看起来还是依然 ugly……\n\n看了 40%，现在感觉下一本应该看下 OpenGL…… \n\n"},{"title":"2021-11-19","content":"\n开始看《简约至上》这本书，总体来说，就是在用户的角度看“如何简单”，而不是“冒充简单”。这个事情以文档的例子很容易说明。没有人会认为，一个文档十分详细的开源库就意味着简单。同理，说明书写得尽量简单的产品也不意味真的简单。\n\n个人会更偏激一点，认为真正的简单是不需要任何的说明与引导就能使用。有的人喜欢在初次打开 App 时做引导。我不喜欢这种做法，因为我不知道这个引导过程有多长（事实上通常都很长并且无趣），这像是在逼我学习一样，而我仅仅是想马上使用它。这样的简单也很难达成。\n\n因此再说回无代码，我还是持中立的态度。当然我是以程序员的立场，认为使用自然语言编写一些简单程序已经足够简单。编程对于普通人最大的门槛，一个是开发环境，一个是语言障碍，三是编程模式（不过面向过程这种线性思维的编程也不用怎么学……）。用自然语言描述逻辑上，现代的编程语言有足够的优点，这也是为什么python被认为是大众最容易入门的编程语言。而无代码所做的可视化，如果不限定场景与需求，相当于发明一种全新的编程语言，即便是可视化的，也不意味着就是简单的用户可接受的。能带来的效益如何很难说。\n\n在阮一峰的科技周刊上看到过一个字母 b 开头的无代码网页制作的工具，当时刚融资了好像是三千万，于是花了大约 30 分钟试用它，跟着引导走了 2 两个非常长的教程……这已经足以说明问题了。需要如此长的教程才能做出一个特定情况下界面勉强可用的东西，事件绑定时的交互看得我也一脸懵逼，即便我具备前端相关概念，也无法立刻理解它绑定的变量从何而来。最后的成品是一个纯展示性质的界面，界面尺寸未适应，画布上的元素对齐也非常困难。如果是我，我宁愿花钱请程序员帮我做这个网页，又快又靠谱，而不是找个一般人用这个工具花很长时间做出个勉强能用东西。总体来说感受就是\n\n- 逻辑上没有被简化，因此尽管是可视化的工具，依然非常复杂\n- 无代码编程的技能只适用于这一个可视化系统。当然我相信花足够的时间，也能用它做出基本满足商业需求的东西。但一旦脱离这个系统，我又将从头学起，就像学习一门外语一样。  \n\n相对的则是一般的编程语言，许多语言都有着共通的概念，并不会因为仅仅因为换一种语言而难以继续。Go 是一个很好的例子，它是一门设计尽量简洁的语言，没人会因为从 int num 变成 num int 而认为这门语言难学。\n\n换到任何其它有可视化的生产软件的领域，转移技能的开销将比换编程语言大得多——我是指入门，精通任何一个语言都不是一件简单的事情。比如 Photoshop 与 Illustrator，这已经是同一家公司出的软件了，领域都是插图的编辑与绘图，只不过一个是位图一个是矢量图。我用了十年的 PS，核心的那些已经算是非常熟悉了。但换到 AI 时仍然花了我接近 5 个小时去入门其对形状的处理操作（这仅仅是基础的逻辑）。因为对矢量图的编辑还是与位图有所不同，需要人去理解计算机的一些逻辑，理解形状切割、扩展等等。\n\n但具有相同可视化逻辑的软件，开销会小不少。继续使用位图编辑为例子，iPad 上的 Art studio 与 PS 界面和用法几乎一致，可以无差别上手。但 Procreate 就一些需要额外的学习成本。不过值得一提的是 Procreate 的交互非常之好，从零开始的学习成本低很多，就像 Java 程序员转 Go 一样。而如果你从 Procreate 的逻辑去学 PS，大概就是 python(3.7以下版本) 程序员转 C++ 的感觉。\n\n也因此，在各行各业可视化的软件上容易产生垄断。《浪潮之巅》中说软件的垄断是因为软件的复制成本低下，仅仅需要投入研发的成本，增大用户量即可带来收入，这是从商业的角度。从用户的角度看，垄断是因为再次学习的成本与内容迁移成本太大。如果没有学习成本与迁移成本自然是哪个好用/宣传多换哪个。你看，哪个静态博客系统谁能垄断，完全没有再次学习的成本与内容迁移成本，后起之秀只要好用立刻就上来了……\n\n所以说，无代码/低代码/可视化上，想要能持续投入生产，一是真的很简单不需要学习就可以上手（这点是最难的），二是有一套统一的规范、平台，三是垄断，使用自身的影响力做平台与规范。个人目前想到的是以上三点。\n\n诶我应该是在看书的来着……简单这个事还是看受众的。这本书讲的是面向普通用户。\n\n（还是滚去多看书不要半斤八两地吹水沝淼……）\n\n"}]