[{"id":"2025-04-08 21:08:00","content":"\n还是忍不住陷入了，意义怪。再怎么说不要去纠结这个事情，他是否充实是有没有意义，能完成就行了，可是到最后还是会觉得不充实就不想做，那叫做没带脑子的瞎忙。\n\n昨天看了一堆 合成器，嗯嗯嗯都功能性套娃，最终效果还是看审美。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[2,0]},{"id":"2025-04-07 03:16:00","content":"\n不看论文难受，看了更难受，想死。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[2,1]},{"id":"2025-03-28 17:50:50","content":"\n笑死我了，喜欢看吐槽写茴的 [再也别问 Singleton 了好吗？ - Frost's Blog](https://frostming.com/2025/singleton/)。但是在知道够多茴，有比较下才会感到写茴没必要，矛盾……\n\n我到今天也是比较喜欢 Go 的，整体的简洁避免了很多写茴，每一行的调用都是可预期的，没有魔法。好多几年前见室友看不懂 python 库里一个类的代码调用的哪，也没有注意到原来类像函数一样调用是很怪的，一查原来是 `__call__`……如果说一定要掌握很多深入的特性才能看懂库的执行逻辑，那就是魔法过多了，需要考一个 mastering python 资格证（某厂真有）\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[2,2]},{"id":"2025-03-27 21:13:05","content":"\n看了 spark-tts，因为生成特别慢想看看改进空间。结果发现是把音频特征全塞到 Qwen 做 Tokenize，输出巨长的长度因此很慢。但如果输出的特征减少，要么架构会变复杂增加一些后处理，要么就是舍弃一些 performance……\n\n只要开始写论文，nami 就会对一切感兴趣，甚至其它领域论文……\n\n至于为什么看 TTS，因为晚上睡不了，在找听书的用的语音。然后就是，念咯噔 BL 文绝赞推荐 GPT-SoVITS 的流浪者微调语音当旁白……\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[2,3]},{"id":"2025-03-20 11:27:12","content":"\n昨天睡不着问了 gpt，还是建议我记录。所以我又来了。\n\n今天她要走了，她一早上开始放微信视频号，乱世佳人的梗概和爹味育儿视频，并且在她离得远时音量开到最大整个房子都听得见。\n\n我受不了，带起耳机放歌了。头也蒙在被子里。然后她进来和我讲话，声音穿透了耳机。说以后你发生什么我都管不了。加深了我的没信心感。\n\n我在想为什么她不能说，就算我们帮不了你，我们也相信你可以把事情处理好的呢。我知道我缺什么了，真的……是信心与合适的监督。\n\n我只睡了五个多小时。我本身不想起床，现在我更不想起床了。正常的计划类，我是想起床帮她收拾东西送她的。但是是睡5小时时被叫醒然后放爹味视频号叫醒的。\n\n而昨天睡不着的最主要原因，我咨询gpt了。deepseek 比 gpt 更不稳定更不靠谱，MoE 的缺陷此时尽数体现，太跳跃了。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[2,4]},{"id":"2025-03-16 19:32:05","content":"\n看了 [transformers.run](https://transformers.run/) 。一大堆数据集介绍和 relative works。是非常好的 survey。很好，很偏实践，\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[2,5]},{"id":"2025-03-16 04:17:00","content":"\n睡不着，心情很差。\n\n在我妈又在那里用嘲笑小孩子一般的语气说我幼稚之后，我用非常严肃的语气说，你有没有发现，你关于我的事，不会讲一句好话。\n\n然后她又开始笑，说。你看你同学不会对你毕业的事说什么，只有家人才会对你说真心话。\n\n我依然严肃的语气说，好，那我如你所说，是没有任何用的人，不会工作，学的东西全都没用，只能啃老，可以了吗。\n\n她说，真的是幼稚，还和你妈顶嘴。你意思是希望我把你当外人一样，尽说好话？\n\n我说，你先把我当个人。\n\n我现在好想出去把自己冻死在外面……如果是一个人真的会出去，但该死的我又并不想让她知道我现在心情是发疯状态。\n\n从来都是如此，她每一句话只为控制我的发展轨迹。幼稚是一种从我记事起就有的人格侮辱。为了不被她负面评价，表现得很上进很积极很听话，她开心了我就会没有那么难过。如果我真的心理很健康的人，或者说被溺爱的人，大可以说幼稚怎么了，多好啊幼稚鬼有妈妈做饭。但我太明白她只是为了否定我自身希望成为的那种人，因为说我幼稚只会出现在我不赞同她的精明观、表达自己的希望时。在她的世界里成熟的人只有一种存在形式，她由衷地希望我是那样的，以各种常见东亚家长 pua 话术令我自卑，什么神经多样性通通扯淡。\n\n想到这个世界他妈的全是这样的就绝望。\n\n刚刚去下楼下站了15分钟，穿着秋衣秋裤。回来看了一眼，-2度。感觉自己跟个疯子似的，半夜蹲街上。但我明白为什么会这样了。在极端的痛苦下，尊严不值一提，并且已经没有生存空间了，蹲大街冻死是最符合想象的归宿，至少没人打扰。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[2,6]},{"id":"2025-03-15 19:38:50","content":"\n每天吃饭都要被我妈的外放微信视频号烦死。我带着封闭入耳耳机把歌放到我地铁上的音量大小才勉强听不到。不知道她们那一代怎么就是喜欢大声外放这种垃圾音频。我对其反感可以说完全是频率上的，都先不说是不是垃圾内容，就算这么放我喜欢的歌我也觉得刺耳，响度爆表。而且这不是年纪关系，很小的时候我被他们放在 KTV 时进去我就得拿纸塞耳朵。还有过年的鞭炮声，摔炮可以听，擦炮的声音也是不捂耳朵听不了一点……\n\n非常 非常影响……太吵了。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[2,7]},{"id":"2025-03-14 12:49:19","content":"\n然后说又看到了[阮一峰说低代码状态](https://www.ruanyifeng.com/blog/2025/03/weekly-issue-341.html)了……嗯，鄙人2021年的 memo 也在大骂低代码（并不算）现在看来很多地方举例非常不恰当，显得很肤浅，但核心来说还是同样的，UI 重要的地方不是 UI 而是逻辑……有固定工作流的中台也许是可以的，需求是确定的，但这东西不要 toC，to 不了 C，to B 也不行，要 to 只能 to 有特定需求的程序员。即便游戏的程序还挺喜欢可视化的编辑的，这么说来 Unity Component 何尝不算一种低代码……给足够的 Component 游戏程序员还是死不了，天天查有没有人造过这个轮子，这个轮子要怎么结合项目，最后看完感觉不如自己纯代码手写一个……复杂的是业务逻辑，不是拖个 UI 本身。\n\n哦对了，Unity 里有个地方低代码是算是应用比较成功的…… shader graph，这就算是有固定工作流、非常特定场景的应用，不过我保证没有图形学基础还是一脸懵，以及，这东西能成功应用的还在于 HLSL 这门语言本身不够直观，把定义、指令、渲染流程混在一起了。UE 的蓝图，也是被评价为“能做那种模板的开放世界游戏，但稍微想做点不一样的就得自己写代码”。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[2,8]},{"id":"2025-03-14 12:08:06","content":"\n前天真的要被气死了出门找自习室了。从来都是这样的套路：“我中午约了一个哥哥，你要去吗”“你以为是来看你论文的吗”。\n\n我还记得几年前要我背电脑参观一下一个跟风搞 AI大模型 的初创公司的工位，先是骗我只吃饭，然后骗我参观工位，最后变成了我在会议室连着自己电脑上答辩一样讲破毕设到10点。然后他说，还行，我就觉得这公司技术水平要完蛋……但我能说啥我只能说 AI 是风口拿到投资很有前途……难道要我说你们公司定位到大模型训练要是觉得我还行那就会被同行卷死吗……\n\n不过有没有前途都和我没关系了，他们有钱拿就可以了反正几年内也饿不死履历也好看也算是人生赢家了。但我是不会再信任何“你以为是去讲论文”的鬼话了。我论文不知道被他们拿去给多少“专家”看过了，解决个鬼，都不是一行的，我还得再讲一次又一次，我每讲一次都是折磨，我思考论文本身就是折磨，不用开始做想到要写就觉得无法做任何事了。\n\n一说工作就是我学的东西都是没意义的，学了几年也没见你找工作。这事我也吐槽过很多次了，不想再槽了，只会宏观套上填鸭式大道理的人是这样的，就好比律师一小时的挂牌咨询费一千，他们大概会觉得这律师一个月能赚72万。\n\n逼我和导师发没完成的论文，我实在想不出写什么，问她，首先叹气：“哎呀”，这是一个卖惨的前兆，“老师，你看我实在写不出来了，你看能不能帮我完善一下”……我听着就无语，要是导师我特么最烦这种人了，自己没有尝试过各种方案，说一句不会写就甩给别人。\n\n当然她控制别人的手段大概也就是常见的卖惨和道德绑架。比如，她想让我提东西，就以半开玩笑式语气说你都没有点孝心都不主动帮你妈提东西。同学请吃饭时在公司只能刷公司卡，同学买单了，她就是你事先都没有想到带点礼物啊（我草我是想到了的但到底是谁睡到4点半最后还迟到了半小时的，我从来没有主动责怪她过）。她想睡觉了，所以想让我睡觉就是，“做事不要没有个节制”。十几年都是同样的车辘轳话术，从来不思考背后有效或没效的原因是什么，有效是理所应当，没效就是我不听话罢了，要不就是我叛逆，要不就是我恨她。我一个（疑似） ADHD 做什么事都是非常容易被打断成无法进入的状态，即便打游戏这种事也只能是全神贯注，然后就变成了我沉迷游戏……沉迷画画还沉迷音乐。怎么没说我沉迷写代码沉迷工作？因为又回到了上面，我写的代码在她口中是无意义的，她传播她的焦虑却对此造成的心理问题不带来任何解决办法。我讨厌卖惨的和人身攻击，我也无法理解利用撒娇控制他人的人。\n\n\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[2,9]}]