[{"id":"2024-01-17 00:54:32","content":"\n看完了米奇与达利，这部动画开头的节奏没有坂本那么喜欢，但是后面非常喜欢，结尾也结得非常好，一如既往地又巅又温暖。最后一幕是缅怀作者我哭了。\n\n游戏那边在线好友1一起打双人成行，不愧是21年的年度游戏，设计非常好。\n\n我把 Getting Over It 通关了。对，就是那个没腿硬要用锤子爬山的罐男。其实通关完发现也没有用很久的游戏时间，断断续续玩了三天，最后显示5小时多吧，是吧这破游戏也没有说要用上20小时去练什么的。但过程是真的痛苦，中途会让你觉得一辈子都过不去。但最终还过去了。还是因为有在线好友1看着。\n\n博德3我玩不下去。虽然是年度，但对我来说这游戏可以说是 debuff 叠满吧……场面是常见的欧美风格写实荒野，没有什么创新的感觉也没有想截图的欲望。传统的血腥暴力元素很多，一言不合杀杀杀，地图中充满无用也不好玩的物品，对于探索党来说算是极其不友好了……还有本地化也有一些问题，查攻略时发现有的翻译把表面的词藻改得很华丽，但既空洞还更加让人难以理解了。还有新手引导，没有玩过dnd规则的，一开头真的会被这密密麻麻的面板和各种属性搞得头大，完全不知道是干什么的。当然这其实主要还是一个看剧情的游戏。但就剧情而言，东亚很难共情到宗教相关的。我个人也不喜欢什么权利、力量崇拜有关的东西，也不喜欢用故意用刺激性的画面和剧情去博人眼球的作品。好莱坞的剧本写作中会教你动机要原始，就是“生存”“性”“贪婪”一类的动机，这样才能引起人们的共鸣。但如果仅仅到这里戛然而止，未免太索然无味了，只能说非常安全且合理，但根本看不到几千年来的文化积累下了什么。然后背景设定也是经典的西方，对于东亚文化且不常玩游戏的人，初次接触是一脸懵逼。\n\n我小时候看偶像剧时，对偶像剧的评价是：“除了谈恋爱，就没有别的事情可以做了吗”。我现在对打怪涨经验这类游戏的看法，“游戏除了杀人，就没有别的事可以做了吗”。小孩子为什么会看动画看哈利波特，在随便一切台就是情情爱爱或者打打杀杀的电视剧里，动画的题材是在小孩能看懂的前提下最多样化的……柯南不香吗，魔幻手机不香吗。游戏也是一样的，我心中的年度依然是王国之泪。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[2,0]},{"id":"2024-01-14 19:33:34","content":"\n排版上会说设计灰度平衡，但我觉得最难的反而是去故意设计灰度不平衡。平衡是在功能性相同时需要考虑的东西，但如果是功能性不同，要考虑拉开差距。\n\n之前有注意到，设置 border 分别为 2px 和 1px，那 1px 的灰色选色要比 2px 暗，才能和 2px 是一致的效果。在设计灰色文字颜色时也是如此，如果是更粗的字体，选用的灰色需要比常规字体要浅。\n\n但是，如果目的是故意强调，比如标题，链接，是可以考虑加重灰度的。即便快速滑过，也非常容易定位到这些灰色不一致的文字。用于吸引视线也是一个很不错的切入点。\n\n遗憾的是，加重的那一点点灰度只有白底黑字效果比较好，在夜间模式下的效果几乎等于没有，夜间模式下还是改颜色看得直接。如果要设计 darkmode 友好的视线强调，还是用 accent color  吧。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[2,1]},{"id":"2024-01-13 12:20:00","content":"\n一万年过去了。\n\n\n\n","tags":[],"imgsmd":["![](https://cdn.jsdelivr.net/gh/NamiLing/upic/picgo/202401131219995.webp)"],"sourceFile":"003.md","csrIndex":[2,2]},{"id":"2024-01-09 02:26:15","content":"\n感觉要花很多时间去堆具象的东西才行……博客的设计风格也是简单到像只加了一点排版的 txt，甚至还觉得不够简单 …… 对花里胡哨的东西实在无缘。如果用一个图案代表风格，那我只能是一个主题色矩形方块，没有圆角的那种。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[2,3]},{"id":"2024-01-08 03:22:42","content":"\n看了一下 GraphQL …… 嗯？这不就是我之前想加给博客 build 和 CSR 的东西？？我还在想如果搞多种数据存储形式要怎么统一查询方式来着，感觉每种数据存储形式都要单独维护一份 query 的实现好麻烦，还要写sql。好好好，至少带有 GraphQL 实现的数据库可以统一查询方式了。大概。拿来搞多种后端接口形式统一也挺好的嗯。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[2,4]},{"id":"2024-01-05 呵呵","content":"\n思考了过多会归于虚无，会觉得好多看似有用的东西实际没有，本质的本质还是最传统的基础，是形而上但又实际的东西。但大家热爱为新的形式买单，就像热爱研究茴字的五种写法一样。鲁迅先生的精神状态真是领先一百年。\n\n很多产品宣传“你为什么需要xxx”，有时可能是真需要，但更多时候，其实是在说“我们真的有改进哦，为了符合需求，开发出了茴字的第六种写法”。观众有没有想过，自己真的需要掌握茴字的六种写法吗，是不是早就习惯茴字的第一种写法呢。\n\n但这样又有一个悖论……在了解足够多的茴字的写法前，你无法知道你其实只需要茴字的一种写法。\n\n不过对于创造出茴字第六种写法的人而言，总得找点事做。他们如果承认了五种茴字早已完备，就得转行了。总有人提出茴字的新写法，总会有人追随新的东西。新东西，很能赚吆喝的。\n\n躺着根本起不来，如果面前一米有瑜珈垫我就滚上去健身。但什么都没有，就是打滑的地面。对了，我再买一个瑜珈垫吧，虽然只能用十几天了。\n\n开启打游戏和看剧模式好难，特别难。怀疑是潜意识焦虑，觉得，人不能停止学习，就算什么都没学到，但不能在别问起“你大晚上干什么时”，说“我在打游戏和看剧”。很多时候别人并不在乎你做了什么，为什么而做，只想让你不要闲着，闲了你就去工作，你就去社交，你就去相亲。那我还是，闲的时候学习吧，我忙着学习，就别让我搞一些有的没的了。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[2,5]},{"id":"2024-01-04 02:09:05","content":"\n微软雅黑的 600 和 700 的渲染简直不是一个等级的…… 为了不同字体渲染的一致性 决定改 600 了，淦。我需要加粗，但不要粗成这样，700 像 bolder……\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[2,6]},{"id":"2024-01-03 09:15:21","content":"\n密码管理器换成自建 bitwarden 了。感觉应该还挺靠谱的吧，oss 备份加 onedrive 备份，半天一次。腾讯云倒也没有那么容易 service down……其实小小小小服务器的机房也很久没出问题过了，只是 docker 跑在小的虚拟机上确实不太够用。还是想 100% 的 uptime。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[2,7]},{"id":"2024-01-01 00:00:00","content":"\n那就祝大家都能便建康吧。可能不能便匆名，但可以便建康。\n\n---\n\n记一下昨天聊了些什么吧：\n\n- 为什么当初脑子抽了要学五笔啊\n- 网上看人画画和报班是不一样的。报班是大佬就在站你的面前，表演画画\n- 练基础很重要（曾老师加完班后开始疯狂输出）\n- 打开支付宝年度账单可能就发现自己没有想象中穷\n- 地铁 1 点停运\n- 太猖狂就会进局子，比如恒大\n- 睡好觉真难\n- 有人画了半年的手账，有人把一口气节奏大师刷到了595关\n- 最近有什么剧好看\n\n紫紫让我正常点，别发颠。\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[2,8]},{"id":"2023-12-30 01:38:49","content":"\n可以用 obsidian 搞出图里的这种统计页面…… 那个 button 插件很有用啊，非常十分有用啊……没有根据 template 新建文档的数据展示是没有灵魂的。\n\n这样我就可以躺着写日记了，为了各种能躺着干电脑才能干的活真是煞费苦心。虽然会延迟发布233。但是不重要，能方便写比较重要，之前就为了可以在手机上写日记，还在苦恼要不要用云cms，但我又实在不想把个人数据托管到服务器上。现在好了，obsidian 就是 cms。而且支持标签语法，这样和我博客里的解析就是一样的了。也还持 tag 查询。越想越觉得这就是为静态博客 cms 而生的……\n\n而且 git 的话，目录是可以软链接的。这使得 ob 的一个 vault 可以同时兼顾博客数据与其他数据，博客数据软链接到博客的代码仓库下就 ok 了。\n\n","tags":[],"imgsmd":["![Obsidian dashboard](https://cdn.jsdelivr.net/gh/NamiLing/upic/picgo/202312300138986.webp)"],"sourceFile":"002.md","csrIndex":[2,9]}]