[{"id":"2023-12-02 03:04:36","content":"\n好烦现在的屏幕，真的是五彩斑斓的黑。虽然我选产品的时候有专门注意屏幕参数，但果然还是不行，就typora的这个标题，都能看出外框正黑，菜单栏是冷黑，但正文的Next主题灰黑色又发暖发青。就是这个发暖发青，真的绝了，没法好好配色。还是只有高饱和才能压色偏吗…\n\n我眼睛好像对于低饱和变化是比较敏感一点，高饱和颜色看不了太长时间，很难受，经常画出来颜色会发灰，因为选色时老觉得颜色已经变了很多了很丰富了，过几天一看……这不都差不多是灰色吗？？\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[2,0]},{"id":"2023-12-01 06:29:35","content":"\n对了，我终于看完了《齐木楠雄的灾难》，看了两个月……这是少见的越看越好看的日常动画，看完的时候严重戒断反应。两个月来有空的时候就会看看看，睡不着也开着看看很快就能睡觉，因为节奏特别快，看20分钟像过了一个小时似的。看着人物形象越来越立体，我以为他们的故事会一直持续下去，结果就突然没了……网飞原创那一集的结局也非常非常棒，比原作还要好的感觉。\n\n我最喜欢的日常动画还是《在下齐木，有何贵干》。虽然很短，但脑洞真的很独特，下下下下下辈子都想不到的操作。而且总是很暖心，结尾结得真的好！\n\n这两个搞笑动画虽然表面有一点像，但内核是很不一样的。《齐木》比较电波系一点，人物会重置的，所以完结时总觉得他们的世界在继续。《坂本》给人感觉更像有连续性的独立故事，到最后所有的矛盾都很好地解决了。\n\n唯一可惜的是，坂本的作者去世了😭幸好她说她的一生很快乐，这就足够了。目前的在播动画已经成为她的遗作。\n\n然后我算了算动画的经费，只是画的部分，逐帧的画一人一天撑死画两秒（原画+上色的流程），分工的话加上导演编剧分镜后期一原二原中割色指定场景摄影配音……也是一天两秒（可能还不到），质量高很多的两秒。两秒差不多是一个镜头吧，不算长也不算很短的镜头。这么算下来2秒花2万块是再正常不过的事了……真的可怕。如果前期有好好规划，比如导演分镜编剧都是一个人，色指定和场景摄影是一个人（原画真的省不了因为就是时间堆的）成本会更低，但也低不到哪里去，能一人多职的都是大佬……\n\n如果去学动画，最开始会发现，画了两秒，好开心！坚持一个月，积少成多！结果一个月后，也画不过一分钟……而 TV 番组都是20分钟，真的是很大的工程。所以国内很多泡面番，因为做起来真的太难了，投入与回报完全不成正比。\n\n我又想了下为什么动画的投入产出这么不成正比，原因其实在于……画风。摄影作品什么的再怎么调滤镜都是写实风，镜头语言剧本风格改起来又没有改变画风这么慢。声音作品也是如此，也是写实的。如实记录是很快的事情，但创作也就越慢，成本也越高。3D动捕的成本也比2D好一些，但3D也是永远有一种3D感，包括原神。用3D去模拟真正的2D并不会更快。\n\n想起了双城之战，有人问你们的人物为什么就像画的一样，他们说：“We paint!” 他们就是用画的纹理。\n\n2D 永远有一种独特的抽象感，我不认为它为消失，相反，随着具象事物的泛滥，抽象的东西会变得越来越珍贵。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[2,1]},{"id":"2023-12-01 05:56:22","content":"\n更新了 logseq，发现有一点 breaking change，所以主题也更新了一下。非常佛系，也没有看社区，现在越来越懒了……只是他们新加的组件最好不要动。一直在删删删旧代码。\n\n我博客也是一直在改改改样式，也是没有仔细设计，细节上有挺多设计不一致的。比如圆角的弧度对齐……因为从前设计整体是方形，所以 post 的搜索做的是偏方角。但是 memo 整体是圆角的……然后 memo 的搜索框有 border，因为那边信息量比较多，图标也是以线条为主的，没有border反而感觉很怪异。但是其他地方又都是无边框的，唉……设计很难的！要感觉简洁但又要让人感觉不要太空，twitter那样的分块是最好的。可以的话我倒是想抄，但其实也没有那么适合个人博客，因为个人博客的布局是非常不固定的，不是 app，还是很喜欢长文占满一整页的感觉。有个东西叫 usememos，我用不了……树形分类与长文是有必要的，基础的导航也是有必要的，强迫症会比较开心。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[2,2]},{"id":"2023-11-29 03:12:05","content":"\n#工具 windows创建硬链接和符号链接的工具：[Link Shell Extension](https://schinagl.priv.at/nt/hardlinkshellext/hardlinkshellext.html)。安装完，右键源文件，选择源链接，然后去目标路径，右键创建为符号链接就可以了。之前特别烦这一点，因为 pwsh 命令太长，软链接要管理员权限，真的懒得打命令，一直不怎么用。顺便推荐少数派上的[这一篇文章](https://sspai.com/post/66834)。\n\n","tags":["工具"],"imgsmd":[],"sourceFile":"002.md","csrIndex":[2,3]},{"id":"2023-11-28 08:55:10","content":"\n最近要变成高饱和战士了……心态和性格会影响的所有创作类的东西，极其影响，而且性格还会变化，大概是只要对世界一切保持好奇和理解，性格就不会太稳定。\n\n不过也是相对的，比如太不稳定我也学不会画搞笑猛男……\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[2,4]},{"id":"2023-11-26 00:51:20","content":"\n明显我的画技还不足以支撑我使用windows画图这样的神级绘画软件。\n\n\n","tags":[],"imgsmd":["![](https://cdn.jsdelivr.net/gh/NamiLing/upic/picgo/202311260050763.webp)"],"sourceFile":"002.md","csrIndex":[2,5]},{"id":"2023-11-25 22:13:15","content":"\n我有一个收藏夹专门收藏个人博客，特别是自己写的页面的。\n\n很多人很有个性。我很羡慕，我做不到。\n\n文字的力量非常强大。如果你的标题像是在写诗，再配个非常简洁的界面，怎么样都很好看。比如[它](https://bouquetrender.github.io/blog/)。\n\n如果你的图片很高级，文字不多，也会很好看。\n\n我也想变得好看！但是话太多了，表达欲是比较过剩的。只是有比较多的方式去表达。不一定非得说话。\n\n我不太喜欢在现实中说太多话，倒也不是说有社交恐惧一类的。我不想要我说的话对别人造成任何影响，但和人交流就是在不断造成影响，我对影响别人和被别人影响这个事情恐惧。言论可以让人思考，也可以让人失去思考。\n\n还有很多时候，说一大堆话只是为了说服别人，或者说是证明自己。我也一点也不想说服别人或者用言语证明自己一类的。对着琳琅满目的简历除了厌恶已经没有其他感觉了。小时候会羡慕简历上有一大堆东西的人。但现在觉得很烦写成这样。满足要求，够用就行。\n\n我不知道有多少人难入睡是因为一直脑子在重复一些没什么意义的思考。我很羡慕可以一秒睡觉的人，我做不到。\n\n我想起了那个身体永远停留在13岁的小孩子。他今年应该22岁了吧。我想去看看他，不知道他是否在世。也不是出于同情，因为他很有趣，从小就很有趣，少年老成。我觉得这样的天才不应该遭受到老天爷这样的对待（脑部相关的手术失败导致的问题）。得庆幸现在有b站。我不知道他在做的是什么账号，但是这样应该有很多人会看到他。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[2,6]},{"id":"2023-11-24 05:39:50","content":"\n图片浏览器移动端的交互手势重写了啦啦啦，成功做到了可以看长图！并且流畅度全程靠 css 动画！帧率感人！我对 css 动画有一种执念，性能上的执念可能是，再烂的 css 匹配性能都比 JS 好。JS 的动画一般 chrome 上都还好，safari 真机测试时开始掉帧，整个交互说好听点就突出一个灵活，说难听点就是乱飞。\n\n没有用库，很臃肿，而且要实现我要的方向锁定的功能也还得再封装一次。自己写下来交互没那么全，但够用了，毕竟打包大小 1k 不到啊！高度内聚啊，没有多事件冗余啊。\n\n之后要写一下 zoom，还有 zoom 状态下的拖拽。不过其实不是很有必要，基本是网页端屏幕太大的时候会用到。\n\n参考了微博移动版的的图片组件事件绑定逻辑，对于 react 的事件绑定也看了use-gesture 库。我真的想了很久很久传统的 query 要怎么绑定，因为 react 是没有办法检测到 ref 值的变动的，也就是没有一个渲染完成的时机，传 ref 的 current custom hook 也压根不会触发刷新，毕竟 useEffect 也不会刷新。监听 onload listener 也许可以，但他妈有的组件是 lazyload 啊！比如这个问题：[What is the easiest or recommended method to add a copy code button?](https://github.com/orgs/mdx-js/discussions/1948)。在原生 dom 上很好实现的东西，在 react 上堪称世纪难题，最正确的做法还得是自己写插件……我操了，我真的操了。\n\n所以当我想“绑定完一个事件后再绑定其他事件”，想用 ref  时也是一个完完全全的“我操了”。后面看到 use-guesture 库的绑法，fine，真的很奇葩，很 react，但 work。完全不是时间序的东西，后面慢慢改改改，逐渐有了分组绑定的思路。个人觉得交互事件比较重要的一点是需要使用外部的 state ，只有输出刷新页面的数据才放在组件内部。不然改个内部状态就得重建一个函数就重新绑定……还玩不玩了？\n\n到现在我拆复杂的hook，都没法第一时间完全想出哪些状态放外面哪些状态放里面。把 search 拆出来时拆死我了。很多东西拆了其实也没有地方复用，一般也只有框架类的才有机会复用，只是为了看起来清楚一点。就比如拖拽手势，虽然理论上是可以到处用，但我也是真的想不到还要什么地方有加的必要。而且图片浏览的拖拽实际上也比一般的拖拽要复杂，只是拖拽倒是很好实现，但有方向锁定，自动回弹，复合点击判定、结束事件一类的，用库也要再封装一次，还要加新功能只暴露出需要使用的部分，更重要的是 css 的配合，又不想再引入个react-spring。如果是工作而不是个人博客，我倒是很情愿开发用库的。\n\n另外，看代码看到这一行时，笑了，好抽象，又带着一丝合理。\n\n\n\n\n\n\n\n","tags":[],"imgsmd":["![](https://cdn.jsdelivr.net/gh/NamiLing/upic/picgo/202311240640679.webp)"],"sourceFile":"002.md","csrIndex":[2,7]},{"id":"2023-11-21 00:57:14","content":"\n#工具 [BundlePhobia](https://bundlephobia.com/) 查看库的打包大小\n\n","tags":["工具"],"imgsmd":[],"sourceFile":"002.md","csrIndex":[2,8]},{"id":"2023-11-21 00:42:14","content":"\n大概是换了电脑，我很久没用过 logseq 的暗色模式，结果现在发现可真是……五彩斑斓的黑啊！我觉得是 dell 这屏幕的显色有问题。同一个色相调饱和度从绿色到紫色，数值调了 1 都看得出来……要准还是专业显示器或者苹果吧。不过果子不同产品线设备的色偏也是挺严重的（我觉得\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[2,9]}]