[{"id":"2021-11-03","content":"\n这两个月都不会关注开源项目了，也不会学新技术了。\n\n《被学术垃圾榨干的一生》\n\n（虽然这么说总是在倒 flag ，但这次真的不会了，私人时间我连电脑都没有）\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[22,0]},{"id":"2021-10-28","content":"\n关于之前想的分布式博客，发现已经有人做了。有一个项目叫 Solo，还一个叫 Pipe。\n\n不管是Solo是Pipe。都属于是分布式博客系统[B3log](https://ld246.com/article/1546941897596)的一部分，引用官网的话说是：\n\n- Solo 是独奏，[Solo](https://link.ld246.com/forward?goto=https%3A%2F%2Fb3log.org%2Fsolo) 也是独立博客系统，在音乐中相当于不同乐器演奏不同的声音\n- Rhythm 是节奏，用来让不同博客客户端和社区进行协同合奏，相当于音乐中的节拍\n- Symphony 是交响乐，[Symphony](https://link.ld246.com/forward?goto=https%3A%2F%2Fb3log.org%2Fsym) 以论坛的方式交互，聚合个人博客，需要很多人协同参与才能奏出美妙的乐章\n\n意思就是 Solo 是我们可以搭建/使用的博客程序。Symphony 是一个中心化的社区程序。Rhythm是在个人博客和社区之间通信的服务器。\n\n然后 [链滴](https://ld246.com/) 是一个基于 Symphony 的社区，可以在上面看到各个博客的推送。是否很像 feed 流？不过不同的是带有分类评论功能，还是更像社区。\n\n目前的问题还是推广起来太难了，虽然静态博客的生成已经不算是非常困难的事情了，但对于普通用户而言还是太麻烦，尤其是手机。而且博客端仍然以长文为主，评论系统也还没看接是哪里。社区上的设计总觉得有点十几年前的新浪博客社区文艺复兴的味道（只不过个人博客是自己的服务罢了）。\n\n------\n\n另外还想说说所见即所得的 [Vditor](https://github.com/Vanessa219/vditor)。最近用回了 notion，没法，笔记的迁移成本太高。但 UX 是真的香。下次吧。摸鱼太难了。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[22,1]},{"id":"2021-10-12","content":"\n忙了一个多月国庆回去放了下假，回来被说皮肤变好了整个人都白净了……可见工作对人的外貌影响……\n\n然后发现要做毕设几乎没有精力再做 Side Project 了，但真的还有很多想做和应该做的部分没有完成……然后技术文章也是堆着没看。在这之前科研的实验还得先跑。\n\n另外还有点别的想法，比如个人博客的形式感觉还是太老式严肃了，几乎被限定为“写长文和阅读长文比较方便”的媒介形式，对于短文字写起来负担太重，对于大量图片看起来麻烦，对于资源的收集与整理又过于死板，这大概是个人博客难以向大众推广的最重要原因。这个从上世纪遗留下来产物直到如今也没有什么大的变化，无法应对当今不断变化的媒介形式与需求，在这个时代看来从产品设计上就不够用。更通俗地说，就是当代产品把人的胃口养好了。如果要改，并不是多写几个 hexo 插件就能解决的。之前的 yilia 主题也在 hexo 中实现了相册，但比起当代新媒体的相册形式仍然缺乏灵活度和可扩展性。\n\n**不同的媒介一定要有合适的展示形式**。 File Manager 的进化就显示了这一点。在 Mac 上 Finder 有四种视图，对于文件的管理非常够用，尤其是 tree 那个层级的视图。但在大量图片的 preview 上依然不方便，其实可以更好一点的，参考一下 Edge2（尽管 Edge2 的视图上也还差个瀑布流）。\n\n社交媒体本可以由个人博客 + RSS 构成，从而达成去中心化，唯一的问题社交功能上，差个统一的评论系统以供 RSS 显示。这是 RSS 只能是一个阅读器的原因，关于评论互动无论怎样想不出一个去中心化的、适用于静态博客的、统一的解决方案。有后端的博客倒是好说，拓展一下 RSS 的格式就行了。之前的即刻机器人就挺好的， 添加 feed 到即刻评论，博客只管发布。但对于内容发布平台管得越来越严，尽管严格意义上 RSS 阅读器并不属于内容发布平台，想做个评论系统也可以根据博文生成标识符（比如来必力，其实带评论的 RSS 阅读器也最好就是这些评论系统来做……）\n\n睡觉睡觉，别想了，不是社畜有时间用爱发电的东西。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[22,2]},{"id":"2021-09-29 上午","content":"\nemmm，字节竟然面过了唉，之前也没有去实习所以是第一次面试。效率太高了。问题问得比较灵活，而且我是属于讲到熟悉或者感兴趣的东西会很能吹的人，导致我觉得我…………啊啊啊太抽象了。（反之不熟悉也不感兴趣的东西一个字也憋不出来）\n\n相对来说，美团就面得非常八股非常佛系，散发出一种“我们正常校招互联网白菜价”“我们正在完成面试的 KPI”的淡然。不管你说什么他都会按着八股走。\n\n然后，emmm，不知道诶，我也希望还是轻松点好，钱多事少离家近占个两样就很满意了。但我既讨厌墨守成规又讨厌卷。卷不是指加班，加班只是卷的一个副产物，卷是加班的是充分不必要条件。我讨厌的是卷的氛围。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[22,3]},{"id":"2021-07-07 晚上","content":"\n前端的内容终于勉强看完了（指到 React 为止）。\n\n我很早之前就想做前端，但一直被 JS 劝退，就没见过这么 ugly 的语言。然后也不习惯函数式编程，作为没事会去读别人代码的人，不得不说函数式的可读性相对于 OOP 真的太差了，再加上 JS 的设计，坑一大堆，又是动态的没有类型标注，函数被回调来回调去 IDE 参数提示也鸡肋，维系全靠文档，体验极差。\n\n还是想先自己写点项目再去找实习，然后找明年的春招。秋招是指望不上了，毕设也很难。论文一生的敌人。\n\n------\n\n家人今天在进行癌症的治疗。从上周五到现在我也很烦，人一不对劲就立刻强制自己听歌睡觉。能睡着，因为知道睡着会丧失掉一些记忆和感觉减轻一些痛苦。\n\n所有衣服的袖口都脏了。\n\n第 7 年。人生能有几个 7 年。\n\n不工作的人是我，骂自己的人也是我。朋友再说你其实挺强，感觉你都不用复习，你很喜欢钻研，我还是不觉得自己能找到工作。为什么呢，因为我不现实，我没有心。父母说我不干涉你了，我相信你，我觉得也是假的。你相信人是会无缘无故突然转变的吗。网友说其实你学啥都能学得不错，比他的一些学生好了，我问那我转你们那行吧，他说别来。然后专业的美院老师觉得我是个没有天赋的人。我觉得我也是个没有天赋的人。当有这方面天赋的时候人是不太正常的。 Ti 会画木头，Fi 讨厌画木头，所以我讨厌自己下笔只画木头。现在大概唯一有觉得自己天赋的只有乐感了吧……\n\n我不断学习，只是为了学习本身，只是为了逃避，我从中没有乐趣可言。像 m4ivt 说的那样，如果想开心地写程序，只会是写免费的让大家用，所有以盈利为最终目的的都给我滚开。\n\n如果表达自己也能获得认可，那就再好不过了。\n\n------\n\n仙剑1通关了。这么多年，还是个很好的游戏。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[22,4]},{"id":"2021-06-20 凌晨","content":"\n今天去央美看了看展。\n\n晚上走在无人的天桥上，看着不息的车流从脚下穿过，有点微风。突然开玩笑地说，要不就在这里大喊一句 jzszd 吧。\n\n朋友惊到了，说你喊吧，我给你录。然后我们就在天上录了一段此生可能都不会再做的中二的视频。\n\n（两个月后，我大喊的名字中的一个人，已经从全网消失了）\n\n晚上回去时心情很好，没注意何同学就在路边上拍视频，早知道上去合张影也好啊，算是留下一点我在这里生活过的痕迹。他就要毕业了，以后就抓不到野生的何同学了。\n\n6 年了。难以想象在相同的地方呆了 6 年。还有多少年。人生又有几个 6 年。\n\n从前好像很喜欢被关注，只要想有一百种吸引别人的方法，因为大部分人都是慕强而脆弱的，大部分都喜爱商品化的生产。近两年厌倦了成为这样的人，真是觉得从前不可理喻，一直致力于不要让任何人注意到我存在，厌倦了社会与关系，厌倦了被关注，不管是以打工人的形式还是以别人心目中的形式。没有人明白，没人能明白，没有人。\n\n两年前。\n\n> 我：“你画得真棒！可以给大家看了”\n> 雀：“为什么要给大家看，自己开心就好了呀”\n> 我：“别人看了开心也很好”\n\n现在。\n\n> 我：“为什么要给大家看，自己开心就好了呀”\n\n不知道那两个月改变了我什么，可以称之为突然的觉醒，一周之内没有了目标，没有欲望，随之而来是对世界无尽的感受，半年多看到任何好笑的事没有任何笑容，没有任何波动，神经性耳鸣，半夜 5 点睡觉，疯狂买不需要的东西， 花很多很多钱去画画。然后就再也回不去了。仿佛只要自己不被任何人需要，就能有理由让世界抹杀掉不需要的人了。\n\n需要，束缚，禁锢，绝对的自由，真是对立而无法统一的事。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[22,5]},{"id":"2021-06-13 凌晨","content":"\n除了身体不舒服，没有发生不开心的事，很好。\n\n> Here's plastic wounds for someday No more chemicals for you hurray Now here's 911 and 119 Whichever you like choose one of either of this\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[22,6]},{"id":"2021-06-02","content":"\n找不到地方吐槽了…………\n\n真的想大倒苦水，前端的环境是个什么玩意儿！是在考记忆力吧！！！\n\n浏览器本来是让人公开更容易地获取资源的，做啥 App。还不是因为 UI 框架不通用，不然至于搞成现在这样？\n\n然后就是JS的标准，不同的runtime适配，天知道我最开始学 JS 模块找了一个 ts 写的 node module，教程上说得极其简单。然后发现，不知道浏览器怎么用。先是编译成了ES3发现怎么这么像commonJS，浏览器对 require 是不支持的。然后用ES6的语法，couldn't find the module。我知道为什么有这个问题但不知道怎么才能解决。折腾了快一天，最后还是打包工具解决的。别提打包，我本来是在学习来着，打包全都打好了我还学个啥？\n\n还行，虽然烦，比纯写文章好。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[22,7]},{"id":"2021-05-15 凌晨","content":"\n说真的， 最近就是间歇性的，没有兴趣。\n\n一个本该是不撞南墙不回头的人，放弃了一切，落得一身的空虚。竟然还妄想让别人把他从前的一切还回来。凭什么？\n\n一直都明白自己倒底想要什么，可冲突了，放下了。不是自己的问题吗？是自己的问题吗？是不是自己的问题？回答我到底是不是！！\n\n「返せ！取り返せ！」\n\n蹲着，头埋在胳膊里，没有灯光。\n\n妈的时常觉得自己内心戏太多快疯了。快去找工作吧上天，我一个人呆着会出事。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[22,8]},{"id":"2021-05-10 凌晨","content":"\n累了。\n\n我运动了很多，喝水喝了很多，因为我平时不发动态，反正不会被相信。\n\n就是努力了很多很多，最终小心翼翼地拿出来夸夸自己，也不被相信，还被倒踩一脚，我讨厌这种事。\n\n终究是不合时宜的自我感动。\n\n我希望有人可以相信我说的话，我希望我可以感受到别人在相信我说的话。我希望下次能听到的是“你很有进步啊”，而不是“我不信”。我不想为了获取关系中的信任而着急，而扯谎吹牛，而勉强自己，这就是pua，除了斩断联系我毫无办法。\n\n我想听正常的说教而不要充斥任何上下级“权威”的关系。上次在超市，一个小孩偷吃生鲜有冰块吐了，他妈妈在旁边气炸了，一直骂，非常引人注目，揪着孩子耳朵边走边骂，从商场负一楼到商场外，我们走时还在骂。要说是教育没错，可我想，孩子吐了已经很难受了，肯定下次也知道了，有什么好骂的。真的只是教育吗，还是一种“不听家长指挥”的发泄？\n\n我明白无条件的相信与爱是不存在的。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[22,9]}]