[{"id":"2021-12-15","content":"\n真不知道，现在这个情况，是大家自己一手造就的，还是外界的干预。\n\n我也不能指望每个人都会去寻找方法，即便是手把手地告诉他们，还是会觉得麻烦，宁愿日日被夹也不愿意换其他可以规避的方法。流量变现模式很现代，也很畸形，会让人忘了天下没有免费的午餐，付出更多隐形的代价。\n\n在国内产品推广永远打不过免费的，愿意付费的人太小众了。一个室友天天上王者，看到我打独立游戏感觉挺好玩，一听付费就算了，“不是还有类似的免费的游戏吗，为什么这个要收费啊”。啊，免费的那个是腾讯的……然后想到上周浅墨跳楼的事件，今天政法大学教授 B 站直播间也被关停，真是对环境绝望……\n\n前几天打到 fgo2.3（没错三年了居然才开 2.3……），故事是发生在中国异闻带，从秦始皇开始魔改的故事，大体意思是，秦始皇为了营造一个没有战乱与痛苦的世界，在成功不老不死后，花了两千年，把所有人控制在蒙昧的状态，不允许人们启蒙、探索、好奇，不允许产生文字，不允许人们生病，一旦老去就会死去（因为老去是痛苦的）。自己以控制着物资的运转，成为类似人神的存在，是人们唯一的仰仗。那个世界没有战争、人们被杜绝了人类恶，一生在一个小小的地方自娱自乐，也谈不上压迫，文明亦无法进化（除了秦始皇本人和他冷冻了几千年的手下）……真是难以评价的一章。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[22,0]},{"id":"2021-12-02","content":"\nMac 的看图软件比较。\n\n\n我的需求主要是拿来看参考图，不是拿来管理照片的。所以需要一屏能看大量图，同时方便在不同的文件夹之间切换。同时ipad同步依靠webdav，所以需要能直接支持本地文件夹。上面的图不严谨仅供娱乐。\n\n- 看图（腾讯出品）：速度快，不用导入库，界面为图片裁切后的GridView，比较清爽。内存占用一般，200M 左右。支持日期地点搜索。\n- EdgeView2：速度非常快，可以查看本地文件，不用导入库。界面是图片原始比例的gridview，三栏布局。内存占用最小，60M左右。搜索和Finder一样依靠spotlight。值得一提的是这个软件对于看漫画（连续的图）做了很多优化，我怀疑开发者只是想在电脑上看扫描版漫画。\n- Lyn：速度 OK，不用导入库。内存占用一般，100M左右。没怎么用感觉没啥特别。\n- Picsee：功能多，多种视图支持瀑布流。支持从颜色筛选图，软件有库但不用导入，和本地文件夹双向同步。\n- Eagle：素材管理，图要导入软件库，鉴于我在ipad会用webdav同步看图，不满足需求。而且是electron……内存控制就算了，有原生竞品的情况下不考虑。\n- PicHome：服务器端的相册系统，映射目录到网页上，可以按颜色搜索。基于php和mysql。\n\n","tags":[],"imgsmd":["![Mac看图软件](https://cdn.jsdelivr.net/gh/NamiLing/upic/uPic/picview.png)"],"sourceFile":"001.md","csrIndex":[22,1]},{"id":"2021-11-30","content":"\n有一些社区聚合服务，我本来觉得，不能达成真正的去中心化，作用有限难以推广。不过现在觉得这么想也不对，价值在于反垄断。\n\n指路项目，链滴，Lemmy。前者聚合独立博客，后者为类似 reddit 的形式。土豆服务器社区好像很早之间有见过，但实在太独立了，和独立建站区别不大……\n\n目前用过还算比较中心化的大概是 zeronet……太占硬盘了。ipfs 还没有去了解。\n\n目前最大的购物需求是，换个硬盘大一点的电脑。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[22,2]},{"id":"2021-11-28","content":"\n回看过去那一段时间，简直就是杀人诛心。\n\n在关闭 ins 账号时，甚至有人大字报都准备好了，等着他自杀后起诉。\n\n我在那时补看了“霸王别姬”，心情就如同那时的程蝶衣。放如今，真是无法过审的片。\n\n至少活过他沉冤得雪之时，再去死吧。\n\n为了让自己情绪不要太影响工作，做了张新的壁纸。\n\n------\n\n我在关注的一个事件竟然有进展了，原来以为就会这样变成一个永远无法释怀的事。也因此发现了一位用爱发电的数分大佬。他的做了个 gitpage 来放他写的水军数据分析文章。在这之前，他放过知乎，后来无一例外被删除了。至于 CSDN 和简书，我投过知道肯定发不出去……之前 HLS 那一篇也没有过审。\n\n我总是和博客过不去，在博客里吹水，一个重要的原因是因为国内各种平台莫名其妙的审查。并不是写博客多有成就感，仅仅觉得，如果连正常的发言空间都没有，“伞兵”从此意思变成“傻逼”，“苹果好涩”从此变成“屁股好色”，这已不单是给 NLP 增加难度，文化迟早也会跟着衰落、倒退。\n\n网络空间不是法外之地。可我实在是没见到谁在现实生活中，谁说一句“我觉得不对劲”都能被封杀。即便公开演讲也是“有地方讲有人听”才够得成公开演讲。更加本质的问题是，**互联网天然开放，以现实中“公开发言”的形式去看待互联网上的每一句发言，这一模式本身就是不合理的**。有人说，“私聊不就好了吗”。私聊一样有审查，没遇到只能说明瓜不够大。我也仅仅遇到过一次，就是彭帅的事件。和朋友聊也得开本地局域网共享。\n\n另外，像“光遇”这样对于交流本身就很有限制的游戏，其信息传播的壁垒已经足够像现实世界了，依然要开一套十分奇特的言论过滤。当时国服出的时候，一大“乐趣”就是经常触发各种奇葩的关键词，比如“看下面”这句话违规，因为有“下面”……我真的，没办法，每次叫人看下面都要用英文。后面还是回国际服了，有时觉得语言障碍真是个好东西。\n\n并且在言论审核上，资本有很大的发言权。因为 IM 软件是企业做的，一个文件下来公司就关门，审查反而比实际上更加严格。更不用说有的资本有一些恩怨，在特定事件上甩锅审查也没人在意。妙就妙在，它不会让你以为是资本的操控，只会告诉你“这是大环境”。\n\n不吹了，想到再说。\n\n明年开始不会在 feed 流上吐槽了，大概网址也会换。先积累一些内容再说吧。\n\n《WebGL 编程指南》进度 70%。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[22,3]},{"id":"2021-11-21","content":"\n看着看着有重构博客的打算了嗯……但也是真的没时间啊……想做成一个可交互的、各种模块分离且可高度自定义的、内容可以完全由自己掌控（非简单 markdown parse）的。是我看到了一些别的博客受到了启发。开始需要会涉及到预渲染嗯……但还没有接触过相关的……\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[22,4]},{"id":"2021-11-20","content":"\n前几天也同时开始看《webGL 编程指南》，补一下 3D 渲染和动画相关的知识。\n\n看开头的时候，我觉得还是学了 GLSL SE 的基础知识再来看 webGL 比较快，或者直接在网上搜 WebGL 原理花几分钟看一看也可以。上来就接触 webGL API，最有疑问的不是 API，而是 GLSL SE 里的流程和数据类型。\n\n至于为什么没有直接看 Three.js……Three.js 做业务确实快，不过遇到渲染，我觉得还是尽量学得靠近底层比较好，之后还能上 wasm，JS 的效率会让我有一种想放弃它的冲动。如果不是因为历史原因浏览器长期使用JS跨平台，我大概率也是不会用 JS 的，如果能有选择，实在没有理由用 JS……过了这么久，依然是我心目中 ugly 榜首，ugly 到我要专门训练如何看懂 ugly。当然接受这一点之后写起来随便飞，不过看起来还是依然 ugly……\n\n看了 40%，现在感觉下一本应该看下 OpenGL……\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[22,5]},{"id":"2021-11-19","content":"\n开始看《简约至上》这本书，总体来说，就是在用户的角度看“如何简单”，而不是“冒充简单”。这个事情以文档的例子很容易说明。没有人会认为，一个文档十分详细的开源库就意味着简单。同理，说明书写得尽量简单的产品也不意味真的简单。\n\n个人会更偏激一点，认为真正的简单是不需要任何的说明与引导就能使用。有的人喜欢在初次打开 App 时做引导。我不喜欢这种做法，因为我不知道这个引导过程有多长（事实上通常都很长并且无趣），这像是在逼我学习一样，而我仅仅是想马上使用它。这样的简单也很难达成。\n\n因此再说回无代码，我还是持中立的态度。当然我是以程序员的立场，认为使用自然语言编写一些简单程序已经足够简单。编程对于普通人最大的门槛，一个是开发环境，一个是语言障碍，三是编程模式（不过面向过程这种线性思维的编程也不用怎么学……）。用自然语言描述逻辑上，现代的编程语言有足够的优点，这也是为什么python被认为是大众最容易入门的编程语言。而无代码所做的可视化，如果不限定场景与需求，相当于发明一种全新的编程语言，即便是可视化的，也不意味着就是简单的用户可接受的。能带来的效益如何很难说。\n\n在阮一峰的科技周刊上看到过一个字母 b 开头的无代码网页制作的工具，当时刚融资了好像是三千万，于是花了大约 30 分钟试用它，跟着引导走了 2 两个非常长的教程……这已经足以说明问题了。需要如此长的教程才能做出一个特定情况下界面勉强可用的东西，事件绑定时的交互看得我也一脸懵逼，即便我具备前端相关概念，也无法立刻理解它绑定的变量从何而来。最后的成品是一个纯展示性质的界面，界面尺寸未适应，画布上的元素对齐也非常困难。如果是我，我宁愿花钱请程序员帮我做这个网页，又快又靠谱，而不是找个一般人用这个工具花很长时间做出个勉强能用东西。总体来说感受就是\n\n- 逻辑上没有被简化，因此尽管是可视化的工具，依然非常复杂\n- 无代码编程的技能只适用于这一个可视化系统。当然我相信花足够的时间，也能用它做出基本满足商业需求的东西。但一旦脱离这个系统，我又将从头学起，就像学习一门外语一样。\n- 无代码的东西满足的需求有限，难以胜任各种定制化，尤其是 toC 的交互。\n\n相对的则是一般的编程语言，许多语言都有着共通的概念，并不会因为仅仅因为换一种语言而难以继续。Go 是一个很好的例子，它是一门设计尽量简洁的语言，没人会因为从 int num 变成 num int 而认为这门语言难学。\n\n换到任何其它有可视化的生产软件的领域，转移技能的开销将比换编程语言大得多——我是指入门，精通任何一个语言都不是一件简单的事情。比如 Photoshop 与 Illustrator，这已经是同一家公司出的软件了，领域都是插图的编辑与绘图，只不过一个是位图一个是矢量图。我用了十年的 PS，核心的那些已经算是非常熟悉了。但换到 AI 时仍然花了我接近 5 个小时去入门其对形状的处理操作（这仅仅是基础的逻辑）。因为对矢量图的编辑还是与位图有所不同，需要人去理解计算机的一些逻辑，理解形状切割、扩展等等。\n\n但具有相同可视化逻辑的软件，开销会小不少。继续使用位图编辑为例子，iPad 上的 Art studio 与 PS 界面和用法几乎一致，可以无差别上手。但 Procreate 就一些需要额外的学习成本。不过值得一提的是 Procreate 的交互非常之好，从零开始的学习成本低很多，就像 Java 程序员转 Go 一样。而如果你从 Procreate 的逻辑去学 PS，大概就是 python(3.7以下版本) 程序员转 C++ 的感觉。\n\n也因此，在各行各业可视化的软件上容易产生垄断。《浪潮之巅》中说软件的垄断是因为软件的复制成本低下，仅仅需要投入研发的成本，增大用户量即可带来收入，这是从商业的角度。从用户的角度看，垄断是因为再次学习的成本与内容迁移成本太大。如果没有学习成本与迁移成本自然是哪个好用/宣传多换哪个。你看，哪个静态博客系统谁能垄断，完全没有再次学习的成本与内容迁移成本，后起之秀只要好用立刻就上来了……\n\n所以说，无代码/低代码/可视化上，想要能持续投入生产，一是真的很简单不需要学习就可以上手（这点是最难的），二是有一套统一的规范、平台，三是垄断，使用自身的影响力做平台与规范。个人目前想到的是以上三点。\n\n诶我应该是在看书的来着……简单这个事还是看受众的。这本书讲的是面向普通用户。\n\n（还是滚去多看书不要半斤八两地吹水沝淼……）\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[22,6]},{"id":"2021-11-16","content":"\n好的工程：\n\n- 代码良好的可重用与可复用性\n- 有合理易懂的抽象结构，减少依赖\n- 模块内高内聚，模块间低耦合\n- 易于扩展，减少修改\n\n总体就是，是要给人看的，是要给人合作的，是尽量好用又少出 Bug 的，是能在提高总体上提升效率减少工作时间的。\n\n“好”的学术：\n\n- 论文写得花里胡哨，显得工作量多\n- 论文写得花里胡哨，显得有创新\n- 论文写得花里胡哨，显得有实用价值\n\n（没有说所有做学术的都是这样的意思）\n\n从头开始对搞（某些）学术的没什么好感。与其想半天在那凑创新点不如直接去市场上找一个需求？人要是没需求想不出问题哪来的创新？不对一个领域有足够深刻的了解哪来的创新？哪有那么多创新？\n\n倒希望能出现一个改变我的偏见的人。\n\n------\n\n对于无代码我个人持观望态度，实在无法确定能带来的效益能有多大，也很可能是 100% 的工作量解决 5% 的工作效率。因为编程的门槛不是使用代码本身，而是编程的逻辑。如果简化了逻辑，势必会限制一定的使用场景，不会是通用的。\n\n打个比方，双链的笔记逻辑处理不好结构化的内容，在整体知识架构和条理上就不如传统树形结构，需要自我脑内整理，也不便于多人共享，很容易乱。而树形结构的笔记用起来心智负担重，优先考虑的不是内容而是分类，分类太多后用起来就麻烦。所以大分类+小标签是一个折中的方案，但标签写多了又经常会有同义、近义的标签，结构还是又乱了……总之结构化和灵活性之间就得选一个。\n\n如果又想要双链又想要树形……那这就很考用户的水平了，要怎么去用比较好呢……？\n\n至于代码，是绝对支持结构化的。需要多人协作的工作没个规范和流程，会死。不过相应的结构也不能设计地太紧太死。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[22,7]},{"id":"2021-11-11","content":"\n**近期轶事**\n\n简述：一个学长，网恋被“女友”骗了。\n\n详述：一个学长女朋友闹分手，遂与同学咨询之。其女友，网线之交，北师在读，未闻未见，仅存画像。每至兴时，以“哥哥”相称，曰“哥哥我难受”。余闻之，奇道：“其人莫不为男？”\n\n近日细细寻之，查断欺佞之人是也，男女未知。学长三观已崩，近日勿言。\n\n------\n\n**今日导师语录**\n\n导师：让你发的 tripple ai 呢，这个进度，连 C 会都（小声）发不了。\n\n学妹：我觉得我可以，我比 C 会那些做得好。\n\n导师：你要是成天看那天屎文（指 C 类文章），只能比他们学得更烂。\n\n------\n\n大晚上狠狠emo了。呆在学校生产自己都看不下去的学术垃圾，不断被学术垃圾降低对系统、对技术、对工作的敏感度，对想钻研的领域毫无提升，纯粹的浪费时间。\n\nxqq 是因为太厉害了，对本科写那些无用的报告做无用的作业感到浪费生命。我是因为完全脱离自己的原本想学习的领域而觉得浪费生命。\n\n大四时 fhw 就劝过我去国外转游戏开发，当然如果去了我现在可能会因为疫情的机票破产……不当时既不太了解游戏也对图形学一无所知。还有一点重要的是当时 mac 太菜了，U3D 很早之前下了一次由于运行不起来而放弃了，后面因为想给人类一败涂地做地图又下了一次，还是卡炸……这说明不要为了屏幕好看而买 Mac……总之几乎放弃做 3D 图形渲染、特效合成类的工作都是因为电脑。几乎只有 blender 的纯建模还 OK，渲染也……我特别喜欢玩 MC，但是也因为渲染太辣鸡的关系坚持不久。因为 MC 的不（尤其后期）自动化严重依赖挂机（不然就太肝了），没法长期放后台。不要提基岩版这种存档不通用没 shader 和 mod 的版本……现在成为了所谓的 MC 云玩家，1.17 的正常配置我已经没法开了，渲染 20 帧超级烫……\n\n为什么不买新电脑……因为不管是哪个版本的 mac（除了尚未稳定的 M1），渲染性能都是渣渣。为什么不用 windows？还是 mac 的开发环境方便……为什么不买两个电脑？emm 我放哪？\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[22,8]},{"id":"2021-11-05","content":"\n又想写一个没有太多实际作用的、非常行为艺术的项目了……\n\n没有时间啊没有时间，要不还是延期一年再找工作好了……只要导师别push，一切都好说好说还能写写别的\n\n真的不太愿意写算法……有些领域真的不明白有啥用啊……而且他们只看 paper 不落地的。背后这几个师兄在这叭叭叭的，说导师不关注技术只画饼提些乱七八糟的要求，而且说话也不听重复早就说过的问题。我真的不明白人到这个年纪咋就这么自信了？之前也是，开个多模态对话系统，说真的我给你开个题很简单了，你把图像特征凑上去就是了……exm？你不考虑是开放域对话还是垂直领域对话？垂直领域对话你不考虑边缘知识？多模态你不考虑怎么融合表征？ CV 要怎么表征怎么训练怎么改进？我是找到了代码和数据集也能跑没错，反正现在又换方向了，因为我说多模态有点难做，所以换 NLP sentiment analysis了，说这个我感觉比你现在的要简单，你做个分类就好了……什么鬼啊？做主观分类就能毕业要咋找创新点啊？然后一堆做迁移学习域自适应的模型……这又很简单吗？“最后你随便找个一个模型跑，总行吧，网上那么多代码”尼玛啊我自己的论文不按论文写随便跑一个模型你逗我吗？真的真的是讨厌空口画饼的，这么多年了没有自己独立实现过哪怕任何一个小项目（学术型不要求代码），完全不知道实现上的困难，还张口就是“你要是说不清问题，把实验数据给我，把代码给我也没有用”。合着十几年的科研生涯就学会了怎么当一个产品经理？啊不，产品经理是高抬了，产品经理也是要看产品的。（没有看不起产品经理的意思只是作为一个乙方的 stereotype）\n\n对于我自已，首先，如果一个概念做不到完全的透明（即不了解下层的实现也完全不妨碍上层的理解），那继续下去非常困难。我能明白的东西一定是明白怎么写的。\n\n“一天一个变，哇我受不了，今天一讨论跟他讨论一个月前的东西，气死我了”来自背后的师兄。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[22,9]}]