[{"id":"2025-03-14 12:49:19","content":"\n然后说又看到了[阮一峰说低代码状态](https://www.ruanyifeng.com/blog/2025/03/weekly-issue-341.html)了……嗯，鄙人2021年的 memo 也在大骂低代码（并不算）现在看来很多地方举例非常不恰当，显得很肤浅，但核心来说还是同样的，UI 重要的地方不是 UI 而是逻辑……有固定工作流的中台也许是可以的，需求是确定的，但这东西不要 toC，to 不了 C，to B 也不行，要 to 只能 to 有特定需求的程序员。即便游戏的程序还挺喜欢可视化的编辑的，这么说来 Unity Component 何尝不算一种低代码……给足够的 Component 游戏程序员还是死不了，天天查有没有人造过这个轮子，这个轮子要怎么结合项目，最后看完感觉不如自己纯代码手写一个……复杂的是业务逻辑，不是拖个 UI 本身。\n\n哦对了，Unity 里有个地方低代码是算是应用比较成功的…… shader graph，这就算是有固定工作流、非常特定场景的应用，不过我保证没有图形学基础还是一脸懵，以及，这东西能成功应用的还在于 HLSL 这门语言本身不够直观，把定义、指令、渲染流程混在一起了。UE 的蓝图，也是被评价为“能做那种模板的开放世界游戏，但稍微想做点不一样的就得自己写代码”。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,0]},{"id":"2025-03-14 12:08:06","content":"\n前天真的要被气死了出门找自习室了。从来都是这样的套路：“我中午约了一个哥哥，你要去吗”“你以为是来看你论文的吗”。\n\n我还记得几年前要我背电脑参观一下一个跟风搞 AI大模型 的初创公司的工位，先是骗我只吃饭，然后骗我参观工位，最后变成了我在会议室连着自己电脑上答辩一样讲破毕设到10点。然后他说，还行，我就觉得这公司技术水平要完蛋……但我能说啥我只能说 AI 是风口拿到投资很有前途……难道要我说你们公司定位到大模型训练要是觉得我还行那就会被同行卷死吗……\n\n不过有没有前途都和我没关系了，他们有钱拿就可以了反正几年内也饿不死履历也好看也算是人生赢家了。但我是不会再信任何“你以为是去讲论文”的鬼话了。我论文不知道被他们拿去给多少“专家”看过了，解决个鬼，都不是一行的，我还得再讲一次又一次，我每讲一次都是折磨，我思考论文本身就是折磨，不用开始做想到要写就觉得无法做任何事了。\n\n一说工作就是我学的东西都是没意义的，学了几年也没见你找工作。这事我也吐槽过很多次了，不想再槽了，只会宏观套上填鸭式大道理的人是这样的，就好比律师一小时的挂牌咨询费一千，他们大概会觉得这律师一个月能赚72万。\n\n逼我和导师发没完成的论文，我实在想不出写什么，问她，首先叹气：“哎呀”，这是一个卖惨的前兆，“老师，你看我实在写不出来了，你看能不能帮我完善一下”……我听着就无语，要是导师我特么最烦这种人了，自己没有尝试过各种方案，说一句不会写就甩给别人。\n\n当然她控制别人的手段大概也就是常见的卖惨和道德绑架。比如，她想让我提东西，就以半开玩笑式语气说你都没有点孝心都不主动帮你妈提东西。同学请吃饭时在公司只能刷公司卡，同学买单了，她就是你事先都没有想到带点礼物啊（我草我是想到了的但到底是谁睡到4点半最后还迟到了半小时的，我从来没有主动责怪她过）。她想睡觉了，所以想让我睡觉就是，“做事不要没有个节制”。十几年都是同样的车辘轳话术，从来不思考背后有效或没效的原因是什么，有效是理所应当，没效就是我不听话罢了，要不就是我叛逆，要不就是我恨她。我一个（疑似） ADHD 做什么事都是非常容易被打断成无法进入的状态，即便打游戏这种事也只能是全神贯注，然后就变成了我沉迷游戏……沉迷画画还沉迷音乐。怎么没说我沉迷写代码沉迷工作？因为又回到了上面，我写的代码在她口中是无意义的，她传播她的焦虑却对此造成的心理问题不带来任何解决办法。我讨厌卖惨的和人身攻击，我也无法理解利用撒娇控制他人的人。\n\n\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,1]},{"id":"2025-03-05 23:37:13","content":"\n刚打了个电话很伤心……想打开写一下，但现在又懒得写了，一个时间点过去就过去了，不想状态再持续了。现在也无法持续很久了，太好了。\n……我刚又给雀打了一遍，复制过来好了。\n\n> 刚刚我妈打，电话。她要过来住。订机票时一直有绑定服务，不会取消。我让她打视频，她也不打。她点烦了说那就多被坑几十块钱，也不打。然后就无画面干说，说好久也不会取消绑定。\n>\n> 然后她就想甩一边，让我全自动帮她订。我说让她打视频。她生气了，说老子不来了，不订了。\n>\n> 因为，自从我上大学开始，她就没有网购过，所有网上的东西都是能让我买让我买，自己感觉麻烦。我可以花一天教，但不想她自己随便找个理由就甩我了，才 50 多岁就各种不会了，越来越脱节。\n>\n> 机票也是，开始都是直接让我买，我跟她说你去支付宝买，她说那些网站又要让人下App，我说不会的，支付宝你搜了就能买。然后就是今天了，她点了半小时不会，就生气了，怪我不给她买，让我做个什么事都麻烦和我爸一个德行。\n>\n> 好累。好像是我不做全自动网购代理她就无法出行了一样。让她拿我爸手机打视频也不拿，说我爸在睡觉。然后我说他睡觉你就不能拿他手机了吗，才去拿了。\n>\n> 然后2分钟就买完了……\n\n雀的回复：\n\n> 不一定是学不会，是她知道她学会了之后她就不能操纵你了。\n>\n> 而且她说喊你爸爸喊不动，就把那一部分的情感转移到你身上了，你是她一部分的精神老公，这一点我妈也是。\n>\n> （我：为何都喜欢，喊来喊去……啊！）\n>\n> 自身价值不够所以想要掌控什么以获得成就感，掌控不了的时候就会气急败坏。\n>\n> 改变不了，只能麻木地兼容。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,2]},{"id":"2025-03-02 01:16:31","content":"\n因为对论文没有兴趣，所以注意力进不去。因为注意力进不去，一下午都在看一段，而且会拒绝思考里面的逻辑。下次看的时候全部忘掉。所以就，好久都在看一段。\n\n我没法对写论文有兴趣。如果是对做什么东西有兴趣需要看论文，是可以看的。如果做了什么觉得还不错的东西写论文，也是可以写的。唯独写不了纯屎。\n\n如果我有兴趣，那我可能很久都在沉迷纯看论文。然后就会被质问，不知道我在干些什么，也不找人交流（特指线下社交），只会闭门造车。这个情况也会使我痛苦，似乎对事物感兴趣本身都是错误的。然后我不想再对任何东西产生兴趣了。\n\n“你就这样，天天被游戏玩。不是你玩游戏，是游戏玩你。”这是我妈常常说的一句话，只要有孩子在打游戏就说。逻辑本身是错的吗？本身可以说是对的也可以说是错的。“玩” 与 “喜欢” 最终是双向选择的事，游戏筛选玩家，玩家选择游戏。但我妈故意采用了“不是你杀他，就是他杀你的”的表述，所有的事情仿佛都是零和博弈。\n\n我讨厌这样的说法，我不明白这算是零和博弈，我只是本能的讨厌。怎么只有杀与被杀。各种作品会有喜欢“只有杀与被杀”的世界观？那是因为这是原始的恐惧，但可以从中看到除了“你死我亡”以外的感情，或者杀与被杀之外的道路。我讨厌只有争强好胜、把别人踩在脚下并以此为耀的人与叙事。\n\n虽然没有人和钱，很多事无法做，但通常逻辑是，你有想做到的事，才想方法挣钱。但现在的逻辑是，怕以后做不到而现在强迫自己做能力之外的事。这是恐惧驱动。\n\n是的，我妈非常喜欢恐惧驱动。她说“游戏玩你”，也是让你建立“因为一无所知所以被游戏玩了”的恐惧。她自己可能察觉不到，但所有事情都是这样的叙事。“现在不结婚是怕以后找不到优质单身的人，统计上就是这样的” “让你写是为了以后你啥也干不了是有文凭保底”。我太熟悉了，我知道这是恐惧驱动，但就是这么个成长环境已经习惯这种思维模式，不敢乱丢什么东西因为怕“万一要用到”，吃饭是怕“万一得胃病”。我被面试时感觉问了 HR 一万个公司怎么活下去问题，我也被传染了过度担忧。谨慎通常来说不是大问题，但会极大降低幸福感，看事情总是看到最坏最麻烦的一面，让人做什么都畏首畏脚。\n\n我不想分析，分析着心情很糟糕。逻辑可以改变，但感受过的情绪永远都会在。总之就这样吧。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,3]},{"id":"2025-03-01 00:59:59","content":"\n……只要开始看论文，一切事情都变得有趣了起来。\n\n昨天看论文，然后给 paperlib 写了个插件。嗯，只是无聊的复制文件链接，也很有趣的咧……\n\npaperlib 代码架构、设计、文档如此工整像有强迫症一样深得我心……要说问题可能还是传统这套生命周期+事件机制解耦的写法，解多了就得跳类型体操吧…… anyway 不重要，在前司最大的感想就是先别管这么多细节，理解了思路糊出来再说……\n\n三天不打游戏（2月29日，2月30日，2月31日）挑战，瞬间结束。不过我也真的是不太打就是了，不好玩。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,4]},{"id":"2025-02-26 05:55:55","content":"\n今天，努力早点睡，但不行。非常后悔看剧，我真的不能看，ADHD特有的出状态慢。然后从剧中开始胡思乱想了……以及还吃得超辣。但做了很多家务。我得想好明天要干什么。主要是吃早饭，然后看论文，然后晚上问问紫紫她在哪找她吃饭。然后，我不知道，我在想要不去雨疏家一起住几天，白天回我家上班……好神经病的想法。\n\n哦播客，昨天晚上的好像没听完。面包的那期也发出现了还没有听。那随便放一个睡觉吧。打败胡思乱想的方法，只有更无聊的胡思乱想，花半小时到一小时强行切换 context……\n\n……面包为什么录出来好严重的气泡音，实际听起来就还好啊，怪全损音质收音。\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,5]},{"id":"2025-02-25 23:08","content":"\n今天醒得特别特别晚，然后重度拖延。直到我把电脑从桌上拆下来，打开 b 站看 ADHD 拖延的视频……小宇宙自习室也有两个姐姐在讲高效能人士的七个习惯的内容……然后我在想，我要干嘛，我为什么拖延。启动慢和任务分解太细确实相关，一个洗澡被我分解成了十几个步骤。\n\n（我是注意力缺陷类型，表现为难以专注或过度专注，这两个其实是一回事。没有多动症状。）\n\n我想用另一种方式解决，说起来非常简单，就是 just do it。但对于ADHD而言，如果不事先计划，可能会疯狂遗忘东西，因为过度专注（或过度分散）。我小时候就是一个总是遗忘细节的人，经常不知道把东西丢在哪里去了，当时启动一件事情还没有现在那么难。现在我已经不太会丢东西了，启动事情也更难了，每件事情之前都必须得想得很清楚或者写下来，要把什么细节强调出来以免遗忘。但在学校的时候，还是会有因为过度专注思考一些事情，去澡堂时毛巾校园卡换洗衣服全都没带，提着个沐浴用品篮子就走了。\n\n然后醒来是我也不知道我要干什么，因为事情被分解太多了全是琐事，从叠被子到收拾屋子到倒垃圾到洗脸漱口到准备吃饭，太多了，非常困难。如果我带着轻松的感觉直奔某一件，那一定会忘掉其他的事情——我在写这里时才想起来，我没有漱口，也没有洗脸。每一件日常的事都不是日常，习惯在ADHD 的过度专注面前很难形成，一切都是任务。我得吃饭了，别写了。\n\n上班的时候因为脑子里只有上班和休息，导致我无法顾及屋子，在回家之前收拾了七八个小时。这可能和ADHD的完美主义又有一定的关系，很多人不收拾没什么感觉，但我是真的不太能忍受屋子乱（会让心情不好），特别是放一些多余的无用的垃圾。我突然忘了我要写什么了，那我去干别的了。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,6]},{"id":"2025-02-25 05:09:32","content":"\n22日，23日，都重复着同样超晚睡超晚起的 pattern。\n\n机器员非常不懈地提醒我看论文，我终于看了。非常难的。我还是很难看下去，看一句歇10分钟。就这么不摸鱼的3小时了，只看了个 related works……\n\n真的非常难。\n\n然后我试着集中注意力，看三四年前没能看下去的 动手深度学习的代码。当时是感觉，理清概念就花费了所有的注意力，因为有超快看完的需求。代码一点没管，jupyter 也很难用。\n\n但今天我努力试着让自己，不要在乎视觉，不要在乎排版，不要在乎补全，不要在乎类型全是 any，不要在乎 API 要一个查，就像刚开始学一样一点一点看，很复杂的数学公式怎么对应上矩阵乘法的，怎么广播的怎么重复的，好像也没有那么难理解。看来之前难在我对工具的好用程度太挑剔了……以及没有耐心。有耐心的话一小章课弄清代码就要两个小时……差不多全神贯注也要看半天吧……实在太慢了，毕竟近百个小章……等我全部弄懂再开始写不知道猴年马月了，没有那么多的时间……\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,7]},{"id":"2025-02-21 23:55:59","content":"\n今天不想记录每日了，这意味着很糟糕。这种糟糕来源于逻辑的预期。如果一个事情还存在未知的可能，那没有那么糟糕。但当主要变量都确定了，只能通往坏结局，却各种原因不得不浪费时间去走坏结局，来获取一点点卑微改变。\n\n已知，我的动力是兴趣驱动，当然我对兴趣定义很广泛，通俗说是，我想完成它，不管是主动还是外界原因。高中上课很累，但我会想完成它。早八点坐一个半小时去公司很痛苦，我也想完成它。爱好就不用提了，兴趣驱使的动力非常大。\n\n兴趣就是我动力的小水车。我没有做成过任何我没兴趣做的事。有人会说上班很辛苦，我也不想上班，但还是上了呀。但在我的解释中，你还能上并且能持续，说明上这个班你是有兴趣的，是想完成的，不管是为了钱，还是为了什么。\n\n这样的主人公意识能解决很多纠结，但当如何推理发现都是坏结局时，会感到很无力。\n\n已知，缝5篇论文至少需要精读5篇。已知，我对论文没有兴趣。在论文鼓励师的作用下可以勉强硬读，最高效率为两天精读一篇。\n\n已知，进度检查为两天一次，ddl为一周，我要如何做到一周内精读五篇论文，并且逻辑通顺的用到我自己的论文上呢？那五篇论文就一定是精准的吗，有没有有可能其实要看10篇20篇？\n\n前两天能看是因为没人给ddl，但有ddl后我觉得这个推理已经没有什么可以推翻的了，我只想摆烂。能够完成的ddl是动力，完不成的ddl是死局。\n\n那你不会早点看吗？我离职的时候家里一直问下个工作找什么啊！你是不是不工作了啊！你做个人项目要多久啊！论文要看多久啊！恨不得一天做完项目，一天写完论文，一天准备好面试内容，马上开始找工作。哦不，他们根本不知道找工作需要准备，还以为找工作都不需要自己提前动脑子，去了找“师傅”带。\n\n是这样的ADHD没法多线程做事的。就我坐车坐过站的频率、状态拖延的严重程度而言，是ADHD没跑。但我一直不觉得这是坏事，只是一种思维模式。但是绝对应付不了这种需要同时三开或者四开的情况的。\n\n这不是说锻炼锻炼就能改变的，非常明显的在想事情的时候没有办法听见，和人聊天的时候没有办法吃饭，看电视的时候也会无法吃饭。我能做的也是只有把时间排开，排不开就是死局。\n\n大多数人并没有办法影响我自己的决定，尽管我会附和，成年人没有谁改变得了谁。但是家人除外，我越来越发现他们真的什么忙都帮不了，又喜欢提大道理的建议，给一些逆天ddl。比项目经理还急一万倍。\n\n然后我做得快的事情反而是没有ddl，而是我觉得我能做出的。要正确鼓励三水，必须是先建立兴趣和做得出来的信心，这种明明知道这么短时间做不出来还硬做的经历，我不想再要了。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,8]},{"id":"2025-02-20 23:59:59","content":"\n📅 今天：下午和面包包在星巴克，我继续看论文了，终于看完了昨天的框架优化性质的论文，吃吃饭。面包很 Nice，但不要送我这么贵的东西，感觉如果我真的是个小骗子（指骗一小笔但不至于让人破产的骗子）那面包会被骗了…… \n\n我大概会以什么理由让你看到这里，如果你看到了，我有个小小的希望——你不要把自己情况对什么人都说哦，特别刚认识几天的，包括我（尽管我双手我真的是老实人）。感觉有点点危险，如果是别人，在知道你的成长经历情况下，也许会针对你的情况调整相处方式来欺骗你的哦。因为当 KOL 的话，在我视角看来，接触你的人容易没那么纯粹，即便一般情况下是好人，在名声与钱面前也可能选择隐藏自己的一部分，这个部分很可能是你不喜欢的，因为他/她能够猜出你的喜好。尽管时间久了一定看得出来，但不要等没看出来时就被骗啦！\n\n但 KOL 的身份对于你创业来说是好事，加油加油！\n\n另外，项链我会收好的，很谢谢你，特地留下东西作为朋友的见证，但也已经超出了我应得的范畴。有机会回个礼吧，嗯，所以先找工作。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,9]}]