[{"id":"2025-04-28 03:19:26","content":"\n快乐不是来源于多能把东西做得多方便，而是来自于“居然这么东西还能这么做的”的好奇。\n\n换个人的话……快乐不是来源于东西本身有多美，而是来源于发现美的眼睛（好土）。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,0]},{"id":"2025-04-18 22:12:23","content":"\n本来想发长文那边，但最终还是太过于自我与情绪化了，也没了修改的力气，算了。\n\n---\n\n> 我原以为大家都是这样，原来只有我是这样\n\n\n\n1\n\n时间是家里聚餐后正在清理与洗碗。很多人在客厅里来来往往，非常无所事事地吵闹。两只猫早已习惯自己的领地突然涌入十几号仆从，瘫在猫抓板上眯眼睡觉。偶尔人类来逗他，眼角的肌肉勉强一动，以示朕已阅。直到有人拿着猫条叫着 “来来来”，嗖地尊座下蹿下来。\n\n好吵，非常吵。一如既往地坐在电脑前，随便打开一个文档。嗯，今天一定要看完！\n\n不一会儿人们渐渐走光了。我出去说了声再见，然后继续回到房间专注。有人羡慕心流，说我画画时像陷入了心流。然而，于我而言这是日常，甚至画画远不如编程、阅读的专注度。大概普遍印象中，画画的人总是给人岁月静好的感受。一旦人的行为沾上了一点艺术气息，就会变得神圣、不可打断与亵渎。但倘若看到你在画二次元，又会令人感到亲近，有人会友好地询问我在画什么，有人则直言不讳地说是幼稚。为了不被打断专注，保留一点所谓的艺术气息是必要的。\n\n可惜我没有那么艺术，我只是在看文档，最普遍的、常人看不懂的、只知消耗巨量脑力，需要放松的工作。事实上我不需要放松，我的目光与思绪无法从屏幕上挪开，仿佛一旦挪开就会掉链子，我渴望更多的，更完整的逻辑。若此刻被打断思绪，就如同电视剧的最终悬念揭晓前突然被老师叫起来罚站。\n\n此时我隐隐约约听到了脚步声。我一边强行维护着专注，一边用微弱的本能祈祷着，不要来推我的门，不要来推我的门，不要来推我的门。\n\n过了一会儿，脚步声渐远，我那微弱的本能松了一口气，把这次的小小分心忘掉了，无事发生。\n\n当下一轮越来越近脚步声响起，我明白之后会发生什么。\n\n门把手转动的吱嘎声音，把手转到底时门的活塞与木质的结构撞击声音，然后是木门被突然推开时，整个房间的气压微弱的升高，带起了一阵风，四扇塑料窗子在耳朵哐啷地轰鸣，似乎连带着整个墙体的共振。整个小小的空间，上演了一出 jump scare，扰乱了房间的气流，也打断了我的心流。\n\n我顷刻间变得无比厌烦。我没有表现，我仍然想专注，可事实上此时我已经无法边看边思考了。我只是非常厌烦带来了这一切中断的人。有人可能会觉得你房间是不是质量太差？不是的，这是一般的框架结构房屋，钢筋的牵拉具有良好的抗震功效。普通的开门在别人看来是平平无奇的，但对于此时的我，一切细节在经历数次后都被放大，是空间的打破，是对已知未来的预测，是对预测之事的厌恶。\n\n房间门口出现了不可忽视的身影。她可能直接进来，不管我做的一切，想和我进行一场严肃的对话。或者是带着水果，然后问你在干什么。尽管我做什么其实并不重要，她只是随口一问。我还要把这些她听不懂的东西试图用她能听懂的语言概括，亦感到无比厌烦。如果她真的有求知欲，那是值得费一番功夫分享的。事实是她并不想费脑子理解我做的具体事物，她只是随口一问，想知道我在干什么，想掌握我在干什么。\n\n我等着她下一句开口说的话。但这次她没有说话，瞟了一眼我的屏幕，盯了一会儿，离去了。没有关门。\n\n但从前太多次的厌烦已经深入人心，无法被消解了。门窗的轰鸣亦是这样，无法消解。\n\n\n\n2\n\n如果她进门，真的让我聊我做的具体事物时，那可能更加糟糕。这就是“严肃的对话”场景。又会拐到更宏观的存在主义话题上，说服我自己做的一切都是没有价值的，或者是她看不到价值的，摧毁我原有的信念。信念是强大的，不易被轻易摧毁的。\n\n此刻我有些不想再回忆了，上述场景有轻度 PTSD。我很长时间都不认为这是 PTSD，直到我发现一旦回忆就会开始哭泣，尽管我没有任何想法，我的脑子一片空白只是在哭。我没有用逻辑去思考为什么哭和有没有必要哭，这这反应是几秒内瞬发的，超越了逻辑本身，等有逻辑时已经结束了。\n\n然而这一切都源于我想有逻辑地回复每一句话。已读乱回，做不到。\n\n她看了很多爹味短视频，都是三言两语不深入的大道理，任何场景都能套用同一套说辞，加上她自以为的假设，形成逻辑闭环，百战百胜。我能背下来了，我能复述她那不断重复的大道理。要说道理有没有缺陷，有，只重视概率上的因果而无视信念。她至今也无法理解或利用特质，又或者应该叫“个性”，这个脱离她掌控令她恐惧的词。\n\n但我并不想在辩论赛获胜，我只是想解决具体的问题。\n\n\n\n3\n\n有时会是猫猫抓门，猫猫的抓门很有礼貌，猫猫不会轰地开门。猫猫很直白地一本正经地蹲在旁边跃跃欲试，表示想趴在我身上，等着我的反馈。我很开心，总是让猫猫上身。尽管被打断了，也非常开心。\n\n\n\n4\n\n有人说一看你的家庭情感挺好的。不是，那也是我贯于伪装，电视剧里有那么多健康、日常的家庭关系可以参考。每个人都有伪装，因为社会实质上依就无法容纳有太多特质或者特殊经历的人——至少表现上如此。这不是人的问题，而是社会的分工是本就是一种机器。机器的一环如果出错了，对于后续的产业链可能会造成灾难。可人不是机器，那就招更加标准化的人。\n\n有次看演唱会晚归时，我假装肚子疼去医院晚回了，把同行的室友惊呆了。但换到现在我想大概难以做到那种程度的伪装，即便一时有这样那样的好处，但任何事情上都在伪装，在脱离本心的道路上渐行渐远，会给自身带来更严重的灾难。不，已经带来了。\n\n总之现阶段，矫枉过正，会显得不懂人情世故，我想也是必然吧。\n\n我很讨厌我的说话风格，一二三总之，清晰的罗列和一堆逻辑方向的用词。我已经在尽量避免爹味的痕迹。但我很久没有看过文学作品了，天天看论文和文档免不了如此。\n\n\n\n5\n\n坐班工作的时候我反而没有注意力切换的烦躁感。叫我也肯定是讨论工作问题，我所说的对方能理解，大家有在认真地理解对方具体的行动。而不仅仅是三两句陷入存在主义的危机。\n\n但是注意力切换问题还是存在的，有次被打断去看什么，回来不知道写到哪里了，之前什么细节需要注意，然后写了 bug ……\n\n\n\n6\n\n你为什么不工作？\n\n在最想找工作、转行的时候，说我的所作所为一无价值，对赚的那一点小钱进行对比贬低，以此劝我写论文。在决定把论文写完后，发现我写不完，劝我赶紧找工作。\n\n这么说，导师才是第一个问，你真的想写完论文吗，的人。虽然我对导师并无好印象，但我可以理解他，我和他更像是一类人。\n\n我觉得不要劝了，真正的支持确实只有钱了。我不需要关心，我分不清你们的关心和控制。我也不需要很多钱，可以每天吃三块钱的面过活。趁我还有力气偶尔想死时让我自己决定，我不想，也怪不到你们头上。\n\n不是说我想死，而是想死之人必有不甘。无所谓生死时才是真的躺了。至少有人真的有人会很切实地鼓励我写论文，我已经非常感激了。你不是一个人，运气也不算太坏，不是吗。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,1]},{"id":"2025-04-16 07:31:00","content":"\n看了眼 tool_call 到底是啥……这怎么也写茴……用 peft 模型让大模型能更好处理特定格式的输入输出，以满足传统编程的需要……说 AI 和 传统编程分界的话，大概在于 AI 只管 pe 算法但不管具体数据集格式，传统编程只管数据格式不管 pe 算法的啥的。由于数据格式无穷多，那不就还是写茴，而 tool_call 是其中之一……倒也可以算是种下游任务，只是不管算法本身的，最缺的是特定格式数据集的，我都称之为写茴……\n\n想起鄙人论文也涉及 pe（参数微调）……anyway 不重要了，应用花时间最多的还是在处理数据格式上，方法确实没啥值得说是创新的地方的，还是在写茴当 api 调库侠……文本分类问题，随便一个 lora 就可以解决真是忧伤……大模型的小版本也够用了，不再需要小模型了。对了，上次看的语音模型论文也是在 prompt 上做文章，直接把 encode 后的音频特征当输入塞进千问0.5b，输出再去掉特殊 token  就是 decode 成了 wav 了………训练的只有一个 encoder 以确保输出 token 能被顺利 decode 为人能听的音频……这何尝不算一种前置的 finetune……\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,2]},{"id":"2025-04-11 23:34:00","content":"\n但是 serum2 真的很强。\n\n但是强不强又有什么关系呢，超棒音色会因为 ipad 接 rtpmidi 的奇特越延迟感弹出来就是垃圾，听了sample发现人家完全不一样。电钢又离得超远还没有推子。声卡已经通过 asio4all 和虚拟跳线省了，但我真的不想再买 midi 键盘了。我不打算再入坑了（还是该说回坑），合成器对于我只是玩具。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,3]},{"id":"2025-04-08 21:08:00","content":"\n还是忍不住陷入了，意义怪。再怎么说不要去纠结这个事情，他是否充实是有没有意义，能完成就行了，可是到最后还是会觉得不充实就不想做，那叫做没带脑子的瞎忙。\n\n昨天看了一堆 合成器，嗯嗯嗯都功能性套娃，最终效果还是看审美。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,4]},{"id":"2025-04-07 03:16:00","content":"\n不看论文难受，看了更难受，想死。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,5]},{"id":"2025-03-28 17:50:50","content":"\n笑死我了，喜欢看吐槽写茴的 [再也别问 Singleton 了好吗？ - Frost's Blog](https://frostming.com/2025/singleton/)。但是在知道够多茴，有比较下才会感到写茴没必要，矛盾……\n\n我到今天也是比较喜欢 Go 的，整体的简洁避免了很多写茴，每一行的调用都是可预期的，没有魔法。好多几年前见室友看不懂 python 库里一个类的代码调用的哪，也没有注意到原来类像函数一样调用是很怪的，一查原来是 `__call__`……如果说一定要掌握很多深入的特性才能看懂库的执行逻辑，那就是魔法过多了，需要考一个 mastering python 资格证（某厂真有）\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,6]},{"id":"2025-03-27 21:13:05","content":"\n看了 spark-tts，因为生成特别慢想看看改进空间。结果发现是把音频特征全塞到 Qwen 做 Tokenize，输出巨长的长度因此很慢。但如果输出的特征减少，要么架构会变复杂增加一些后处理，要么就是舍弃一些 performance……\n\n只要开始写论文，nami 就会对一切感兴趣，甚至其它领域论文……\n\n至于为什么看 TTS，因为晚上睡不了，在找听书的用的语音。然后就是，念咯噔 BL 文绝赞推荐 GPT-SoVITS 的流浪者微调语音当旁白……\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,7]},{"id":"2025-03-20 11:27:12","content":"\n昨天睡不着问了 gpt，还是建议我记录。所以我又来了。\n\n今天她要走了，她一早上开始放微信视频号，乱世佳人的梗概和爹味育儿视频，并且在她离得远时音量开到最大整个房子都听得见。\n\n我受不了，带起耳机放歌了。头也蒙在被子里。然后她进来和我讲话，声音穿透了耳机。说以后你发生什么我都管不了。加深了我的没信心感。\n\n我在想为什么她不能说，就算我们帮不了你，我们也相信你可以把事情处理好的呢。我知道我缺什么了，真的……是信心与合适的监督。\n\n我只睡了五个多小时。我本身不想起床，现在我更不想起床了。正常的计划类，我是想起床帮她收拾东西送她的。但是是睡5小时时被叫醒然后放爹味视频号叫醒的。\n\n而昨天睡不着的最主要原因，我咨询gpt了。deepseek 比 gpt 更不稳定更不靠谱，MoE 的缺陷此时尽数体现，太跳跃了。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,8]},{"id":"2025-03-16 19:32:05","content":"\n看了 [transformers.run](https://transformers.run/) 。一大堆数据集介绍和 relative works。是非常好的 survey。很好，很偏实践，\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,9]}]