[{"id":"2025-02-20 23:59:59","content":"\n📅 今天：下午和面包包在星巴克，我继续看论文了，终于看完了昨天的框架优化性质的论文，吃吃饭。面包很 Nice，但不要送我这么贵的东西，感觉如果我真的是个小骗子（指骗一小笔但不至于让人破产的骗子）那面包会被骗了…… \n\n我大概会以什么理由让你看到这里，如果你看到了，我有个小小的希望——你不要把自己情况对什么人都说哦，特别刚认识几天的，包括我（尽管我双手我真的是老实人）。感觉有点点危险，如果是别人，在知道你的成长经历情况下，也许会针对你的情况调整相处方式来欺骗你的哦。因为当 KOL 的话，在我视角看来，接触你的人容易没那么纯粹，即便一般情况下是好人，在名声与钱面前也可能选择隐藏自己的一部分，这个部分很可能是你不喜欢的，因为他/她能够猜出你的喜好。尽管时间久了一定看得出来，但不要等没看出来时就被骗啦！\n\n但 KOL 的身份对于你创业来说是好事，加油加油！\n\n另外，项链我会收好的，很谢谢你，特地留下东西作为朋友的见证，但也已经超出了我应得的范畴。有机会回个礼吧，嗯，所以先找工作。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,0]},{"id":"2025-02-19 23:59:59","content":"\n📅 今天：晚上被赛博机器员摁住看论文，自己一个人真的没法开始。然后坐完牢非常快乐地摸鱼一小时。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,1]},{"id":"2025-02-18 19:34:54","content":"\n昨天睡觉早！我终于放过我了 9 点睡了，没有在晚上脑子开始蹦迪。今天还是起床很晚，但属于是补觉昨天只睡3小时。下午到晚上就是躺着发消息到坐着发消息……不能再发了我要开电脑随便做点什么。另外我比较排斥说为了单方面的功利去接近什么人，应当说是有共同的利益最好。但就算这样，对方明显能提供更多的信息帮助时，还是会有压力，可能是会觉得有些被动。\n\n昨天和桃桃玩了 maimai。桃桃，更神奇，感觉是什么都会，会有那种，隐藏的大佬，绝世幕后推手的感觉。声音是那种，二次元照近现实。好多时候我觉得 i 人出门就该不知道说什么就不说，但不熟的话好像不说话又很尴尬。另外，看了这么多音游，我明白为什么 mai 卖的好了，实体按键的反馈和爽感确实是最好的（出现了待过游戏公司的烙印）……\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,2]},{"id":"2025-02-16 02:04:00","content":"\n e日，和面包玩了 maimai。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,3]},{"id":"2025-02-15 03:24:00","content":"\n今天休息，啥都没有。\n\n超有精神，该说是只要不写论文我就很有精神吗……但有点后悔没按计划进行，明天不能这样了。但能吃饭就很好了……希望腰靠快点到，现在坐一会儿人就不行了。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,4]},{"id":"2025-02-13 21:41:05","content":"\n半夜抠了6小时 JS 的动画。反正没有按计划。抠了长文页的 Image PlaceHolder 处理，应该不会对 RSS 有影响吧，吧……\n\n比昨天有精神，按时吃饭，做了家务，洗澡洗头。现在吃了碳水好困，想困着把星铁的剧情过了。然后正常睡觉……可能定时播客真的有效果，今天播的是一个心理学相关的，爱听。14日凌晨写代码时差点以为是第二天了。\n\n还是想看 JS 书。然后改改论文。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,5]},{"id":"2025-02-13 00:50:12","content":"\n什么也没做。\n\n整个白天都很困。\n\n想看 JS 书。然后改改论文。其实工作考虑应该看开发相关，一大堆 TODO 在 Logseq 上，还有想做的一些项目，还要刷题。做不完，根本做不完。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,6]},{"id":"2025-02-12 00:30:07","content":"\n我离职了，然后写了半天论文。现在洗完脸擦面霜，  发现没用，一会儿就会被氯化钠溶液溶解掉。\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,7]},{"id":"2025-02-06 20:47:30","content":"\n春节过了复工了。唯一一个没有打开电脑的春节，因为家里搬家了，他们不需要电脑桌。我找了半天没地方放，想连电视发现没带无线键盘。我也没有书桌，想画画还得趴在床上。我的吉他也不在，琴也不在，我又不想打游戏，很无聊。\n\n然后我才意识到家里没有像样的书桌是一件多可怕的事……只能躺着玩手机或者起来干活。除非我愿意在厨房旁的餐桌使用电脑，每过一会儿，他们就会叫我去做个什么事，然后会因为被不停打断而烦死。\n\n总之我没有任何的事情，也没有玩游戏，一味做他们需要我做的，大概是随时待命的家用机器人，他们也没什么大事要我做，只是叫到我时我得在，这个意义上说和无效坐班没什么区别，碎片化打杂。负作用是浑浑噩噩，忘记思考，忘记探索，也忘记了创造。\n\n我也发现除了做饭大事以外，其实他们忙得很没有必要，不如说是闲着感觉没有价值。比如刷羽绒服再吹干，吹干花费的时间是刷羽绒服的两倍多，然后我妈就手提着羽绒服用吹风机吹两个多小时……她想做别的时，就让我吹……我在想就不能找个东西角度固定吹风机吹，自己去玩吗……然后洗一件羽绒服就一上午过去了。这种事能做一上午可能只是好玩而已吧。人很多事真的是自找的，包括非常自己从原材料（活鸡）开始做饭这点。\n\n我从 leader 那学到了很多怼人很好用的方法，专治假大空言论、无效类比、盲目乐观和盲目悲观。但其实我又不愿意变成 leader 那样，对于大部分人而言表达自己的观点本来就是一种伤人。\n\n然后被安排回农村，因为大冬天被塞超冷水果，肠胃感冒三天多吃不了什么东西，第一天晚上也没法睡觉。在北京住冬天屋里没有暖气我也从没这么冻过自己，回南方我真的服了。\n\n然后大家都说肠胃感冒喝藿香正气……我喝了没啥用，第二天觉得更严重了，换成抗菌药物立刻有用。所以中医到底干啥能有用……\n\n有好事吗，有啊，今年又开始能放鞭炮了。以及猫还是会给我摸。\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,8]},{"id":"2025-01-24 22:21:38","content":"\n放假了，最后狂改 Bug 和加新功能。本来是写个 Debug UI，再扩展一下要写成地编了……\n\n然后感觉过程式编程的动画写法还挺不一样的。我已经被 React 的函数式思路荼毒了，动不动想传回调，用事件也都带参数……实际上过程式的写法还是依赖状态机和统一状态管理。然后我就觉得函数式的思维说得对，共享状态就是会引起不一致性，看别人代码时尤其明显，完全不知道突然给 Set 了个什么，要对整个架构非常清晰，否则维护就变成屎山……\n\n但是出于性能考虑，游戏还是只能过程式的写法，嗯。看 react 那性能就知道了。就像知乎上一句话说的\n\n> React再不转向以subscription（订阅式响应）为主的reactivity响应，还固守comparison（比较式响应），迟早会被Solidjs、Svelte 甚至是Vue干掉。\n\n而用了 zustand 这样的订阅式响应库，注定就会开始有状态维护上的问题。我在 Debug UI 里拆成这样的写法了。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[3,9]}]