[{"id":"2025-01-05 18:37:39","content":"\n对啦，元旦是去和雨疏一起玩啦一下午啦！然后她真的已经对汉服妆造炉火纯青了！\n\n然后回去她家看了uni（一只猫）。\n\n希望今后也能有机会再见吧。\n\n**=== 有关天赋 ===**\n\n在商场的时候，照例玩苹果店。发现 CSP 有演示版，还有 SketchUp 也有演示版。\n\n然后csp画了几笔的侧脸，旁边的店员小哥突然说，你是天才。\n\n我冷汗：不……我，不是……\n\n雨疏：她是专业的。\n\n我：不，我不专业……\n\n只有从前被说没有画画天赋的人才能感受到其中的无奈。\n\n有许多人会觉得对于艺术设计是天赋，比不上天赋佬就别学了。\n\n但这句话其实放在应试教育也是一样的。如果给小学生开放大学课程，一定也有天赋小学生很快学会，特别是数字电路这类逻辑课。\n\n画画和音乐也是一样，我确实没有画画天赋。从前因为究极的理科思维，我也许能够做得临摹每个像素点，但不明白画画与创作本身。因为我不明白如何做视觉表达，尤其是聚焦于形式而非内容。\n\n即便不知道如何通过视觉表达感受，我依然可以观察总结我喜欢的图，可以学习别人的经验。虽然过程慢了很多，要花很多很多时间练习。但，如果一直学，只要还有提高画面安排的意识，时间久了感受也会提高。这个过程最需要的只有一点，那便是喜欢。\n\n所以今时我能几笔画二次元侧脸，只是因为，画了几千几万遍而已，写实的概括的不同脸形的骨骼肌肉，都有画过，不是天赋。\n\n我也理解为什么店员会说天才。二次元极度概括，概括的风格就是前面每一笔都好像不知道在干什么，但画几笔之后突然就出现了某个东西，速度非常快。而且看起来就几笔很好学，但实际自己画又完全不是那样。小时候我看青山岗昌的签绘也是这种感觉，不打草稿不用橡皮几笔就把一个东西顺利画出来了，简直像魔法。\n\n现在也只是学会了看每一根平平无奇的线，知道每一个细微的转折都是在画什么，为什么这里有转折那里没有。如果线画歪了，能不能用，影响有多大，这样的意识是可以练习的，需要的只是喜欢，和一点点的动脑。\n\n（附图是鄙人工位的上的极简小摸鱼，没有纸片美少女的工位是没有生机的！）\n\n\n","tags":[],"imgsmd":["![IMG_3233](https://img-cf.sansui233.com/imgs/2025/01/202501051922436.webp)"],"sourceFile":"004.md","csrIndex":[4,0]},{"id":"2025-01-05 01:03:27","content":"\n找个时候总结一下去年看过的玩过的一些新作品吧。不知道还能记得多少，记性差这一点实在太不好了。好多时候会回小号看看之前发过什么点子一类的，感觉真有趣。虽然很多地方都在记，但会回去看的还是社媒……而且由于现是天天和 meme 大师交换 meme，许多有趣的东西也都没有发微博了——因为太多了，发不过来！\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[4,1]},{"id":"2025-01-05 00:51:17","content":"\n#游戏 打完了传说之下，非常好经典游戏！非常温暖的剧情，日式 rpg 的角色塑造。\n\n最近一年觉得好玩的游戏也就传说之下和动物井了。还是觉得脑洞大的比较好……再看看之前画的同人，当时脑洞觉得已经很大了，评论也说有那种脑干缺失的感觉了。但现在还是觉得有点不够，时代已经在抽象赛道上已经一去不复返了。\n\n\n\n","tags":["游戏"],"imgsmd":["![传说之下2](https://img-cf.sansui233.com/imgs/2025/01/202501050057822.webp)","![](https://img-cf.sansui233.com/imgs/2025/01/202501050056915.webp)","![传说之下](https://img-cf.sansui233.com/imgs/2025/01/202501050055049.webp)"],"sourceFile":"004.md","csrIndex":[4,2]},{"id":"2024-12-09 time","content":"\n每天回来看到自己的电脑屏幕都觉得瞬间治好了老花眼……屏幕不好，会死！\n\n还有每天回来就两小时空闲时间了，感觉根本不够用的啊啊啊啊啊！要么住近一点，可以每个月多花一两千块获得每天3小时的空闲时间……那还是不够用的啊啊啊啊！这还是没加班的情况下！\n\n而且在地铁上玩游戏总感觉是在给手游打工。坐久了回去也只想立刻躺下，什么人还能坐着玩游戏的……这么说我要更新一下我布局了为了可以 躺着玩电脑，这样得拿上手柄玩游戏……但就玩不了 fps 啊啊啊!\n\n不过话说回来为什么要玩游戏啊！其实我更想切割一下时间，继续弹吉他什么的……但脑子过载了，感觉要睡一觉才能起来继续弹……\n\n然后能够理解为什么人工作久了就会渐渐失去胡思乱想的特质了……什么东西都是不花时间刻意练习就会废掉。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[4,3]},{"id":"2024-12-08 00:12:16","content":"\n#游戏 哇这次星铁小活动的文案写得真的超级好，之前有这么好么，还是说我对语言的感知有些许恢复了？之前总是觉得流水账太多过于啰嗦了，但这次完全没有，是想抄下来反复学习的程度。结尾的“今夜无事发生”氛围拉满，用与旁白“闭嘴”的调侃作为收场，演出效果堪称完美，终于在意节奏和分镜了！\n\n另外，电脑的小剧情蛮有意思的，大概是说主角受不了电脑卡顿和弹窗开启杀软，遇到一个外挂程序苦苦修炼成了超智能病毒，跳出来给主角许愿，最后变成了主角的电脑管家。一边阻止了系统更新一边升级防火墙一边偷偷主角电脑上的小视频，食物是电脑里的垃圾文件。 真羡慕文案的文笔描述，同样的话能写得很有意思。\n\n","tags":["游戏"],"imgsmd":[],"sourceFile":"003.md","csrIndex":[4,4]},{"id":"2024-11-23 14:45:42","content":"\n最近更难受的是没有办法在4点前睡着觉，任何办法都不行。我以为是够困就可以结果困也睡不着。褪黑素也不行。但是我觉得如果 ADHD 症状可以随着上班减轻的话应该也 也行。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[4,5]},{"id":"2024-11-14 02:52:18","content":"\n疯狂 debug 快3小时，自从 next.js 升级依赖后，rss 就不会在 build 时更新了，仔细一查竟然是卡在 code splitting 上……然后开个 branch 查了半天，发现把茴字换一种 dynamic import 写法就不会有问题了，啊？啊？不是？我不明白……另外这要怎么 debug 啊……\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[4,6]},{"id":"2024-11-13 22:45:23","content":"\n啊啊啊听歌就好像画画真的好想画画有想画的但画技太烂了又会画一半被自己气死！\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[4,7]},{"id":"2024-11-12 05:49:48","content":"\n今天又抓住 secs 聊天，大概确定评估标准就是生活质量+感兴趣吧。北京生活质量的活，antarx 说是觉得得 50w，我觉得长期生活的话确实是这样的，很难想象一个月一万块在这个出门就是雾霾的地方生活个十几年，每天看着 AQI 破百的空气质量发愁。啥也存不下，那我不如回老家，也是一个月一万多但至少有房……\n\n然后 secs 和 andy 出去的理由其实都是有比较明确的，离开家的动力。但鉴于之前种种原因吧，我差不多没有任何生活上换地方的动力了，或者说哪里都一样。会觉得换个地方可能很好，但是不是那种很想去看看的好，而是觉得达不到的理想美。我现在有动力可能是上门维修网络疑难杂症，可能是太需要帮人解决问题以维持自身那点薄弱的价值感了。\n\n说来买的软排线还没到……搜了好久才知道中关村那边是还有在卖的。怪我没有做硬件的朋友，尽管本科专业是硬件相关的但那时没有人喜欢自己 DIY，我那时也不喜欢，现在，“超有意思”……\n\n然后说回朋友，其实感觉工作后的人会觉得人脉重要还是没有公开透明有效的机制，以及大熔炉的环境吧。在学校的话，找到合适的人是相当容易的，很多被迫社交的场合和活动，至少对我这种 i 人来说也不会存在非常多的信息不对称。出来后是因为社交广度变窄了。\n\n还有到底为什么父母为什么觉得回家等于不工作啊！回家只是少房租啊该工还是工啊！没工一样找啊！不过早就听过自由职业者谈过这个问题，最后甚至出去租工位假装上班了。我个人也不愿意回家，只要不是活不下去了，一分钱也不想用家里的……\n\n然后 secs 写的那篇如何识别野鸡公司，是针对技术岗的，非常有用，我觉得可以拿去开讲座的程度。就是策划岗不太适用吧。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[4,8]},{"id":"2024-11-07 23:56:52","content":"\n游戏策划这个事情、何と言うかさあ……果然还是不太行的样子。老实说呢我本科时是还真是挺想进的，日记会写想做 ACG 相关的。但是时代变了大人……朝令夕改的谁也不保。而且我始终想做的是技术（就算画画也是技术），而不是策划这样门槛低，但比炒股都难赚，还要指挥别人 social……我真的很 i 的 i 人，要是感觉 e 都是装的（也并没有遇到有人感觉我 e）\n\n另外前途这个事，hr 说了很多还是不觉得策划的发展路线是明朗的，更类似创业吧，创业多不明朗做策划就多不明朗。今天 hr 说的没招老策划的原因，那很可能就是我今后再次找工作面临的问题。\n\n技术后期再做策划，大概是我觉得最好的方式了，也不会有拍脑袋一想结果没法落地的问题。我甚至觉得技术有想法那是不需要专门找策划的，要找只能是因为人一天只能工8小时……\n\n我在以前也是觉得只要能力对口就能找，但现在发现好多公司都是草台班子混口饭吃，工作内容就是谁都能做，做久了能力没有提升只是熟悉了业务流程，这时就是拼的简历、学历什么的……如果有生活得更轻松的工作，业余时间打点游戏，就是再好不过了。\n\n当然还蛮开心和制作人聊天的，整个过程还挺神奇的，被动找过来的，不是一个诈骗公司还是有在做原创的公司就很幸运了，但就还是，一个不能做技术的职位，还谁都能做，确实不会想去，说浪费我游戏设计的天赋，但我长期实践过也无比清楚我设计很一般，比下有余比上不足，每次看到好作品一查作者都是艺术、设计相关专业出身，无一例外。所以这是巧合吗？设计是天赋吗？上限是的但是下限不是，下限是经验，是可以学习的。我开始画画真的是被说没天赋的，画什么都很怪，完全看不出特点和方向，但后面上了课后就被说有天赋了……不是……那其实就是基础和经验而已。\n\n相比之下做策划更浪费我学技术的天赋，或者说动力吧……艺术生就业更加困难这种机会还是给他们吧，我还遇到了挺多逻辑挺好的艺术生的，但鄙人的艺术生朋友无一例外都是技术党，明确表示技术做到头了也不想去混管理，还想学虚幻5，要转去做个人品牌。\n\n不过我也听说了同专业学长有一些本科去了游戏策划，可能16年左右吧，只能说，时代啊时代……但策划也没有在我的考虑范围内，毕竟我更习惯直接动手实践，而且策划钱太少了（图穷匕现！）真就在北京贷款上班是吧，同样的工资在老家 955 躺平不好吗，想干什么做成副业不好吗……\n\n不过也感谢强行把我从待机状态拉出来的 HR 吧，说明我还不是真的想摆烂……开头面试时整个牙齿都在抖，这就是社恐久了……\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[4,9]}]