[{"id":"2025-02-12 00:30:07","content":"\n我离职了，然后写了半天论文。现在洗完脸擦面霜，  发现没用，一会儿就会被氯化钠溶液溶解掉。\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[5,0]},{"id":"2025-02-06 20:47:30","content":"\n春节过了复工了。唯一一个没有打开电脑的春节，因为家里搬家了，他们不需要电脑桌。我找了半天没地方放，想连电视发现没带无线键盘。我也没有书桌，想画画还得趴在床上。我的吉他也不在，琴也不在，我又不想打游戏，很无聊。\n\n然后我才意识到家里没有像样的书桌是一件多可怕的事……只能躺着玩手机或者起来干活。除非我愿意在厨房旁的餐桌使用电脑，每过一会儿，他们就会叫我去做个什么事，然后会因为被不停打断而烦死。\n\n总之我没有任何的事情，也没有玩游戏，一味做他们需要我做的，大概是随时待命的家用机器人，他们也没什么大事要我做，只是叫到我时我得在，这个意义上说和无效坐班没什么区别，碎片化打杂。负作用是浑浑噩噩，忘记思考，忘记探索，也忘记了创造。\n\n我也发现除了做饭大事以外，其实他们忙得很没有必要，不如说是闲着感觉没有价值。比如刷羽绒服再吹干，吹干花费的时间是刷羽绒服的两倍多，然后我妈就手提着羽绒服用吹风机吹两个多小时……她想做别的时，就让我吹……我在想就不能找个东西角度固定吹风机吹，自己去玩吗……然后洗一件羽绒服就一上午过去了。这种事能做一上午可能只是好玩而已吧。人很多事真的是自找的，包括非常自己从原材料（活鸡）开始做饭这点。\n\n我从 leader 那学到了很多怼人很好用的方法，专治假大空言论、无效类比、盲目乐观和盲目悲观。但其实我又不愿意变成 leader 那样，对于大部分人而言表达自己的观点本来就是一种伤人。\n\n然后被安排回农村，因为大冬天被塞超冷水果，肠胃感冒三天多吃不了什么东西，第一天晚上也没法睡觉。在北京住冬天屋里没有暖气我也从没这么冻过自己，回南方我真的服了。\n\n然后大家都说肠胃感冒喝藿香正气……我喝了没啥用，第二天觉得更严重了，换成抗菌药物立刻有用。所以中医到底干啥能有用……\n\n有好事吗，有啊，今年又开始能放鞭炮了。以及猫还是会给我摸。\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[5,1]},{"id":"2025-01-24 22:21:38","content":"\n放假了，最后狂改 Bug 和加新功能。本来是写个 Debug UI，再扩展一下要写成地编了……\n\n然后感觉过程式编程的动画写法还挺不一样的。我已经被 React 的函数式思路荼毒了，动不动想传回调，用事件也都带参数……实际上过程式的写法还是依赖状态机和统一状态管理。然后我就觉得函数式的思维说得对，共享状态就是会引起不一致性，看别人代码时尤其明显，完全不知道突然给 Set 了个什么，要对整个架构非常清晰，否则维护就变成屎山……\n\n但是出于性能考虑，游戏还是只能过程式的写法，嗯。看 react 那性能就知道了。就像知乎上一句话说的\n\n> React再不转向以subscription（订阅式响应）为主的reactivity响应，还固守comparison（比较式响应），迟早会被Solidjs、Svelte 甚至是Vue干掉。\n\n而用了 zustand 这样的订阅式响应库，注定就会开始有状态维护上的问题。我在 Debug UI 里拆成这样的写法了。\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[5,2]},{"id":"2025-01-05 18:37:39","content":"\n对啦，元旦是去和雨疏一起玩啦一下午啦！然后她真的已经对汉服妆造炉火纯青了！\n\n然后回去她家看了uni（一只猫）。\n\n希望今后也能有机会再见吧。\n\n**=== 有关天赋 ===**\n\n在商场的时候，照例玩苹果店。发现 CSP 有演示版，还有 SketchUp 也有演示版。\n\n然后csp画了几笔的侧脸，旁边的店员小哥突然说，你是天才。\n\n我冷汗：不……我，不是……\n\n雨疏：她是专业的。\n\n我：不，我不专业……\n\n只有从前被说没有画画天赋的人才能感受到其中的无奈。\n\n有许多人会觉得对于艺术设计是天赋，比不上天赋佬就别学了。\n\n但这句话其实放在应试教育也是一样的。如果给小学生开放大学课程，一定也有天赋小学生很快学会，特别是数字电路这类逻辑课。\n\n画画和音乐也是一样，我确实没有画画天赋。从前因为究极的理科思维，我也许能够做得临摹每个像素点，但不明白画画与创作本身。因为我不明白如何做视觉表达，尤其是聚焦于形式而非内容。\n\n即便不知道如何通过视觉表达感受，我依然可以观察总结我喜欢的图，可以学习别人的经验。虽然过程慢了很多，要花很多很多时间练习。但，如果一直学，只要还有提高画面安排的意识，时间久了感受也会提高。这个过程最需要的只有一点，那便是喜欢。\n\n所以今时我能几笔画二次元侧脸，只是因为，画了几千几万遍而已，写实的概括的不同脸形的骨骼肌肉，都有画过，不是天赋。\n\n我也理解为什么店员会说天才。二次元极度概括，概括的风格就是前面每一笔都好像不知道在干什么，但画几笔之后突然就出现了某个东西，速度非常快。而且看起来就几笔很好学，但实际自己画又完全不是那样。小时候我看青山岗昌的签绘也是这种感觉，不打草稿不用橡皮几笔就把一个东西顺利画出来了，简直像魔法。\n\n现在也只是学会了看每一根平平无奇的线，知道每一个细微的转折都是在画什么，为什么这里有转折那里没有。如果线画歪了，能不能用，影响有多大，这样的意识是可以练习的，需要的只是喜欢，和一点点的动脑。\n\n（附图是鄙人工位的上的极简小摸鱼，没有纸片美少女的工位是没有生机的！）\n\n\n","tags":[],"imgsmd":["![IMG_3233](https://img-cf.sansui233.com/imgs/2025/01/202501051922436.webp)"],"sourceFile":"004.md","csrIndex":[5,3]},{"id":"2025-01-05 01:03:27","content":"\n找个时候总结一下去年看过的玩过的一些新作品吧。不知道还能记得多少，记性差这一点实在太不好了。好多时候会回小号看看之前发过什么点子一类的，感觉真有趣。虽然很多地方都在记，但会回去看的还是社媒……而且由于现是天天和 meme 大师交换 meme，许多有趣的东西也都没有发微博了——因为太多了，发不过来！\n\n","tags":[],"imgsmd":[],"sourceFile":"004.md","csrIndex":[5,4]},{"id":"2025-01-05 00:51:17","content":"\n#游戏 打完了传说之下，非常好经典游戏！非常温暖的剧情，日式 rpg 的角色塑造。\n\n最近一年觉得好玩的游戏也就传说之下和动物井了。还是觉得脑洞大的比较好……再看看之前画的同人，当时脑洞觉得已经很大了，评论也说有那种脑干缺失的感觉了。但现在还是觉得有点不够，时代已经在抽象赛道上已经一去不复返了。\n\n\n\n","tags":["游戏"],"imgsmd":["![传说之下2](https://img-cf.sansui233.com/imgs/2025/01/202501050057822.webp)","![](https://img-cf.sansui233.com/imgs/2025/01/202501050056915.webp)","![传说之下](https://img-cf.sansui233.com/imgs/2025/01/202501050055049.webp)"],"sourceFile":"004.md","csrIndex":[5,5]},{"id":"2024-12-09 time","content":"\n每天回来看到自己的电脑屏幕都觉得瞬间治好了老花眼……屏幕不好，会死！\n\n还有每天回来就两小时空闲时间了，感觉根本不够用的啊啊啊啊啊！要么住近一点，可以每个月多花一两千块获得每天3小时的空闲时间……那还是不够用的啊啊啊啊！这还是没加班的情况下！\n\n而且在地铁上玩游戏总感觉是在给手游打工。坐久了回去也只想立刻躺下，什么人还能坐着玩游戏的……这么说我要更新一下我布局了为了可以 躺着玩电脑，这样得拿上手柄玩游戏……但就玩不了 fps 啊啊啊!\n\n不过话说回来为什么要玩游戏啊！其实我更想切割一下时间，继续弹吉他什么的……但脑子过载了，感觉要睡一觉才能起来继续弹……\n\n然后能够理解为什么人工作久了就会渐渐失去胡思乱想的特质了……什么东西都是不花时间刻意练习就会废掉。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[5,6]},{"id":"2024-12-08 00:12:16","content":"\n#游戏 哇这次星铁小活动的文案写得真的超级好，之前有这么好么，还是说我对语言的感知有些许恢复了？之前总是觉得流水账太多过于啰嗦了，但这次完全没有，是想抄下来反复学习的程度。结尾的“今夜无事发生”氛围拉满，用与旁白“闭嘴”的调侃作为收场，演出效果堪称完美，终于在意节奏和分镜了！\n\n另外，电脑的小剧情蛮有意思的，大概是说主角受不了电脑卡顿和弹窗开启杀软，遇到一个外挂程序苦苦修炼成了超智能病毒，跳出来给主角许愿，最后变成了主角的电脑管家。一边阻止了系统更新一边升级防火墙一边偷偷主角电脑上的小视频，食物是电脑里的垃圾文件。 真羡慕文案的文笔描述，同样的话能写得很有意思。\n\n","tags":["游戏"],"imgsmd":[],"sourceFile":"003.md","csrIndex":[5,7]},{"id":"2024-11-23 14:45:42","content":"\n最近更难受的是没有办法在4点前睡着觉，任何办法都不行。我以为是够困就可以结果困也睡不着。褪黑素也不行。但是我觉得如果 ADHD 症状可以随着上班减轻的话应该也 也行。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[5,8]},{"id":"2024-11-14 02:52:18","content":"\n疯狂 debug 快3小时，自从 next.js 升级依赖后，rss 就不会在 build 时更新了，仔细一查竟然是卡在 code splitting 上……然后开个 branch 查了半天，发现把茴字换一种 dynamic import 写法就不会有问题了，啊？啊？不是？我不明白……另外这要怎么 debug 啊……\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[5,9]}]