[{"id":"2023-10-12","content":"\n啊，愁怅，写了2000字又写卡壳了。\n\n啊，原来是惆怅，不是愁怅。\n\n怎么收尾都不满意，太浮于表面，共情不到，也就体会不到。\n\n只有不同的设定、深刻的意义去想。但我写它的目的就是为了避开设定和意义去讲故事。\n\n但我同时一想，感情讲得很拉的故事、烂尾的故事、为了戏剧故意制造冲突的故事，也是不要太多……其实大家普遍都很废，嗯。完全真实的发展，叫生活，作为故事讲出来挺无聊。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[6,0]},{"id":"2023-10-06","content":"\n《献给阿尔吉侬的花束》是有生以来看过最刀的一个小说，没有之一。从一开头就能闻到刀味，后半本差不多是哭着看完的。\n\n这本书有着我非常喜欢的行文方式。内容很刀，但行文如同书名那般亲切与温柔，节奏恰到好处，用简短的话语交代完复杂的事情，情节的衔接有画面感。没有冗杂的长句，没有晦涩的词汇，没有翻译腔。大概是“让所有人读得懂”和“意识流”之间我所憧憬的最完美平衡。\n\n--------\n\n写完发现下面越写越自我了，大概是知道心理学上需要从记录中认清自我，所以一看人文类的书就会触发这样的习惯。算了，划个分界线吧，下面只当是反思好了。\n\n---\n\n最近感觉内在匮乏到了一个极点，所以想把笛子从前推荐的书目都看一看，不管看过的没看过的。自从上大学后看的书都变成了类似教学目的的书，已经很久没有看小说了（网文除外）。从前看到笛子书单时，也不是阅读的时候。那时看了我也不会太理解。\n\n高中时为了学英语，路过一家装修环境特别好的饮品店，书架上有一堆原著书，于是在那里呆了三个小时看了不起的盖茨比，却连人名都记不全，让我坚持三小时的，只有一个学好英语的信念，好像学好了英语，我就能了解更多我不能了解的事情。就像白痴的查理•高登说，我想要变匆名，这样就有很多人会喜欢我，可以坐在桌前，能谈论很多我不知道的是情。尽管相比于查理•高登，我没有智力障碍，但从心理成熟度说，我和他没什么两样。\n\n当我真正开始理解后，宁愿永远不要明白，只想远离人群，这个世界就是一团乱，从来都是。不过并没有太大性格转变，可能是因为智商并没提高吧（笑）如果说人的现在由过去塑造，我既不是智力障碍，对过去的认知也没有发生什么根本性的转变，清楚地知道所有人在某时某刻说的话有什么隐藏的情绪。只不过渐渐认清了自己是个十足的理想主义者，我的一切行为基于理想主义。有人基于权势，但有人基于自尊，有人基于最本质的玩劣。同样的话，同样的情绪，背后的却有着根本性的不同。我第一次认识到，相同的表象背后本质却有如此大的不同，人与人之间的壁垒是如此之大，是如此的不可相通。\n\n很庆幸我是在明白这一切后看的 EVA，特别是剧场版的真心为你2，那一大段意识流讲述的就是类似的事情，碇真嗣在此时感到绝望而主动接受人类补完计划（破除心之壁），直接把这部动画上升到一个原本没有的高度。但结尾他最后还是接受一切的痛苦回归了现实，突然感到自己也被鼓励。尽管至今不理解为何会如此结尾，但不论原因，这是对所有抱有同样心理的观众的救赎。理想主义者是这样的，当无路可走时，会鼓励自己去相信而忽略逻辑。如果真嗣君选择让人类归于混沌，那才真的是一部致郁动画。\n\n有一段时间我非常喜欢拿这一段解压，看了之后仿佛人重获新生。EVA对于科技描述也非常抽象，不是考古式的古代科技，也不是现代的商业科幻美术风格，而是介于人与现代科技之间的抽象，去探讨哲学意义意外搭。\n\n--------\n\n下面更自我了，全是回忆过去。和书没有任何关系。\n\n--------\n\n20岁之前逻辑占绝对上风，现在怎么看都是心智有部分缺失，总想追求什么东西，但我不知道，学业也让人没有时间去思考其他的事。初中时录精品课比赛，我在油纸伞上画抽象的线条，蓝色的，像是蛇，又像藤蔓。美术老师问我我在画什么，我却一点也无法回答，我不知道为什么我想画，只能说，我在画线条。老师一顿，说，是在画抽象的东西吧。我很疑惑，想问抽象是什么意思，但对着镜头与麦克风实在说不口。\n\n画画是一个从小自来的兴趣，我完全没有学画画却报名了画画的比赛，还向老师要了速写的图，天天在宿舍画室友，比赛当天却睡过了头，靠着同学的比赛完的电话吵醒了我。我没什么意图，也不为此感到可惜。后来看柯南，高一时画到凌晨3点第二天上课哈欠连天，数学老师点名批评数学科代表，教室里传出一片的不可置信的声音。但我一直画不好画，如同木偶般僵硬，我不知道为什么，只是觉得我好像是在追求一种我得不到的东西。现在看来就是人文素养。智力占上风，会依靠模仿表演才艺，内在却是迟滞的，和这些人文类的事情扯不上任何关系，当涉及创作时我的脑子里不是无法表达抽象的想象，就是无法表达的感情，之后再空无一物。我一直在寻找能表达的方式，文字非常匮乏，所以转移到了音乐，转移到了画画上。但对于大部分人，当一个会表演的木偶就足够了，我无法触及到这些事物的核心，直到外界矛盾尖锐到严重违背潜意识，开始读心理学的书籍才渐渐明白一切。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[6,1]},{"id":"2023-10-05","content":"\n绝大部分情况下我都不希望回到过去，但看老漫画时还是真的很想回到小时候。很大的页面，不用挤在巴掌大的屏幕上看小字，一篇一篇翻着书，还有编辑的吐槽。是精心编排的东西。更重要的可能还是每周、每月看到更新时的期待吧。去报亭前什么也不干，只有那本书，路上没有博眼球的推广，也没有乱七八糟的想法，那种心情是无论如何再也回不来了。\n\n现在来看那个时期的漫画，杂志连载的小四格有那个时期的文化，现在变得太多了。其实在印象里也不是很久远的事情，但一算时间竟然过了十几年。也不是说现在不好，但有的体验就这样永远没有了，挺可惜的。自从网络平台出现后，选择多了，但反而更难看到好作品的出现，越来越多快餐流水线，漫画作者也越来越难。有妖气上原来有好多个人灵气十足的作品，现在也已经关了，但作者的作品也没有迁移就这样消失掉变成绝版，只能去贴吧考古。近些年看到国漫崛起，都是动画仰卧起坐，漫画永远躺平。\n\n总之就是只是上了个大学，回头才发现好像世界全变了一样。我适应互联网可能也是仰卧起坐。有时候觉得很好，觉得科技会让世界变得更好。但有时候无比讨厌，觉得由于互联网的介入少掉了很多原本重要的东西。科技在带来方便催生新事物的同时，也让会让旧形态消失。表现形式是次要的，整个环境变得这么快这么浮躁时，就已经不单是表现形式的问题了。当年混贴吧十几个人评都觉得很热闹，感觉每个人都是活生生的可以交流人，可以加十几个好友一起聊。但在微博发贴，只有十几评就仿佛是没人看一样，很多人也只是路过看个乐子，面对的是冷冰冰的数据而不再是人。bbs的氛围不是如今靠转评赞推荐系统可以替代的。\n\n有时候也在想是不是自己的原因，毕竟从前发贴动不动就说“大家一起交流\"。现在：好累啊，自嗨就够了，没有精力再交流了。\n\n还好有博客，只有这个博客会让我觉得没有那么多的浮躁，目的是单一的，也不纠结有没有人看。如果有一天我死的大概这个博客是我的最后遗产吧哈哈。听说人死后警方会把死者生前所有的账号都发给家人。我不知道会不会被发现，毕竟一百多个账号整体起来也是一件困难的事情，即便是都有，也得有人知道我这些一大堆的服务东西都部署在哪的，特别分散哈哈，可以不花时间维护全感谢平台的稳定性，当你不维护时总有平台在负重前行。\n\n另外最近看贴吧，发现有人给我 FGO 的那个页面评论了说数据没更新……但我没法回应了，这就是想一出是一出的结果吧，不玩了就弃坑，蛮不好的，我也不知道我有什么能长期坚持的稳定创作型项目，这个角度想，还是上班比较好，能平衡一下我想一出是一出的体质。所有的创作感觉都是需要不断学习，又不断想新的点子，要维持下去个人压力非常大，绝对不是能以 KPI 去评估的。我心态也远不如小时候那么好了，年龄和钱的焦虑不可能没有，不过二者选一的话主要还是钱的问题，也就是生存问题，确实无法生存是不配谈创作的，即便创作是工作，生存不下去时也不过是创一些机械式的流水账。总有人觉得生成式 AI 会代替创作，只能说这些人根本不知道什么是创作。表象很花时间，或许可以用AI代替，但创作真正需要的你的经历、情感、主旨，独一无二，无可替代。\n\n我比任何人都希望有一个 AI 笛子去续写笛子再也不会写的故事。但很显然，不可能，不管是单恋史，还是你什么都没看见，还是绿蓝的两个长篇，那样独特的、温暖的、细腻的、非套路的故事再也不会出现了。她的独立故事很多是可以拍成电影的，确实一些中篇独立故事也有比较长的动画（40分钟左右）但现实就是有大量好的个人剧本无人问津，能搬上屏幕的都是深谙处世之道的人。很矛盾，怎么来说都觉得，太可惜了。\n\n罗小黑是幸运的，找到了投资人，第一部大电影成功了，木头也是有很强执行力的人，不过寒木春华在动画毕业生找工作界还算是黑名单公司w 个人工作室总体来说都是条件艰苦，到现在也不是什么有钱大公司，只能负担小成本的制作。要说出活又快又好还是得看大公司的流水线，但目前明显就是流水的工业糖精。这又是一件另很矛盾的事情了。AI只会让工业糖精变得更加工业糖精，AI对于文化环境的影响，我始终持悲观态度。\n\n---\n\n还是很开心，同人作品画了两期，还是有人看的，大概是近期内的这冷圈里的最热贴了，平台也没限我流，有推荐机制都给推了出去，如果能坚持下去数据上应该会有好的结果（除了无法解决吃饭问题）。但我也是那种想一出是一出的人哈哈，懒散惯了，需要更自律一点才行呢（感觉台词写多了直接改我口癖……）\n\n值得一提的是 Lofter 的推荐机制的存在感超强，每过一段时间就有“恭喜你的作品获得持续加热！原因是blablabla”，好像生怕作者以为没人点赞是平台在限流。微博那个靠超话管理员加精推出去的。b站的专栏我不懂怎么有人会看见的，只知道有的是从别的平台跑过来看。毕竟专栏还在公测，我也不是新人up，没有流量扶持什么的。不过b站专栏的 SEO 非常不错，也不知道怎么做到的，我只知道视频页他们是有专门做 SSR 优化 SEO 的。感谢B站专栏，用来放漫画超级合适，不然国内我还真不知道要放哪里合适，嗯。说来b站最离谱的应当要属于我在18年随手发了第一个视频结果那个视频有1w播放，在18年还算不错了。现在可以确定的是b站对新人up都有流量扶持。只要第一个视频质量不错能看到的人会挺多的。\n\n---\n\n天啊，为什么我写论文不能保持这种两小时2000字的水平？\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[6,2]},{"id":"2023-10-02","content":"\n这几天在画绿蓝的同人漫画。原作者笛子Ocarina一直是我非常喜欢的作者，第一次看到她的作品，五个字能够形容我对她的作品感受：“温暖而深刻”。即便之后看了她很多脑洞大开的、狠狠发刀的作品，依然是这样的印象（下面是长达两千字的笛吹）。\n\n绿蓝是火柴人漫画。笛子一直以内容为主，火柴人在相应内容下表演细腻而恰到好处。可能没看过的人无法理解，会说“火柴人怎么还能看出区别？”。但看了之后会知道，在这么极简的画风下，一个像素的改变都会改变火柴人的灵魂。而且虽然人火柴，但其实体积、透视、分镜、镜头内的人物场景关系、氛围情绪的渲染，这一套语言体系是非常全面的。笛子也很注重下拉式排版的节奏，能让人舒适阅读每一句话，即便有大段的文本读起来也非常轻松。很多东西也是自己去画的时候才观察到的，尽管有刻意模仿，但仍然很难做到她那样的程度。\n\n内容一直是她的优势（至少曾经是，因为她现在没灵感几乎不画了），绿蓝不是一个故事，短篇、中篇、长篇都有，对于三者我只能说，全都非常推荐。短篇大多是有趣的梗，偶尔看一看，人给笑死。中篇是一些独立故事，代表作是在介绍中写着的回忆篇。长篇就是机器人篇和魔王篇了，是加入了计算机元素的日常。机器人篇大概是讨论的人最多的，大概就是小蓝把暗恋的同事的模样，做成了一个带有半自主意识的机器人后发生的故事。目前剧情进展已经比较成熟了，成熟到笛子已经写不下去了（苦涩）。如果要做成单独的独立作品，其实机器人篇应该接近完结了，剩下的日常以番外发布就好。但绿蓝本身就是日常漫画，也没有专门声明某一系列完结的必要性。\n\n绿蓝部分已动画化，第一季的动画非常优秀，篇幅也够长。第二季是屎。第一季的片头是非常非常喜欢的片头，里面没有一个镜头是从正片剪辑的，而是一个短暂的mv，描述了小绿和小蓝是两位演员，在不同的故事中扮演着不同的角色，他们之间有无限的可能性。\n\n笛子早期的作品比较肝是《你瞎》（全名：你什么都没看见），脑洞非常非常大。也是最开始以中短篇为主，后面慢慢发展出了一个中长篇的故事（有点像卡片式笔记的创作思路，Ne人实锤）。中长篇的故事已经完结，个人感觉也还不错，更倾向于青少年时期的灵感大开。到画绿蓝时，对现实的映射多了很多，我特别喜欢这个时期的作品，是会让人感到“温暖而深刻”的作品。\n\n另外，笛子不是签约作者，她是自由的，也就是不会在没有灵感的时候去硬凹出一般的作品去交稿，也可以看出她是一个对自己作品要求很高的人，能保证她已有作品的质量。但同时缺点就是现在这种情况，容易开天坑…………她没有完结的IP，或者说，她在创作时并没有做让一个IP完结的准备。我并不是说她的长篇作品没有完成度，相反，其实长篇连载的部分完成度都已经到了一个小的完结点，主要矛盾已经解决了，只是让人感觉，“接下来还有故事可讲吧”。但是她也没想好，她是从无数小故事中抽离出了这么一两个中长篇的故事，但更长、更稳定的故事框架是无法用这种方式写的，需要找出故事的下一个矛盾点，然后围绕这个点讲故事，这对于画日常漫画来说是非常难的。类似的例子可以看罗小黑，罗小黑在做大电影前也是零散中出设定，但第二季讲故事开始就非常集中了，非常好看，也显得没有从前那么日常了。\n\n笛子从她几年不更突然冒出来更新一个魔王篇就能看出来，她很想补全设定，为魔王篇接下来的故事做准备。魔王篇是一个明显没讲完整的故事。但很也很明显，她没能想出来她满意的发展路线……中短篇在后期的缺失也表明灵感在渐渐消失。AI绘画火的那一阵她也有拿绿蓝出来画过，和从前一样也是对现实的映射，但总体没什么脑洞，有一种极力想画点什么但再也画不出的遗憾。这个东西就是想象力吧。当人对现实世界了解地越多，越会缺少一些想象。\n\n但我依然很羡慕她，因为我是一个从小就完全没有一点想象力的人，我写出的一切我都得知道我在哪里看过，我借鉴了什么东西，就好像我画画一定要按部就班掌握了所有的基础才会有自我创作的想法。我也不理解怎么有人在不知道要写什么的情况下，可以编出如此细节的非现实故事，简直就像是魔法。后来发现其实有一大部分剧作家还是在基于已有的参照写剧情，只不过代入经验与情感，在时间的磨炼也能写出很厉害的作品。但那些以年轻时的想象力与恣意姿态写的作品永远却有一种旁人无法的特殊，个人风格从一开始就注定，后续所做的只是让它变得更成熟。\n\n在想剧情时，我体会到了什么叫“写作就是把你整个人的一部分完整展现出来，逃都逃不掉”。画画相对是可以不需要自我的，但写作是一定受自我影响的。绿蓝中所有不以吐槽为目的故事都有一个特点——两个主角都不会做出令人讨厌的事，他们很可能完全没有矛盾，但故事依然精彩。即使他们有矛盾，但都不会让观众感到是其中一方有什么过错，是温柔且真实的。但我在处理二人关系时，为了对话有张力，会写出连自己都非常讨厌的人设，就类似于蹩脚的作家写不出剧情张力就强行安排人吵架一些，或者为了让剧情保持矛盾，观众在上帝视角，主角就没 眼睛没耳朵。我所看见的、经历的矛盾，全是一些连自己都厌恶的相处方式，没有两边都温柔的调和。我无法抽离出任何让两方都好的一面，始终觉得，只要任何一方是正常的，矛盾就消失了，故事性也随之消失。全员天使的发展，写不出来。不过其实对于描写爱情，倒是写单恋就很容易做到这一点，但我没有这种经历，看再多作品，也不能切身体会他们的心情。要么很快没感情，要么很快变双向……现实中真的没有去喜欢一个完全不喜欢自己的人的必要吧，类似于没有人会为了你直的硬掰弯，和性别无关，性格不适合的就是不适合。单恋人的受挫能力不得不说，好强的。\n\n我会有这样的天赋论，因为与写作、画画相对的，写歌就不是这样的感觉，能明显感觉在这方面会比较有天赋，好像从小学开始就知道怎么自创旋律，即便只听过那么一点点的歌，也能很好地衍生，学琴的是也是在同样时间条件下学得最快的那一个。在初二的时候，我从没有弹过钢琴，但是在音乐教室，课前和学到8级的同学轮流摸琴弹梦中的婚礼，有一个女生说觉得我弹得比较好，可能她已经忘了，但我记得。再后来，我刚开始接触电音时，并不能 Get，也不是很喜欢，我接触到纯粹是因为便宜，写出的东西我也不是很喜欢，现在看来也有很大的改进空间，但就当时的条件而言，倒也没有很烂，也是得益和群友交流（妈的怎么总在混只有我是女生的群）。后面喜欢日系了之后，弹琴更是喜欢随意弹不好好练（。技术不够会限制原创的水平，所幸技巧上对于绝大部分的流行歌，都足够了。但音乐总体而言是一个非常废钱的爱好，特别是纯器乐，编曲还废电脑。如果当时我不是为了屏幕买Mac，说不定不会画画，而是会一直编下去。\n\n还有很多时候，总觉得人真的会渐渐忘掉曾经的经历与情感。又或者说是，其实小时候大家对于阶级差一类的没什么感觉，但是当能体会到阶级感的一刻起，就会变得无法包容言论差异了。一般而言，受过更多教育的人看问题是更全面的，包容性也更强，但反而是这样的包容性，会被别人看成是一种 privilege，他们无法理解这是privilege，其实也正是一种privilege。举例而言，汉服圈，有的人会觉得“为什么复兴贵族汉服而不复兴平民汉服”，对汉服有研究基友说，古代汉服的形制不分“平民”还是“贵族”，只是用料、工艺、纹样上的不同，不会出现只有贵族能穿而平民不能穿的形制，也没有贵族绝对不会穿的形制，现代人穿的汉服通常看起来“很贵族”，只是因为大家喜欢看好看的。这是实话，毕竟我也买，我买的就看起来很穷酸，妈看了都说别穿了。但是翻一翻b站，就会发现，以“看起来贵不贵”来区分是贵族汉服还是平民汉服的人占了绝大多数很多。基友觉得这些人有毛病，不了解非要来她评论区横插一脚。但我看了一下其实能理解，我第一眼也没注意他们在说什么，但是语气上会觉得基友不太友善在原po下面抬杠，但实际情况是不太友善的基友是在给互关好友评论并赞同彼此的观点，这是属于她们的privilege，无法正确了解情况的人没有参与的资格。她们也许会知道别人不了解，但也只是觉得总是遇到智障来冲评论区并默默吐槽。另外她混汉服圈比较多，会关注到一些我没注意到的事情，比如，额，好多人认为“大唐文化在日本”？她觉得是，我觉得不是，我觉得至少任何一个学过中学历史的人都不会这么认为，不然得反思一下历史怎么教的了。但她说，她妈就是……我依然不信，我妈也不这么认为，可能这又是我的privilege了。还有什么，京城满遗太多，所以发展不起官方汉服宣传。嗯这个我还是挺赞同的，什么地方有阻力什么地方没有，在京这么久没有政治觉悟的也得逼出来一点，京圈在大城市中真的算得上是文化荒漠，大家能融入到一起靠的是淡化文化差异，而不是包容文化差异。不过，在国内，我也没见过什么地方非常包容文化差异的就是了，这样的地方是真的存在的吗。\n\n---\n\n风格不是硬生生的技法，而是技法的组合正给人的直观感受\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[6,3]},{"id":"2023-09-21","content":"\n草，突然刷到 [GPTK](https://www.applegamingwiki.com/wiki/Game_Porting_Toolkit)，可以在mac上直接运行windows游戏，有 Steam 和Epic 的教程。总觉得有亿点点魔幻。\n\n然后b站搜了一圈，前几个月就已经有人拿来运行赛博朋克2077和原神了……7瓦的GPU玩高画质原神，嗯更魔幻了……\n\n翻译一下：[Game Porting Toolkit(GPTK)](https://www.applegamingwiki.com/wiki/Game_Porting_Toolkit) 在 Wine 兼容层的基础上结合了苹果自家的D3DMetal，支持了 DirectX11 和 DirectX12 的游戏。但是用了反作弊驱动或DRM（版权保护相关的技术）的游戏通常没法运行。\n\nD3DMetal具体是个什么东西没搜到介绍，果子特色闭源，只能从名字上看出来是微软D3D到苹果Metal的直接转译。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[6,4]},{"id":"2023-09-20","content":"\n感觉需要扩大圈子，以免赛博社死……很奇怪，被夸会让我感觉负担很重，因为总觉得期望越大，失望越大，特别是当我觉得其实我所做的一切好像还有很多改进的地方并不值得被夸的情况下。当会受到越来越多的关注时，我就不自觉地想把这件事情停止了。明明知道经营个人IP和流量是当今社会下至少可以用作副业的路，但性格和想法完全背道而驰（笑）。要担得起个人形象，要学的越多；要学的越多，越觉得真正厉害的人都不是经营出来的。经营出来的只会给人一种华而不实的印象，算了吧。\n\n---\n\n这是一个长达半年的几乎什么也没做的时期。我开始回想一些仿佛发生在上辈子的事情，虽然不过也只是过去了三四年。如果说人一辈子都是江山易改，本性难移，那这三四年已经让我进入了下辈子。\n\n我第一次感受到什么是PTSD是在2019年的1月，只用不到一个周，听到某个人的名字就会应激、看到和某个人相似的长相就很恶心，提也不想提一句。起因无非是新环境的价值观不合一类的惯谈。如今连找工作都是双向的，但上学不是的，没有实习，没有试错的机会，周期很长，选择主动退出就是异类。就好像18岁前禁止恋爱，一上大学开始要求擦亮双眼找对象结婚生娃一样。本科专业是自己选的，不然在本科期间读不感兴趣的东西可能会发疯，也不知道是幸运还是不幸。\n\n大学开学时，俞敏洪来开学演讲，顺带推荐了一本书，就是吴军的《浪潮之巅》第二版。这确实是一本对行业历史介绍不可多得的好书，但一定角度上也是对于如今的互联网感到悲观的来源。书中的预言现在来说失效了许多，充分映证了人其实没有办法用发展的眼光看问题，因为人无法准确预测未来，开放的架构在走向封闭，互联网精神终归只是程序群体的幻想，人还是得吃饭。\n\n第二次感受PTSD是现在，只要一听到类似于“迁移学习”“数据增强”“Loss优化”“面试xx”一类的词，就会感到一股油然而生的厌烦。这很矛盾，因为我自己平时也常常把专业名词挂嘴边，但听到别人闲聊时说到这些就会烦到突破天际，而当别人带着一腔对AI领域的热爱来交流这些时我更烦了，但又不得不交流，一种堪比坐牢的体验。我对AI的烦从专业本身开始蔓延到了生活中，在大家都在吹大模型大数据新风口时，我边用边骂。很少出现好用的产品不想了解原理只想骂的情况。是什么原理呢？Transformer + 钞能力……目前没有一家公司能复现 OpenAI 的效果，这个东西从出生的那一刻起就是充满随机性的黑盒。「哔~ 您的丹炉天赋不足，建议回炉重造」即便AI真的是很火，现在好好研究一定能吃上饭，我也不会想在这里多呆一分钟了。\n\n想转专业的人又得成绩好，成绩好的人又得是想在自己专业有所成就的人，考王除外。况且在一个本来就很卷的专业，努力考前几名就为了转去一个排名差很多的专业，大部分人看来都是脑子进水。我不是一个会考试的人，不管题难还是简单，我永远都是差不多的分数，因为没有人会像我一样在碰上极简单考题的情况下靠着算错丢掉 30 分，在题很难全年级挂一半人时又因为没算错太多考90分。考研的专业课也差不多，很简单的题，但差点不及格，排名远不如平时成绩排在我后面的室友，纯靠那一年运气好录取线低考上的。总体而言，考试、刷题对我来说是一件很无聊很枯燥的事，我之所以会做题因为题库无穷无尽总有一些不会的东西，我想能理解到全部。但精准套公式算结果，精准地记住每一个时间点，记一大堆三纲五常，非常不擅长。\n\n我曾经在毕业后做ACG，但现在感觉确实太天真了。我不了解二次元，比起混圈只想好好画画。朋友说你可以从头引流接单的，现在画哈基米就可以赚钱，但我无法商业起来。我难以想象为了赚钱而每天花时间在重复固定的风格和题材上，明明最开始画画是发展副业，但越到后来越挑，同一种风格和完成度的极限是三张图，后来不满意这种画法又开始补基础。有时候真觉得以现在能接触到的资源已经做到了极限，即便曼奇助教说你画得已经比我的很多学生好了，但是学生永远还是学生，之所以是学生而不是助教就是因为水平不够。再之后必须要花很多钱和时间抛弃现在的一切去进修，并做好三年纯支出没有一点收入的准备。那时候就三十岁了，已经没有这个时间让我去耗了。家里是很普通的工薪阶层，父母在他们各自的同期同学里都算是混得最差的。我能做的只有独自坚持，没法向他们要求什么，也无法乞求他们能理解我。至少我的父母都在世，已经是万幸了。\n\n不想打字了，现在很混乱，很久没看过文学作品，句子都老长老长的，还喜欢用英文句式。又草草了事了，有空再说吧的很开心没有人关注我。说实话真的有人告诉我他订阅了时我第一反应是吓一大跳。\n\n\n\n\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[6,5]},{"id":"2023-09-15","content":"\n写 md 渲染时无数次考虑重构……封装好的轮子真是好难用，插件生态的版本不一致，光是处理接口一致性问题就要吐了。不管了先加再说。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[6,6]},{"id":"2023-09-14","content":"\n哇其实雨疏发招聘消息过来时真的会有想和雨疏一起工作的想法，但我不行啦，写不了论文啦。长久以来我都不觉得我是不适合工作，只是不适合瞎编。当然也没有很适合工作……但也就一般般啦\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[6,7]},{"id":"2023-09-08","content":"\n想想距离我所熟悉的互联网的历史已经八年了。虽然也没有到跟不上时代的地步，但也有点不想继续了，倒也不是累，而是渐渐觉得没什么意思，起初报相关专业仅仅是自己的兴趣，还有作为一个懒人，觉得好的科技真的会造福人类。现在产品都做得差不多了，每年都有新的概念可以炒，但炒来炒去好像又都是那些。屎山没有因为概念而变得不屎，新的屎山也没有因此减少。八年前不说多好，也算是有个清楚的视野。现在已经看不清前面的路了。我不否认AI在一些场景下很有用，但你们真的觉得AI是风口吗？AI即便能成为成熟的行业，在未来也是垄断大户，倒不是分发便宜和兼容性的原因，而是高成本、闭源、加上随机性不可解释性。这绝不是什么独立开发者和小公司可以承担的东西，这是互联网行业的重工，小模型的水平又明显太差，真不适合炒。\n\n虽然不像炒币是纯粹的不靠谱，但如果真的可以训练到替代人类，或者说至少代替我这样水平的人没问题，现有的体制还不变革，依旧没有养闲人的能力，还是在为卷而卷（现在已经有这种趋势了），那社会真的会完蛋。三四年后再看吧。\n\n我是很乐意看世界一起毁灭的混乱中立派，但其实会精神崩溃的人不太多，比如七年前我是不可能会这样的。只能说有时候不要同时接触太多方面，接触的方向越多，似乎真的越来越感觉没意思。但明明是因为觉得有意思才接触的。反而不如看童话。\n\n我清楚地知道童话是童话，也能清楚地感受到童话对立面的悲惨。2005年的恶作剧之吻，收视很高的台偶，当时我对偶像剧不感冒也没有看，只觉得电视剧难道除了爱情就没得拍了吗。最近又刷到看了一下，发现是个过于美好的童话。童话不是没有波折，而是总能以现实不可能的方式将波折收尾成美好的结局。江家一家开开心心招待湘琴时我居然一直在哭，怎么说就是自己好没良心（？）我好像有他们拥有的一切，但我感觉又是什么也没有。我非常讨厌江直树的性格，网上也有很多人说，江家的环境不可能有江直树这样的孩子。但同时我又非常能体会到，他在老爸生日和家人撕破脸的那一段的真实。他妈这么嗑CP，骗他俩在家。他爸骗他去公司实习，这些情节都太熟悉了，真的在里面不会觉得有一点好笑和幸福，读书是为了能选择，不是为了没得选择。但到头来，发现读不读书其实都没得选择，反而可能读了书更没得选择。因为真的有主观选择的人，不会选择读这破书。在线好友一和我反而到现在非常佩服能选择不读研的人，但他说你显然不是这种人，他说得一点也没错。\n\n感觉写太多了。无所谓哈哈，趁着博客衰退没人知道我是谁多写点。可能等我死后扒出我的几百个账号会被认识的人看见吧。\n\n---\n\n手动把之前的博客搬过来了。也没多少，写格式转换程序的时间都够我搬50篇了，不如 typora 粘贴，还补了一些新的字段。不过要是再来一次我不行了，我选择写脚本……现在来说会有点多了。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[6,8]},{"id":"2023-09-03","content":"\n恶补 [TS 类型体操](https://github.com/type-challenges/type-challenges)。因为每次想写可扩展的库就会发现，笑死，根本不会类型推断。总不能写啥都定死配置吧……说到底还是缺对 any 类型的把控，any就是动态类型，要写类形推断必定是因为有动态类型，在这都不说。像Go这种泛型出前，不同类但同样的逻辑的签名也要重新写一个函数。虽然可以在外层再封装到公共函数里，但调用方式就不一样了，有的方法抽象出来就应该在类上，还是泛型合适。强迫症这样真的很影响写东西，有一半多的时间花在标注上。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[6,9]}]