[{"id":"2023-12-07 04:52:48","content":"\nGawainx 毕业啦，毕业快乐。\n\n另外一位 b 站认识不久的网友也快了。那就提前毕业快乐吧，有机会我也想认识三次元的 enfp 哈哈。\n\n在线好友: 1 今年6月已经毕业啦，要留学啦，读博后啦，恭喜。\n\n本来这里又打了一堆话，算了，为了避免以后社死，还是删掉吧。\n\n祝你们毕业快乐。\n\n> ぼくの善意が壊れてゆく前に  \n> 君に全部告げるべきだった  \n>\n> 夜が降りて解けての生活に  \n> 混濁した気持ち掠れる燈\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[6,0]},{"id":"2023-12-07 00:21:41","content":"\n突然对 logseq 插件没兴趣了……头好痒啊，好痒，得洗头，但澡堂开放时我全程在睡觉。最近睡得有点子过多了，每天能醒不到 10 小时。\n\n喜欢听很萌很快乐的歌。虽然听起来有点变态，但我是很喜欢萝莉音的，不是很刻板尖尖的萝莉音，而是『ユイカ』那样的声音（年龄感再偏小一些）。我也喜欢小女孩子，小女孩子能穿得简单很舒服的那种造型就更好了。我也喜欢听摇滚，和二次元特定风格的温柔男孩子。古典在想提升逼格时会喜欢听，但日常还是想轻松一些。最不喜欢的是节奏重复的土嗨舞曲。\n\n我喜欢不被人关注，喜欢当边缘人，但也喜欢所有的朋友。我其实也很喜欢舔但前提是舔的人不会在意我在舔（于是只能赛博舔网友）。我不喜欢被夸奖，但喜欢被理解。以上，这就是三水的自我介绍了，或者说是事故介绍吧，哈哈。\n\n对了，sansui 其实是三水的拼音，这个角度来说我也是实名上网，但不想被熟人一眼认出来所以去掉了翘舌音，所以我也不知道要怎么读，每次默念都是嘶……233，挺怪的 id。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[6,1]},{"id":"2023-12-05 19:08:43","content":"\n什么都可以是假的，但鸣佐不能（咆哮！)\n\n要不我引入一下微博的表情包吧……阴阳怪气第一名的表情包。但缺一个编辑器嗯……为什么 Typora 不能有插件！（咆哮！）\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[6,2]},{"id":"2023-12-02 05:38:21","content":"\n最近突然很喜欢工具风格的外观，比较紧凑的 UI，细线简单分区的那种。没有太多字体上和间距上的 scale，主打一个稳定和无与伦比的统一感。啊救命，喜好能不能不要一直变变变，已经喜欢无边框的好久了，现在又喜欢回细边框的，审美是一个轮回，其实只要字体和间距不要太拉，看一个 txt 都能看得眉清目秀。\n\n有图标、细线，良好的分区，就足以完成一个耐看的外观了，不用赶时髦，也不用想太多理论。虽然牛逼的平面设计出的 scale 确实牛逼，但大部分时候都是一坨💩。其实论实用性也只要做到干净统一就可以了。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[6,3]},{"id":"2023-12-02 03:04:36","content":"\n好烦现在的屏幕，真的是五彩斑斓的黑。虽然我选产品的时候有专门注意屏幕参数，但果然还是不行，就typora的这个标题，都能看出外框正黑，菜单栏是冷黑，但正文的Next主题灰黑色又发暖发青。就是这个发暖发青，真的绝了，没法好好配色。还是只有高饱和才能压色偏吗…\n\n我眼睛好像对于低饱和变化是比较敏感一点，高饱和颜色看不了太长时间，很难受，经常画出来颜色会发灰，因为选色时老觉得颜色已经变了很多了很丰富了，过几天一看……这不都差不多是灰色吗？？\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[6,4]},{"id":"2023-12-01 06:29:35","content":"\n对了，我终于看完了《齐木楠雄的灾难》，看了两个月……这是少见的越看越好看的日常动画，看完的时候严重戒断反应。两个月来有空的时候就会看看看，睡不着也开着看看很快就能睡觉，因为节奏特别快，看20分钟像过了一个小时似的。看着人物形象越来越立体，我以为他们的故事会一直持续下去，结果就突然没了……网飞原创那一集的结局也非常非常棒，比原作还要好的感觉。\n\n我最喜欢的日常动画还是《在下齐木，有何贵干》。虽然很短，但脑洞真的很独特，下下下下下辈子都想不到的操作。而且总是很暖心，结尾结得真的好！\n\n这两个搞笑动画虽然表面有一点像，但内核是很不一样的。《齐木》比较电波系一点，人物会重置的，所以完结时总觉得他们的世界在继续。《坂本》给人感觉更像有连续性的独立故事，到最后所有的矛盾都很好地解决了。\n\n唯一可惜的是，坂本的作者去世了😭幸好她说她的一生很快乐，这就足够了。目前的在播动画已经成为她的遗作。\n\n然后我算了算动画的经费，只是画的部分，逐帧的画一人一天撑死画两秒（原画+上色的流程），分工的话加上导演编剧分镜后期一原二原中割色指定场景摄影配音……也是一天两秒（可能还不到），质量高很多的两秒。两秒差不多是一个镜头吧，不算长也不算很短的镜头。这么算下来2秒花2万块是再正常不过的事了……真的可怕。如果前期有好好规划，比如导演分镜编剧都是一个人，色指定和场景摄影是一个人（原画真的省不了因为就是时间堆的）成本会更低，但也低不到哪里去，能一人多职的都是大佬……\n\n如果去学动画，最开始会发现，画了两秒，好开心！坚持一个月，积少成多！结果一个月后，也画不过一分钟……而 TV 番组都是20分钟，真的是很大的工程。所以国内很多泡面番，因为做起来真的太难了，投入与回报完全不成正比。\n\n我又想了下为什么动画的投入产出这么不成正比，原因其实在于……画风。摄影作品什么的再怎么调滤镜都是写实风，镜头语言剧本风格改起来又没有改变画风这么慢。声音作品也是如此，也是写实的。如实记录是很快的事情，但创作也就越慢，成本也越高。3D动捕的成本也比2D好一些，但3D也是永远有一种3D感，包括原神。用3D去模拟真正的2D并不会更快。\n\n想起了双城之战，有人问你们的人物为什么就像画的一样，他们说：“We paint!” 他们就是用画的纹理。\n\n2D 永远有一种独特的抽象感，我不认为它为消失，相反，随着具象事物的泛滥，抽象的东西会变得越来越珍贵。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[6,5]},{"id":"2023-12-01 05:56:22","content":"\n更新了 logseq，发现有一点 breaking change，所以主题也更新了一下。非常佛系，也没有看社区，现在越来越懒了……只是他们新加的组件最好不要动。一直在删删删旧代码。\n\n我博客也是一直在改改改样式，也是没有仔细设计，细节上有挺多设计不一致的。比如圆角的弧度对齐……因为从前设计整体是方形，所以 post 的搜索做的是偏方角。但是 memo 整体是圆角的……然后 memo 的搜索框有 border，因为那边信息量比较多，图标也是以线条为主的，没有border反而感觉很怪异。但是其他地方又都是无边框的，唉……设计很难的！要感觉简洁但又要让人感觉不要太空，twitter那样的分块是最好的。可以的话我倒是想抄，但其实也没有那么适合个人博客，因为个人博客的布局是非常不固定的，不是 app，还是很喜欢长文占满一整页的感觉。有个东西叫 usememos，我用不了……树形分类与长文是有必要的，基础的导航也是有必要的，强迫症会比较开心。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[6,6]},{"id":"2023-11-29 03:12:05","content":"\n#工具 windows创建硬链接和符号链接的工具：[Link Shell Extension](https://schinagl.priv.at/nt/hardlinkshellext/hardlinkshellext.html)。安装完，右键源文件，选择源链接，然后去目标路径，右键创建为符号链接就可以了。之前特别烦这一点，因为 pwsh 命令太长，软链接要管理员权限，真的懒得打命令，一直不怎么用。顺便推荐少数派上的[这一篇文章](https://sspai.com/post/66834)。\n\n","tags":["工具"],"imgsmd":[],"sourceFile":"002.md","csrIndex":[6,7]},{"id":"2023-11-28 08:55:10","content":"\n最近要变成高饱和战士了……心态和性格会影响的所有创作类的东西，极其影响，而且性格还会变化，大概是只要对世界一切保持好奇和理解，性格就不会太稳定。\n\n不过也是相对的，比如太不稳定我也学不会画搞笑猛男……\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[6,8]},{"id":"2023-11-26 00:51:20","content":"\n明显我的画技还不足以支撑我使用windows画图这样的神级绘画软件。\n\n\n","tags":[],"imgsmd":["![](https://cdn.jsdelivr.net/gh/NamiLing/upic/picgo/202311260050763.webp)"],"sourceFile":"002.md","csrIndex":[6,9]}]