[{"id":"2024-03-03 23:35:31","content":"\n打开论文但是一个字都不想改，这些💩山真的没什么意义，于是就会疯狂看各种群和社区。已经把常见的群都溜了一遍了，实在溜无可溜，得写了。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[6,0]},{"id":"2024-02-28 17:24:54","content":"\n#沉思  [《幸福的积分》 - 虹线（评论尸）](https://1q43.blog/post/5322)\n\n非常喜欢这个作者的文章。上一个能隔着屏幕能感受到脑电波同频的还是几年前的笛子。  \n\n我确实完全符合最后提出的“不卷的心态”，但这个心态问题不在个人，而是具有“幸福幻觉”的主流会对这样的生活进行源源不断的谴责，压力非常大。从前和人聊天时，我说过即便我做了要求的一切，在外部看起来是稳步推进，但我快乐程度不会发生任何变化，甚至会更糟糕。然后头一次感觉对方，近乎恐慌地挂掉了电话。  \n\n“卷过了就会幸福” 是个根深蒂固的谎言，如果是这样，就会形成奇怪的逻辑——为了最终的幸福而选择一直过着卷的人生。但什么是最终的幸福？大部分人根本不会考虑。直接把“最终的幸福”换成客观的标准（比如一个小目标）逻辑才比较通顺。但本着“人道主义关怀”，以“一个小目标”为终点，怎么好给人洗🧠呢？“还是卷过就幸福了”好使。\n\n\n","tags":["沉思"],"imgsmd":["![幸福的积分 内容截选图片](https://cdn.jsdelivr.net/gh/NamiLing/upic/picgo/202402281725661.webp)"],"sourceFile":"003.md","csrIndex":[6,1]},{"id":"2024-02-28 03:08:09","content":"\n有时候觉得布局是个很神奇的事，每当觉得说说的味不够说说时，只需要把头像和文本的列错开，说说味就上来了。论形式的重要性。好像是从论坛开始，一直都有头像在左边单独一列的认知。就算头像变小了，列还是得保留。\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[6,2]},{"id":"2024-02-25 01:17:01","content":"\n上一篇文章写不完了，但还是之后再说吧。没有很强的目的性的话是比较难完成一件耗时较长的事的。\n\n果然还是比较喜欢和喜欢学习的人讲话。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[6,3]},{"id":"2024-02-22 15:36:59","content":"\n#沉思 为什么腾讯做不出O神一样的二次元游戏？\n\n还在写，一天写不完。这是很长的文章，为博主的浴室沉思答辩，并非严肃论述。~~（因为博主不会）~~\n### 一、什么是二次元\n\n在几个月前，某姐姐说她抓到了一个玲娜贝儿的娃娃，想要送给我\n\n姐姐：“你对二次元感兴趣，为什么不要呢？”\n\n我：“玲娜贝儿，算是一种时尚快销品吧？”\n\n姐姐：“但她是二次元的啊，她很可爱啊！”\n\n是啊，玲娜贝儿确实是一个很二次元的形象，但为什么我会认为她不是二次元呢？\n\n姐夫：“二次元不看这些，要看都看火影海贼。”\n\n我：“对对对，火影！玲娜贝儿她只有个外表，没有故事吧。”\n\n在主流眼中的二次元，可能只是一个很好学的简单画风。真正二次元不仅仅是外观上的改变。二次元是一个内容为主的领域，表现形式多样，包括了文字、音频、图像、动画。很难给二次元下一个准确的定义，但如果说一个作品想要获得“二次元感”，是有个大共性可说的。\n\n> 将精神寄放于创作的世界，与角色共同生活。\n\n……很烂的一个道理，传统的表演、剧作、配音不都是这么做的吗？\n\n是的，二次元感的核心就是这些。网上常常流传着二次元追“纸片人”，正因为纸片人有内容支撑起足够立体的形象，才会让人感到是“由人创作的人”，而非“由人创作的纸片”。相对的，玲娜贝儿尽管是 3d 虚构形象，但她缺乏内容的支撑，更像一个“由人创作的纸片”。\n\n如果硬要把二次元对标一个已有的专业，我会选择对标剧作。\n\n由于二次元和传统内容创作的一致性，现在的人可能会慢慢感觉到：“年轻人怎么都在看二次元”。这恰恰是因为二次元本身就是由内容创作支撑，只不过二次元的题材与表现形式通常更加超现实。在视觉风格上，二次元深受日本近代动画的影响，导致整体呈现出如今所说的“动漫”风格。\n\n中国的二次元游戏在从前有一个说法是：“做给日本人玩的游戏”。这表示着二次元在形式上就是“日本动漫”，连“二次元” 这个名字本身都是源于日本动漫，且并不被中国的主流认可。但请记住，**二次元本质上是内容创作**。如果想再变得刻板印象一点，是**基于角色的超现实内容创作**。没有令人印象深刻的角色，没有好的故事，再 “动漫” 的形象，都是垃圾。\n\n这也可以解释二次元为什么可以和古风很好地结合。古风小说，大部分也是基于角色的架空历史世界，本质上和二次元完全一致。\n\n二次元的画师中，有一类画师听起来是二次元专属，名为 “oc画师”。original character，中文名为原创角色。oc 画师为自己想象出的同一组角色画很多的插图，或是漫画，将自己的情感寄托于 oc 间，一张华丽插图的表面下有属于画师自己的想法。\n\n现在 ai 画画很火，单论画风外行已经看不出区别，但常常会看到一些 oc 画师转发一些 ai 的模仿自己画风的画，评论到 “ai 始终还是 ai”。如果对内容创作本身有一点关注，就会感受到 ai 与内容创作间最大的鸿沟—— ai 是“画皮”，而内容创作是 “画魂”。这个“魂”可以随时延展到其他的媒体形式，比如漫画、声音、小说，不同形式间有着自成一体的和谐，而非生硬拼凑。\n\n至于为何艺术风格是受日本的影响，说来话长，但长话短说：日本过去几十年的文化输出做得太好了。如果不是日本的动画影响，“二次元” 或许就不叫二次元。我个人不认为二次元的本质会没落，在国内二次元没有发展的时期，国内网文界已经是风生水起，每个时代有每个时代的小龙女。但日本输出的动画的风格让如今的“原创架空角色”印象更加具体了。\n\n文化输出是与经济正相关的，但最终大家都能接受才是真的输出。日本的二次元风格与近代越来越概括、抽象的艺术发展史不无关系，也与物质生产力的发展不无关系。细说就是另一个话题了。\n\n### 二、什么是二次元游戏\n\n二次元游戏也无法脱离二次元最基本要素，即“基于角色的内容创作”。从形式上说 rpg 天然容易做成二次元游戏，而 pvp 的角色完全由玩家控制。\n\n一个例子是火影。火影是经典的动画大 IP，但它的手游并不算真正意义的上“二次元”游戏。手游太偏竞技，并不注重角色塑造本身。从没有看过火影的竞技类玩家也可以是火影手游的忠实玩家，同时与火影的动画观众取得不了任何共鸣。\n\n除了剧情塑造角色以外，二次元游戏中的美术占了很重要的一部分。游戏大部分时间由玩家操作，讲剧情的时间相比于影视作品偏少，这时 100% 时间与玩家接触的美术的塑造就要承担这一功能。\n\n二次元游戏的人物服饰大多复杂且夸张，能让人在最短的时间强化对角色的身份、性格印象。在角色设计上有一个很出名的道理：“味不够，就往大了画”。\n\n二次元游戏中的声音演出也起着重要作用。原神的角色时不时就会说话，不同角色根据不同的情景说不一样的台词，能够反复强化角色印象。当玩家下线后，还能记得“今天又被散兵骂了”。\n\n这也是为何二次元游戏总会有很多的“二次创作”“同人作品”，二次元游戏提供的内容需要足够支撑起虚构的角色与世界观。尽管别的游戏也需要美术与声音的塑造，区别在于目的是否是“想塑造一个鲜明的角色”，是否想创造出活的“纸片人”。\n\n而 pvp 的游戏，由于乐趣在于玩家间的对战，游戏角色有着机制美和强度美，但二次元角色需要的“性格、经历、气质”等并不重要，甚至没有也完全无所谓。\n\n（另外，此博客顶部的菜单后方隐藏了一个彩蛋，滑得够快也许可以看到 —— “人活着就是为了卡卡西”）\n\n### 三、腾讯不会做原神\n\n腾讯真的是一家做游戏公司吗？\n\n不是的，至少现在的腾讯，是一家投资游戏公司的公司。\n\n腾讯从社交产品起家，腾讯的手游部门在竞技类游戏领域，发挥自家产品的联动的优势，做出了不少成绩。一个长久的观察是，公司基因对后续决策的影响是非常大的，这点在《浪潮之间》中也有提到。你也许无法预测市场走向何方，但你会对一家大公司的“风格”有印象。比如，当苹果把 mac 视觉设计地更厚时，就会被评价为：“这很不苹果”。不过也有人觉得这只是很不乔布斯。\n\n同样的，如果命题换为“如果腾讯做原神”，嗯……看看[这个视频](https://www.youtube.com/watch?v=8mHJhy_5e3U)吧。很难想象出腾讯会在初期投资一个投入很多、社交属性这么弱、不知道能不能赚钱的游戏。互联网的投资思维，大多是建立在“产品心理学”上的，解决了主流的哪些痛点，如何盈利，是否能与自家产品联动，是否有利于公司的其他部门发展，会不会有竞争，会不有被别的公司抄袭垄断。而内容，或者说产品质量本身的竞争力，对于投资人而言是最不可控，因此会被严重低估的一部分。笔者认为这也是当下互联网的畸形之处。\n\n想像一下当初拿着原神的 demo 去找腾讯，告诉投资人，这个游戏借鉴了一个知名的独立游戏的玩法，之前没有人做过，我想做成手游。投资人也不知道二次元的钱到底好不好赚，问你有什么盈利点，然后你说\n\n1. 预计盈利模式是抽卡，但不抽卡时玩家还是可以通过送的角色很顺利地体验到全部的游玩内容，我们不会通过强度卡玩家进度，但鼓会励玩家变强以获得更多的奖励。\n2. 我们通过对角色的剧情塑造和角色机制设计让玩家抽卡，建立社区宣传新角色的好处，让玩家自己想抽卡。\n3. 游戏有体力限制，但体力不是盈利点，而是为了不要让玩家升级过快。为了让玩家顺利体验到游玩内容，我们会送体力，起码游戏开始最初 30 个小时不用补充。\n4. 这个游戏不需要玩家在游戏里社交，你们给点广告位就可以了。\n5. 我们没有开屏弹窗展示当前的活动，我们选择用小红点来逼强迫症点开。\n6. 我们没有弹窗展示首充活动，我们也没有限时充值礼包，我们主要通过限时卡池，让玩家在抽不到想要的卡的时候自己点进三级菜单充值……\n7. 所有的游戏内容由我们自行设计，我们前期需要大量投入以保证持续的活动。\n8. 我们的渲染是自研的 3D 二次元风格，对标的是某知名独立游戏，和现在手游市场主流美术风格有区别，所以目前很难有人抄我们。我们觉得这个风格玩家会喜欢，美术也是我们的盈利点。\n\n投资人：…………\n\n原神火起来的原因在玩家眼里看来非常简单：“质量好”，并且是一个正循环。最初只能说是一般般，风格与玩法严重抄塞尔达，剧情也写得很单薄，世界观立不住。比如第一章的国家蒙德，整个主城构造不如一个大学的丰富度，机构只有骑士团和教堂，真的足够作为一个国家吗？但在那时没有一个手游戏能抄塞尔达的风格抄得那么像，这点就足够吸引人了。后面以中国为原型的璃月地区上线后，全方面的质量都有了非常明显的改善。内容产出速度与质量足以卷死一切友商。\n\n在开发上，这种完全依靠游戏制作公司产出游戏性、而非 pvp 的模式，是非常消耗开发者的，每个月做一集 3d 动画、设计新角色、新玩法。在软件开发中，成本与功能数量呈正相关，加机制加内容都是巨大的投入。\n\n在14-18年，现在回过头看来是二次元领域发展的黄金时期，任何人只要有比较好的作品都非常容易在这期间获得曝光。18年后越来越多厂商看重了二次玩游戏市场，多小的二游厂商都能获得投资，换皮手游层不出穷（不过后面很多拿不到版号）\n\n","tags":["沉思"],"imgsmd":[],"sourceFile":"003.md","csrIndex":[6,4]},{"id":"2024-02-21 02:19:07","content":"\n我说 everything 怎么搜不到 lime 安装目录，按字母排序也找常常不到，刷新一下又突然找到了。直到我打开命令行，ls 了一下…………这个目录叫 Iime 不叫 lime …… 第一个字母是大写的 i（汗）这就是为什么我的英文无衬线体偏爱用 IBM Plex Sans…… 之前博客也是用的这个字体，但由于数字偏大不好和别的字体混排而放弃了。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[6,5]},{"id":"2024-02-21 01:24:14","content":"\nwindows11 看不了 psd 缩略图这事也困扰了好久，之前搜知乎，软件支持也只到了 windows10。然后也没怎么管，反正我都是会导出一份当预览。然后今天突然还是想解决一下，也不想下载 bridge，于是用英文找了找，reddit 上有人说 honeyview 就有……妈的遇到救世主了！\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[6,6]},{"id":"2024-02-19 03:43:16","content":"\n给冰凌输入法改了个皮肤，名字直接叫果里果气算了。虽然我数值是准的，但渲染出来像素级对不太准，另外压缩后有被染色emmmm……还有内圆角的弧度、序号的排版是没法改的，圆角就算能改也不是外框的 squircle。不过因为实际使用中很小，勉强能看吧。\n\n\n","tags":[],"imgsmd":["![果里果气的皮肤](https://cdn.jsdelivr.net/gh/NamiLing/upic/picgo/202402190342598.webp)"],"sourceFile":"003.md","csrIndex":[6,7]},{"id":"2024-02-19 00:42:23","content":"\n下午坐下没多久开始腹痛，一看果然是周期提前了。  \n然后到 0 点时好了一点，想我又整整一周什么都没做，突然心情变得很烂。一边哭一边打开了论文。  \n然后又开始胃痛了。  \n像是跑步一过300米就整个胸腹岔气了一样，半边的肋骨和腰在刺痛。现在看来果然是岔气了。  \n大概我的愿望就是以后工作时不要被各种奇怪的身体现象影响到吧。  \n\n躺在床上时经常在想，要是可以直接在床上舒服地用电脑。这样躺着时也可以工作（？）  \n听起来有点变态……  \n但仅仅是我受够了想做什么都没法做的感觉了。不论在什么阶段都不会改变。这个枷锁由外而内、由身至心，安上了。平心而论我家真不算真的很烂的家庭。虽然没有多好，但要比烂还是远远不能入围。  \n\n我接触的人大多比我有钱，要么就是容易变得有钱。我并不是想说因为没钱焦虑，而是我本身除了性格以外的所有圈层，都不属于我能接触的。我最好是好好打工赚钱就能乐呵半天的人，旅游开心，买东西开心，打游戏开心。但我不是，我一定要学到我想要的程度才会开心。\n\n之前报画画课时，我只想画完作业，硬拉我出门去野营，我当时真想发疯。抽空画基础作业的时间已经很勉强了，dlc 画都没画。如果我是学画画的，那我想起码得双开课，整天只用画画和吃饭就行了。\n\n报色彩班长时，同学说没想到你竟然为了画画早起……其实画画很累的，而且自学的练习只能说是对技巧性的东西有用，到后面发现环境和良好的美术指导，比练习本身重要。如果再要提高，真的得去模拟画项目了，又要花费巨量的时间。我不喜欢为了没有目的的练习，但一有目的就容易猛练花掉过多时间，因为觉得自己什么都不会。如果连练习时间都不花怎么可能达到专业画画的水准。\n\n真的是开心吗，不如说是安心吧。和我性格最像的朋友也是这样的。不如说愿意和我做朋友的人，都是看中了我喜欢学习，他们也都喜欢学习。如果是更聪明的卷王，也是我接触不到的了，我跟不上。我也不会去硬凹我能力范围外的东西，不是长处干嘛卷。\n\n我并不想顾虑太多事情，容易变得束手束脚。但东亚的教育就突出一个什么都要顾虑。我和我堂弟讲完，真是想抽自己一个大嘴巴子。我发誓以后再也不讲了。  \n\n只要不解决对论文的 ptsd，ddl 就会永远没用。\n\n算算，哭了有50分钟了，这对于我是见怪不怪了，不知道是对于别人是正常的吗。其实并不是很难过。有个网友也说她不太允许自己哭，觉得是瞎矫情，我可以理解。但我纯粹是觉得哭得也太特么久了，影响我干事。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[6,8]},{"id":"2024-02-18 01:19:32","content":"\n关于 #obsidian 的插件： make.md 改变管理仓库的展示模式。我觉得很好。缺点大概是同步起来费流量，iCloud 杀手。对于我而言，基本上算是可以代替掉 dataview 了和 Journal。非常强，可以写长文也可以写碎碎念\n\n关于 #五笔输入法 ：我一直很头痛 windows 上的五笔输入法没有一个可以像清歌那样方便的自造词。但现在发现冰凌五笔输入法有！而且还有一个临时造词功能，对于打词组的用户来说真的是太实用了。只要没有 bug 这个输入法就是我的新爹。\n\n","tags":["obsidian","五笔输入法"],"imgsmd":[],"sourceFile":"003.md","csrIndex":[6,9]}]