[{"id":"2024-08-05 23:28:21","content":"\n才发现代码随想录的题解是相当个人的，废话超级多而且不说人话。KMP那里才完全感受到，一直在套名词定义，但其实直观解释两句就能让人明白，但就一直搁那里套定义，然后为了定义准确说了一堆废话。我感觉自从我做碎片化笔记后就变得不太会写教程了，我还是要努力去变得直观一些，多加一些图！\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[6,0]},{"id":"2024-08-01 17:45:27","content":"\n解决 2024年 windows 只能设置一个字体的应用们的无衬线中文还是优先 fallback 到新宋体的问题：去注册表，`HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\FontLink\\SystemLink`把 Microsoft Sans Serif 中 SIMSUN.TTC 那一行去掉……服惹 win7 就有微软雅黑了留着宋体 fallback 干嘛……还是说他们也知道微软雅黑的正文阅读体验很差劲……但宋体不搭更差劲啊！\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[6,1]},{"id":"2024-07-27 12:46:49","content":"\n找工作真，真难。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[6,2]},{"id":"2024-07-26 00:56:31","content":"\n微软的那个 noble scarlet，汉字部分据说是方正兰亭黑Pro，但今天把几个网红正文黑体拿来对比了一下，就网传版本来看，只有非 regular 字重基本像兰亭黑 Pro，regular 像是调整过中宫的微软雅黑，和兰亭黑 Pro 有显著的差别……是说经常感觉一加粗怎么小了一圈。整体还是最看得惯苹方只是字重少了点。\n\n一个若智的锐评：\n\n1. 思源黑体系列，风格不太统一，字一多了感觉在各写各的，大字时更加明显。比如看“易”的两撇写法非常机械直几何化，“因”的中宫和笔画也是怪怪的。但在开源黑体里就是最好的了。更纱黑体的数字比思源原版搭一些。\n2. 汉仪旗黑系列（米，菊厂），小字会显得更圆，非常国产 UI 味，大字时尤其 UI，用来看小说会缺少人情味。\n3. 方正兰亭黑，汉字看着很舒服中正，数字太夹了。\n4. 微软雅黑，依然是大中宫和小字间距问题……\n5. 苹方，偏细，缺少字重，除此以外完美。\n\n\n","tags":[],"imgsmd":["![网红正文黑体](https://img-cf.sansui233.com/imgs/2024/07/202407260100518.webp)"],"sourceFile":"003.md","csrIndex":[6,3]},{"id":"2024-07-25 23:11:48","content":"\n最近一到晚上就容易哭，看曾经的照片也很容易。一是从没感觉到原来时间可以流逝地那么快，二是因为我猛然意识到我再也找不回那种很想做一件事情的感觉了。长久以来，一切自以为的个人意义与价值被无尽的论文写作与社会性焦虑所消解，传递出“没有文凭你什么都干不了”的话。或许一直在工作的人不会这样认为，认为这是个思维陷阱。但这种无价值感反而只有长期没有进入工作产生才会产生。我大概就是那种不工作或不能帮到别人就会觉得自己毫无价值的人，不管网上努力说这类人要多在意自己多考虑自己想要什么也没用，大概放到原始社会是死得最早的那类，真感谢投胎到现在的家里让我活到现在。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[6,4]},{"id":"2024-07-23 17:08:36","content":"\n两个月前上了下平面设计课，然后听了几节曼奇的插研，感觉有点理解完成度是个什么东西了嗯……也全是点线面的平衡。然后算是知道之前觉得怪在哪里了。以及字体方面感觉汉字的无衬线还是和没有情感的英文搭比较好……除非是 colorful 的有很多图形为主的。纯汉字的视觉还是用方正的感觉比较不会出错。这时候就知道为啥这么多地方爱用 Inter 了……每个平台看起来效果都不错。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[6,5]},{"id":"2024-07-19 08:21:35","content":"\n忘了竟然回退了我焯……抠了下长文里面点击图片放大的动画 FluidBox，超，超有意思。大概就是 style 存 state 然后 setTimeout 做K帧。感觉 4 帧以下都不太需要用库。遗憾的是如果要保存需要两个 img 元素一起用……每张图都渲染两个，感觉好浪费。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[6,6]},{"id":"2024-07-09 16:35:44","content":"\n关于“作品”。\n\n我似乎一直写编程上贯彻了“做一个完整的东西”这件事，即便是简单的东西，也是完整的。需求分析-方案选择-设计与实现。但没有在画画上贯彻这一点而是一直在练基础。换句话说，我对画画最终要画到什么成品的程度是没有概念的，因为我不知道能用到什么地方。但是写代码完全相反，我非常不喜欢单纯刷题，都是做的过程中遇到什么不会的再补相应的基础。这有好有坏，好处是对系统的体系流程了解是相对完整的，坏处是一旦不再有需求，就会什么也不想写。所以其实能接到需求对自身的行动力而言还挺重要的，什么天生乙方圣体。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[6,7]},{"id":"2024-07-09 15:28:35","content":"\n感觉越来越少折腾服务器了，买了四五个后也没什么意思，没太多需求，为了减少维护成本，都采用挂机自己重启过期自动续 ssl 的方案各种服务间耦合超少的方案，各种 saas 也很靠谱，大半年后想起来要维护一下时完全忘掉了……但永远会有人年轻，永远有人在折腾服务器的路上。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[6,8]},{"id":"2024-07-08 19:26:22","content":"\n搬家了，又开始刷题了。大概会在找工作前把这一切删干净。不断传播绝望与怨气，含沙射影，给不出解决的方案，我不想再听这些东西了。总之想找回我喜欢的一切，已经被这些破事折磨太多了。我想走的路很可行，很有逻辑，也很现实，可惜不是不会受人影响的那种人，不然早在五年前就会开始工作了。\n\n最近和雀雀联系多一些，相似的情况真的家庭因素也很大。我劝我妈学习，做现在能做到的事，她不，她说她看不清，她身体不好只能苟且活着。我仿佛呆在一个死气沉沉的养老院，没有一个地方看得现未来。\n\n一旦跟随不上大流，一旦考不上公，人生就已经毁了————我本并没有这样的想法，可每天被传播。陈 sir 说是你惯的，是你想让她影响你，你为什么这么容易受人影响。不是的，不是所有人都是你，不是所有人都能这么阿德勒，我天生如此，为在考虑自己前先考虑别人，会在没有足够的经验与理论支撑时摇摆不定。即便有，那点可怜的经验也会被碾成碎泥，我承认自己真的很容易被PUA，但现在已经改进很多了。\n\n对了，关于我闺蜜的事，我再也不想跟她讲了，我分享的任何东西最终都会被用作说教的工具。她在自己的逻辑下编造出自己认可的因果关系，并借此反复 PUA 我。我后悔了。我真的从今天起一定要记得，她是甲方，是那种不明所以就会来掺和你一脚的网友。我不要再被她影响了。我不需要这样的家人，承认我生命缺亲情没这么难，不要和任何不能理解你的人推心置腹。\n\n好的，我答应了自己还答应了别人要做题的，少说两句吧，现在开始写。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[6,9]}]