[{"id":"2023-11-25 22:13:15","content":"\n我有一个收藏夹专门收藏个人博客，特别是自己写的页面的。\n\n很多人很有个性。我很羡慕，我做不到。\n\n文字的力量非常强大。如果你的标题像是在写诗，再配个非常简洁的界面，怎么样都很好看。比如[它](https://bouquetrender.github.io/blog/)。\n\n如果你的图片很高级，文字不多，也会很好看。\n\n我也想变得好看！但是话太多了，表达欲是比较过剩的。只是有比较多的方式去表达。不一定非得说话。\n\n我不太喜欢在现实中说太多话，倒也不是说有社交恐惧一类的。我不想要我说的话对别人造成任何影响，但和人交流就是在不断造成影响，我对影响别人和被别人影响这个事情恐惧。言论可以让人思考，也可以让人失去思考。\n\n还有很多时候，说一大堆话只是为了说服别人，或者说是证明自己。我也一点也不想说服别人或者用言语证明自己一类的。对着琳琅满目的简历除了厌恶已经没有其他感觉了。小时候会羡慕简历上有一大堆东西的人。但现在觉得很烦写成这样。满足要求，够用就行。\n\n我不知道有多少人难入睡是因为一直脑子在重复一些没什么意义的思考。我很羡慕可以一秒睡觉的人，我做不到。\n\n我想起了那个身体永远停留在13岁的小孩子。他今年应该22岁了吧。我想去看看他，不知道他是否在世。也不是出于同情，因为他很有趣，从小就很有趣，少年老成。我觉得这样的天才不应该遭受到老天爷这样的对待（脑部相关的手术失败导致的问题）。得庆幸现在有b站。我不知道他在做的是什么账号，但是这样应该有很多人会看到他。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[7,0]},{"id":"2023-11-24 05:39:50","content":"\n图片浏览器移动端的交互手势重写了啦啦啦，成功做到了可以看长图！并且流畅度全程靠 css 动画！帧率感人！我对 css 动画有一种执念，性能上的执念可能是，再烂的 css 匹配性能都比 JS 好。JS 的动画一般 chrome 上都还好，safari 真机测试时开始掉帧，整个交互说好听点就突出一个灵活，说难听点就是乱飞。\n\n没有用库，很臃肿，而且要实现我要的方向锁定的功能也还得再封装一次。自己写下来交互没那么全，但够用了，毕竟打包大小 1k 不到啊！高度内聚啊，没有多事件冗余啊。\n\n之后要写一下 zoom，还有 zoom 状态下的拖拽。不过其实不是很有必要，基本是网页端屏幕太大的时候会用到。\n\n参考了微博移动版的的图片组件事件绑定逻辑，对于 react 的事件绑定也看了use-gesture 库。我真的想了很久很久传统的 query 要怎么绑定，因为 react 是没有办法检测到 ref 值的变动的，也就是没有一个渲染完成的时机，传 ref 的 current custom hook 也压根不会触发刷新，毕竟 useEffect 也不会刷新。监听 onload listener 也许可以，但他妈有的组件是 lazyload 啊！比如这个问题：[What is the easiest or recommended method to add a copy code button?](https://github.com/orgs/mdx-js/discussions/1948)。在原生 dom 上很好实现的东西，在 react 上堪称世纪难题，最正确的做法还得是自己写插件……我操了，我真的操了。\n\n所以当我想“绑定完一个事件后再绑定其他事件”，想用 ref  时也是一个完完全全的“我操了”。后面看到 use-guesture 库的绑法，fine，真的很奇葩，很 react，但 work。完全不是时间序的东西，后面慢慢改改改，逐渐有了分组绑定的思路。个人觉得交互事件比较重要的一点是需要使用外部的 state ，只有输出刷新页面的数据才放在组件内部。不然改个内部状态就得重建一个函数就重新绑定……还玩不玩了？\n\n到现在我拆复杂的hook，都没法第一时间完全想出哪些状态放外面哪些状态放里面。把 search 拆出来时拆死我了。很多东西拆了其实也没有地方复用，一般也只有框架类的才有机会复用，只是为了看起来清楚一点。就比如拖拽手势，虽然理论上是可以到处用，但我也是真的想不到还要什么地方有加的必要。而且图片浏览的拖拽实际上也比一般的拖拽要复杂，只是拖拽倒是很好实现，但有方向锁定，自动回弹，复合点击判定、结束事件一类的，用库也要再封装一次，还要加新功能只暴露出需要使用的部分，更重要的是 css 的配合，又不想再引入个react-spring。如果是工作而不是个人博客，我倒是很情愿开发用库的。\n\n另外，看代码看到这一行时，笑了，好抽象，又带着一丝合理。\n\n\n\n\n\n\n\n","tags":[],"imgsmd":["![](https://cdn.jsdelivr.net/gh/NamiLing/upic/picgo/202311240640679.webp)"],"sourceFile":"002.md","csrIndex":[7,1]},{"id":"2023-11-21 00:57:14","content":"\n#工具 [BundlePhobia](https://bundlephobia.com/) 查看库的打包大小\n\n","tags":["工具"],"imgsmd":[],"sourceFile":"002.md","csrIndex":[7,2]},{"id":"2023-11-21 00:42:14","content":"\n大概是换了电脑，我很久没用过 logseq 的暗色模式，结果现在发现可真是……五彩斑斓的黑啊！我觉得是 dell 这屏幕的显色有问题。同一个色相调饱和度从绿色到紫色，数值调了 1 都看得出来……要准还是专业显示器或者苹果吧。不过果子不同产品线设备的色偏也是挺严重的（我觉得\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[7,3]},{"id":"2023-11-20 19:34:18","content":"\n想要变得可爱！\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[7,4]},{"id":"2023-11-20 05:30:40","content":"\n我草草草，原来是mdx.js 的方法打包完有400k………当入 unist 这一圈时，打包体积就已经下不去了，解析速度也是。这东西其实真就不适合给网页前端用的……我看了下别人的，在想能不能分离，把 html 部分提前渲染，JSX 最后单独注入……但这样也还是不行，因为我是要 CSR，还要去兼顾搜索的数据……头痛，有没有小一点的库。还是SSR好…我改ssr试试看\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[7,5]},{"id":"2023-11-19 19:02:29","content":"\n[zustand](https://github.com/pmndrs/zustand) 好好用好好用…… 属于是理想的 use 外部 state 的方式了。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[7,6]},{"id":"2023-11-19 06:09:27","content":"\n昨天是靠褪黑素睡觉的，今天真的睡不了一点。\n\n大概是我无法忍受我一天啥也不看的感觉，个人的事情做起来太容易没日没夜的了，我又要订计划了。最近变得不是很想嗑cp，大概是无法靠画同人调整作息了。但我想看一些书，永远有想干的事情。\n\n齐木楠雄的灾难，我看了一个多月了，每天都说看一集，还是看不了，看20分钟视频跟完成任务似的。\n\n再见博客。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[7,7]},{"id":"2023-11-19 04:29:12","content":"\n笑死，什么叫程序恰好能跑通，靠 bug 跑通吗？写程序从来没有靠运气跑通的说法。自己不能完全理解怎么运行的，项目运行起来的核心依赖了什么东西都不知道，兼容性的核心是怎么做的不知道，不想去了解，更新核心导致依赖不兼容，没出问题就叫恰好能跑通，出问题就叫烂代码，够牛的……有问题先debug而不是抱怨有bug竟然一个难得的品质。不能接受bug是常态，不想debug，从来靠命跑通第三方项目的人不适合维护程序，又没KPI又不挣钱，洗洗睡吧。\n\n我觉得人家（原作者）代码不管结构和结构已经都写得够清楚了。唯一缺的就是没有公开的测试。测试挺重要的，自己用不到这么多内容，考虑不了那么多的边界条件，又永远不知道来自互联网的内容会有什么bug……写10行代码写100行测试，还要起测试用服务器和mock数据，就问你，一个人写累不累……\n\n我最近也是越来越不喜欢更新依赖了，每一次更新都要去处理兼容性问题，不兼容就是版本回退。还有尽量少用在持续更新的小的第三方库，我宁愿照着再写一遍，有bug也好改。\n\n不过说来其实大部分项目开头后不重构都是屎山，如果开头的架构就非常好了，那就是工程经验和产品经验都很丰富的人。而且就算都是有经验的人，也会根据习惯认为另一种有经验的东西是屎山，没有必要……在我接触JSX，css-in-js 和函数式组件之初，我的天哪，这不是很容易写成屎山……但其实也就是不了解而已……虽然我还是很讨厌 JS 和 TS 的类型推断，但明显随着使用时间的增长觉得，函数式还是挺好用的。但是对象有对象的好处，如果没有 this 指针问题我还是会用 class。除了 css-in-js，这个我现在还是不喜欢，我还是更喜欢 CSSOM。tailwind 这类挺好的，除了要多记些东西（我从前可不是这么说的）\n\n我现在正处于到处是屎山的状态。并且我自己每一年的习惯都有点不一样，还可能看了某个库的架构感觉真好，想抄，导致改着改着后发现全变成了屎山……我也不是很想改了，现在心态就是，看得懂，任何时候可以捡起来维护，能用，就行。细节有空再说吧，又没有KPI。少更新依赖真的……\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[7,8]},{"id":"2023-11-18 21:05:52","content":"\n温知识：shift + esc 可打开 chrome 的任务管理器，查看各个页面和插件的 cpu，内存，网络，pid 等\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[7,9]}]