[{"id":"2022-11-24","content":"\n真他妈烦，400 字不到就可以说清楚的架构，为什么要用 1400 字写？多出一堆废话有意思吗？难道答辩组老师会没学过 ML 基础吗？知道的人都知道是怎么回事，能简明的大白话说的非得说成任谁看了都得吓一跳的诘屈聱牙的文字，淦。\n\n一个小时过去了，用尽全力编了 400 个字。还剩 2500 字和 5 张图，ddl 还剩一天，时间效率为 50%。熬夜吧，熬夜也不一定有用，狗屎写不成金子。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[7,0]},{"id":"2022-10-27","content":"\n首页：樱井孝宏出轨十年。哦又是什么不认识的娱乐圈……啊谁？？ 555梅林你怎么这么惨，被削弱后还拿出来抽，现在声优也塌了😭\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[7,1]},{"id":"2022-10-19","content":"\n刚用 Rust 起一个简单的 webserver 服务器用……麻了，好麻烦。交叉编译都有 rustup 了，为啥还要自己手动配置 linker ……自带库都偏底层，封装得比较好的库都在社区需要一定程度熟悉，还有很多轮子没有。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[7,2]},{"id":"2022-10-15","content":"\n昨天在 Reddit 上吃完了 Stable Diffusion 社区的瓜……好……好精彩……真是抓马……很难说谁对谁错，站的角度都是自身的利益相关，对于想创业的人遇到AUTO这样的黑客（广义）自然会非常讨厌，但在普通人角度肯定会更喜欢AUTO这样的人。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[7,3]},{"id":"2022-10-12","content":"\n1. 感觉论文看久了，已经忘了写工程什么感觉了。虽然说还是在Colab运行一些python，小爬虫也要用啥就写啥，写起来也够简单，但我一直不认为 python 适合写工程项目，它更像是一个给用户用的 App，我连发布的兴趣都没有，一堆小脚本有什么好发布的，虽然可能有人确实会用到它，但也不想自己的仓库里被这些赶一时需求的小脚本充斥，并且又要花时间去做宣传、提升别人使用的体验，总体来说不是那么喜欢一直混这种圈子，混过知道是怎么回事，不是我想要的，就可以了。\n2. 感觉过程的简洁与需要高度自定义的工程天然有一些互斥。毕竟工程上造轮子还是比较重要的——如果你期望自己的项目能减少维护成本，不想在下次维护时显示一大堆的 deprecated，也不想在项目越来越大时因为众多依赖问题变成代码屎山。\n3. 如果需求有剧烈变化，技术肯定也会激进地变化以适应新的潮流，这个无法改变（而且强迫症会喜欢用新的东西）。再者，没有需求也会创造需求= =提升效率的方式大体来说有两种，一是在一套什么都能干技术上吃到底；二是学习更新的、能快速应对新需求的技术。很难说谁好谁坏，到最后能留下来的还是一套抽象的整体思路与经验。\n4. AI绘画最近火了，主要是冲击到了商业二次元圈子。其实我觉得还行，毕竟那种风格我刚买板子两个月就能画，做了个蕾姆的作业首次被问约稿（但当时日语我看不太懂……）只要按照流程画，有合适的参考图，一定能出那样的效果，但比 AI 慢多了。商业的画风需求就是那样，怎么画出高完成度高精度的图，是非常成熟的、流水线东西，真正有价值的设计感、美感是需要长期培养的，自己探索的过程非常漫长，而且没有商业风格那么好看。但我感觉我的基础确实在变好，也对于当初的目标“有镜头感和故事性”更进了一步，也由于时间和基础限制，完成度始终上不去。是不是应该补一下结构素描……而且因为这我给 colab 充钱了，发现我也不是很喜欢玩，就是纯粹的抽卡游戏，不知道生成来干什么，当参考好像又不如找人画的原图。\n5. 想出一个测试题，看多少人能分清 AI 画的和人画的。但又觉得，还是先写毕设吧。每次想做什么的时候，就是一句，“还是先写毕设吧”……无奈。其实如果以正事做不完为理由，有的事就永远没法做了。问题是情况比较特殊，这个正事是属于我没办法集中精力去做的，经常坐了一下午也就集中不到 20 分钟的精力，真正在产出的时候也就那么几分钟，要是是能够好好投入状态的工作也不至于这样，从前双开三开也不是没有过……所以一定要找喜欢的工作，讨论的气氛也很重要，工资和待遇都是其次的饿不死就成\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[7,4]},{"id":"2022-09-30","content":"\n如果不移动办公，用是单独的显示器，下一台电脑想买 win 了，macbook 实在性价比太低了，还有一些打死也不会出 mac 版的软件。CSP 从买断变订阅的操作实属背刺到我了，主要是买断也不便宜，当时 6 折买的也花了 800 块，这买了不到一年，大版本就要变订阅，而且订阅价格也是不便宜，ex 一年 1400，pro 一年三百……我不如用 sai2，15 块拼车买断使用。而且 PS 也不是不能用只是现在的电脑用起来太卡了…… iPad 挺好的就是颈椎病……\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[7,5]},{"id":"2022-09-14","content":"\n不论是战争，又或者是研究，人们好像看这些都像玩游戏一样，只剩输赢，只剩攻坚。作为人的生命与对精神造成的影响仿佛是只像机器上的零部件一样看待。没有做过实际工作的人总是喜欢“运筹帷幄”，做出一些不切实际、不考虑“人”的安排。我希望我永远不要成为这种人。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[7,6]},{"id":"2022-09-09","content":"\n从闲鱼收了个同城的 Midi 键盘，Nektar GX61，算上运费 700 块。\n\n1. 小厂质量不怎么行，回来试了一会儿发现中央 C 有问题，有时候会出重音，大概率是进灰了。本来想拆开修一下，结果后盖有个锁结构不让拆，只能寄回维修点，算下来维修成本至少 300。还是不要在海鲜市场买东西、保修期、老化程度什么的都是很值钱的。\n2. 卖家说没怎么用，我觉得这倒是真的，因为积灰挺严重……\n3. 之前用的两个琴都是雅马哈，真的不太适应这个琴的力度，无配重但弹簧又比较紧，导致要出轻柔的声音都得要大力。虽然按起来手感还行，但力度和音量不太匹配，这个角度上说还不如买手感更塑料一点的。。\n4. 对 nektar 印象不太好，可以说是卖服务的，键位 map 要用产品序列号注册后才能下载（差不多是杜绝二手了），不然自己手动调。以及不能拆只能送修，200 块一工时，不含邮费，挺贵的。\n5. 700 块，要什么自行车，就凑合用用了\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[7,7]},{"id":"2022-08-25","content":"\n今天的话题是存储危机。\n\n2015 年的 9 月，当时冲着不用校色的 retina 屏幕，买了最新款的 Macbook pro 2015。mbp 一直是高价低配的代名词，但对于移动办公且对色准有要求的情况下，mbp 无疑是最好的选择。后面发现，它也挺适合软件程序员。非常幸运盲狙没有出错，恰好这一个小群体目标客户。\n\n但随着使用，我感觉正变得逐渐不够用，问题就出在……存储空间。\n\n早年的 MBP 16 寸也就 16G 内存 512G SSD，当时装配的台式机普遍是128G 固态 + 1T 机械，全固态的价格可谓是非常奢侈。在如今全是 electron 内存杀手生态下，8G 内存 256 G 硬盘仅仅支持只办公用，完全无法达到 \"Pro\" 的要求，我不清楚苹果的 Pro 产品线怎么还保留了这个丐版型号。\n\n如果有以下任意需求，储存空间都会变得异常紧张\n\n- 大尺寸位图图片合成，单张 100M+。\n- 音乐制作，必须长期外接硬盘软音源。\n- 视频制作，一个库能手动清几十 G 的缓存。\n- 客户端开发。Xcode 本体已经从 7G 变成 20G。如果做跨端， 各平台的 SDK 和 simulator 全部安装一份，开发前再占用 20G。\n\n我常常想去 contribute 代码时，都会被大仓库所需要的环境配置劝退。如今的 Mac 仅仅保留了最基础的软件和数据，经常都在全硬盘目录扫描删东西，已经只剩不到 30GB 的空间。\n\n2022-08-29：于是我一个京东紧急下单，换了1T个ssd……幸好这是 Pro 产品系最后一个能更轻松换硬盘的型号。 用的三星 Evo 970 plus，目前来看非常完美，网上说的什么不休眠、睡死、掉盘、没法 recovery、发热严重之类的全都没有遇到。唯一的问题可能是 spotlight 又在重新建立索引了，风扇好吵……\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[7,8]},{"id":"2022-08-23","content":"\n无可救药的控制欲\n\n（长文发泄警告）\n\n去年这个时候，我刚开始做自己的前端项目。再过一个月，到秋招的末尾去投简历。\n\n这个时候学校可以留校，因此我没回家。当时爸妈轮番做手术也没有回去。自从读研以来，家里关系差到了极点，现在看来这可能是每个病态的家庭都需要经历的时期。在当时，我妈对我的态度只有一个——生气。\n\n生气肯定是我惹到她了吧。为什么生气呢？我不科研，我非常不喜欢我导师，我的业余时间在她看来全部花在了画画上。在她的视角中，“画画”是无用的，或者说一切基于人类想像且她无法理解的事都是无用的——不仅仅是现实意义上的无用，而是是精神意义上的无用，她觉得所有艺术家都是精神病，并且坚决地认为我审美差劲没有天赋。\n\n当然我真的是在学前端，最后面试通过了，所以后来她知道我在学习——大部分人其实都是这个逻辑，以结果来替代过程。如果我没有过面试，她八成会觉得我根本没有学习，我是在画画。即便我拿得出我做的东西也没有用，因为对她而言是“无用的”。\n\n我的本科专业是通信，研究生是大数据，实验室很杂，每个人做的都不一样，也没有说是主要 nlp 主要做 cv，因为导师的方向和这两都没关系，做隐私去了，但让开题还是随便开。这对我来说不是什么好事，兴趣原因我还是更喜欢设计与开发，和科学研究没有什么关系（虽然炼丹和科学研究也没有什么关系）。然而，我妈认为我的专业可以干的是制定 5G 标准、电路设计、制造芯片、设计机器人、开发全平台软件、开发游戏、后台维护。上次她刷抖音看到限 EDA，问我 EDA 是什么，我说不知道，“你学这个的怎么这个都不知道”。\n\n因为前年实际上我没有按期开题，所以其实我面试不管面得怎么样，都不太可能按时去上班。但是由于面试结果还可以，再加上没有看到我有画画，之后的那个寒假她没有生气。\n\n今年不同了，我没有写任何新项目（用 React 写博客不能算吧也太简单了），因为被疫情被早早赶回家。如果我打开电脑，页面不在学习上，就会被骂“你在这纯属浪费时间，不如去找实习”。甚至常常她走进来时，我刚好切了个窗口，就会被说“你就防着你妈，不让我看”。所以你看，我有没有摸鱼根本不重要，摸鱼就是被骂，没摸鱼就是被怀疑摸鱼，四舍五入我一直在摸鱼。\n\n现在我妈天天刷抖音，看了很多“失败孩子”的案例，认为我“故意拖着在家玩，啃老，无法融入社会”。我真的解释都懒得解释了，只是非常伤心，觉得这些情况真的无药可救。我今年做了什么？放弃掉开发，只看论文，gap 了一年。她觉得我是什么？不能融入社会、对象也不找、实习也不做、只会啃老、此生没救了。我是她的教育失败品，是“不听话”的产物。\n\n有一个姐姐，她考研考了三次才考上，英语始终差点挂。我妈很为她的精神感动。如果这个事变成，“她毕业开题开了三次才过，idea 始终挂”，她就从一个感动中国的榜样变成了无可救药的废物。我觉得，如果换成是我，考研考三次，英语还是那么差，她肯定在第二年开始觉得，我是专程借考研的幌子来啃老的。\n\n很多时候我妈骂我性格和我爸一个样，经常说我是“龙生龙，凤生凤，老鼠的孩子会打洞”。实际上并不是这样，我和我爸极少交流，但经常对我妈的举动有着同样的反应。这不是遗传，这种相似是由于“我妈”的存在而产生的。她一讲话会本能觉得她又开始命令你跑来跑去，或者她开始阴阳怪气拐弯抹角骂你。她一开口基本不会说有趣的事情或者好的事情。我真的讨厌这样，所以我尽量开口说有趣的事，但没人觉得有趣，这让我觉得很挫败，还是不说话了。\n\n很多人会对别人有才艺很羡慕，但是这只是表面，如果你的孩子真的花了很多时间学习才艺，你只会觉得他在不务正业。我在这个暑假把钢琴即兴的书摸完了（已经看了 5 年了），但每次晚上去弹一会儿琴，她就会在一旁唉声叹气，说我是没目标的人。这是现实，大部分人只会认为，只有“务正业”才是目标，你在兴趣中对自己小小的激励与成就感，屁都算不上。你越对生活有其他兴趣，你就越是没有目标。\n\n小时候学琴的时候，她还给我定时间表。大部分家长可能都会为孩子不练琴而头痛，我家从没有这个问题，因为她定的是“每天晚上练 15 分钟”。学过钢琴的人就知道，15 分钟根本就不能叫练，最多是热身完。15 分钟就是她认为的小孩子应该有的娱乐时间……其实这连娱乐都算不上。如果娱乐时间大于 15 分钟，就是“生产队的驴都不敢这么歇”。当然这个表从没有执行，执行得了才有问题，可能早早就疯了。\n\n小时候的电子琴老师觉得我很有天赋，跳了两级的班，成为了全市第一个考十级优秀的人。后面我就没有学了。人们对才艺的要求大抵如此，考级完就完了，继续走专业就会被打。如果成绩好还去艺考，如果不是家里非常开明，多多少少会有些不同于常人的叛逆。我显然不是个喜欢叛逆的人，所以对这些情况只会感到痛苦而难以改变。我现在可以即兴弹奏任何我记得旋律的流行歌，但对我妈来说，我是“从没有弹完一首完整的歌”。即兴能力对于她来说毫无意义，你只要能流畅演奏一首献给爱丽丝，效果远远超过“即兴演奏任何歌曲但没有爱丽丝好听”，尽管后者的努力需要前者的数千倍。\n\n实在是在家里呆太久了，太久没有外界的反馈了，只有我妈一个暗示我做的事情没有用，我现在觉得我学的一切东西都是毫无价值的。本来我学习也只是为自己，如果只是自己一个人，我也能很好坚持下来，我自己能给自己很好的反馈，本来也是实用主义者，知道我学的东西能有什么用。但有我妈在，不行，只要不按照她的预期，就是没用。\n\n我妈妈也一直不受亲戚小孩子的喜欢，简单说来就是管得太多。远远看着很好，离她越近的人就越会受到她的伤害。我觉得我不想找对象也有这个原因，离我越近我会越疏离，我不想再在这上面受到任何伤害了。\n\n我想出国，虽然各地有各地不同的矛盾，但我只是想看看有没有哪个地方文化能包容一些，远离一些有毒的人。\n\n------\n\n最近有花 12 个小时去抠一张画，发现就是时间决定的完成度，基友说我终于觉得你可以去接单了。我只能说画画要抠细就是靠肝，老累画这么快的江南百景图那张都画了45 小时。平时我都是限制自己只能画 2 个小时，常常又十天半个月也不会想画画这个事，导致只能不断画简单的东西。具体来讲我个人是这样（插画类，不带设计和中途改稿）\n\n- 1 小时 - 只能起草/速写\n- 2.5小时 - 一般大头图的成稿（我一般能接受的画画时间）\n- 8 小时 - 简单半身图的成稿，或者人物带简单背景图的最终细化之前，俗称草稿插图，简称草插（完整摸鱼的一般时间）\n- 14 小时 - 一般复杂图的细化（立绘细化完的一般时间）\n- 20 小时 - 极其复杂图的细化最低时间（商插的最低时间）\n\n要安排一个 20 小时以上的复杂画面是非常困难的，简单说，前期的起草/构思就决定了最终需要细化多久。一个略显简单的草图很难细化上 14 小时，决定你当前水平天花板的，是前期的草稿能力。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[7,9]}]