[{"id":"2023-12-29 15:13:31","content":"\n一键查询热门无头 CMS： https://jamstack.org/headless-cms/\n\n我还是在想要不要用数据库，对我来说博客内容确实是Typora 就够用了，管理也方便。但人，就是如此的，三心二意。昨天改改改，算了，还是用回第一版吧。大概需要写总结一下当下数据库托管方案，脑子乱糟糟的。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[7,0]},{"id":"2023-12-27 18:09:43","content":"\n关于笔记 #工具\n\n有一种印象是国人很爱折腾效率工具。我也是只要是出的笔记工具全都有用过，但是说来真正有长期用的，也一共只有三个。非常好奇经常换笔记软件的人是怎么管理的……\n\n最开始用的是印象笔记，用了3年多吧。当时 markdown 还没有卷起来。印象笔记剪藏确实是挺好用的。缺点也很明显……富文本格式，当时对代码块十分不友好，markdown 支持得太晚了，要是支持得早点的话我也会继续用的。如果是有大量媒体附件的行业，印象笔记到现在也还是不错的选择。\n\n印象笔记总在宣传 All in one，我也信了一段时间的邪，拿它来存微博的图。现在觉得不如系统的文件管理器。\n\n用了一段时间的 mweb，没有记太多，好像一共就 80个 md 文件。这个不是所见即所得的，始终感觉不是很好。后来换软件时，这些笔记基本都因为难以一键迁移原因，大多留在了原本的平台上。现在对待新工具的态度非常谨慎，能不换就不换吧，简简单单才是真。当时 markdown + 文件管理的软件当时也不是很多，IA writer、 Ulysses 又太贵了。\n\n后面 notion 公测了，不得不说 notion 确实很强。但我是拿它当数据库用，而不是记笔记。notion 更方便管理，而不是记录……虽然也可以记录，但是如果作为一个笔记软件，它还是过于复杂了，页面切换速度也太慢了。\n\n被 Antarx 荼毒了双链后，开始用 logseq……为什么不是 roam research，因为穷啊（划掉）因为数据又是存在平台上的，rr 的结构又做不到notion的扩展程度和量级，但价格太贵了…… notion 一月 5 刀是可以接受的，但是 rr 记得算下来是每年要 1000 多 CNY 吧……哒咩，红豆泥\n\nlogseq 的笔记又是船新的了，没法把 notion 里一些零散的笔记迁移过来，而且就算 mweb 是本地markdown，格式转换也很麻烦。logseq 虽然用了本地文件系统，但完全抛弃了树形结构化的管理（讲真我不明白为什么 namespace 不直接目录结构，还不一样）。反正早就是污染了800遍的 markdown，和 obsidian 共用起来十分糟糕，倒是觉得 logseq 也大可再做得狠一点。\n\n在 logseq 中，分类是由页面元数据和 `pages tagged with xx` 完成的。还有大量的空白页，专门拿来看 backlink 的。这两块基本就代替了传统笔记中分类整理功能。\n\n我也不会拿 logseq 写长文，大纲模式的层级关系和长文很冲突，长文一般意味着要发布，基本还是用 notion 写的，写完不会再看一眼……大纲模式写的内容太随意了，几个月后我可能不知道我当时在想什么，笔记就是这么随意的一个东西。 logseq 复习的时候体验非常棒，想不起来的点进去就可以了，相关的所有东西都能用得到有效的复习。\n\nlogseq 的界面设计是非常的草台班子感……我觉得这不是去套一个设计系统可以解决的事情。设计系统只负责统一，用上设计系统还在写灰色 modal 套灰色 modal 这种层级，真的救不了……\n\n哦对了，剧本也是长文，但不发布，还是大纲写的。剧本真的非常非常适合大纲和块级白板，没有之一。obsidian 和 logseq 的大纲模式写剧本都很好用。对我来说，obsidian大纲的唯一问题是代码块编辑太拉了，用 obsidian 的意义只有一个…… Excalidraw 最好的客户端。\n\n总体而言，现在的 markdown 笔记多了三个常见的语法，其中后面两个是无法与 published markdown 兼容的关键。\n\n- yaml 数据头\n- `[[App内文章链接]]`\n- `#标签链接`\n\n","tags":["工具"],"imgsmd":[],"sourceFile":"002.md","csrIndex":[7,1]},{"id":"2023-12-26 19:13:52","content":"\nwindows 上 fallback 到 monospace 的中文怎么是宋体啊我服了爸爸。  \n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[7,2]},{"id":"2023-12-22 18:47:22","content":"\n易用的 Vlan 工具 [EasyN2N](https://bugxia.com/357.html)。用来 steam 共享库局域网联机。但朋友才是最高配置。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[7,3]},{"id":"2023-12-17 15:50:20","content":"\n好想画画！但哒咩……长久以来都觉得一画画就有罪恶感。真的不要老给人传输什么分清主次一类的思想，因为是个人都分得清，什么事情对人生有利什么没利难道会不知道吗？但如果不停地强调这一点，只会让人觉得自己不配做除了工作外的任何事情，如果想做，第一个念头是转行去做。但能转行吗？不行，根本没有进行足够的专业训练，并且也因为会有摸鱼的罪恶感也没法进行长久的训练，一天画4个小时就觉得已经很花时间和精力了，但写代码一天12小时就觉得正常。这就是两难。要问我水平真的一点工作内容也画不了吗？也不是，什么工作都有门槛低的部分，但这样的水平又达不到我的期望，我又不是那种对于自己的事情可以随便糊弄过的人……虽然不是很高的期望，因为每个领域都有我不能看懂的部分，但我能看到的，也是达不到的。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[7,4]},{"id":"2023-12-17 15:42:18","content":"\n用 sunshine(windows) 和 moonlgiht(ios) 搞上了steam的串流以躺着打游戏。躺着不论干什么都比较容易睡着。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[7,5]},{"id":"2023-12-10 08:20:20","content":"\n互联网平台没有记忆，再也找不到从前的消息，域名更新，API更迭，连日记和笔记软件都换了一个又一个，点开就是404，但我有想记住的东西，所以会建立博客和仓库，让他们不要轻易消失。个站和常驻平台是不一样的，像是手账本一样，从零开始一点点构建出一切，不受任何的限制，做成什么样取决于自己。这也是为什么我坚持渲染成静态博客，因为动态的服务持早会关闭，随时面临着service down。但静态的已经是最终的成品，就算有一天我死了，它也将永远在那里，直到大公司们全都消失的那一天。\n\n说来这个博客已经有7年了，当然我没怎么用，因为也没什么好写的。我灌水写得很多倒是。但是 dayone 怎么说，这些别人维护的软件，感觉总不是自己的。而且一换电脑，东西也都会没有。网易博客和新浪博客有小时候写的文章，太黑历史了算了吧，不整合了，反正也是快倒闭了嗯……\n\n我也一直对markdown的图片和文字不能一起放不开心，但是没啥办法的事，不是一个模态的编码不能统一就不好做，除了硬编码也没有什么比较好的解决方法。除非哪天有什么新的格式，不再是.html，而是.canvas，可以一个文件存不同模态的资源不用到外部获取，就有可能吧…… `.textbundle`也主要还是本地的\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[7,6]},{"id":"2023-12-10 06:42:56","content":"\n#故事 写点关于oor的taka的故事，《东京都星二代滚男养成记》，每一段都有参考他们出道以来的视频和采访，符合事实就是我看的，不符合事实的就是我编的。\n\n练习时长三个月的东京都星二代 taka，在叛逆期离家出走，有着仿佛刚噶人但也毫不在意的眼神，仿佛世界的一切游离在他的生命之外。他出门都穿着一身土豪气质的亮片衣服，带着镶满水钻的手表，他自己也不知道为什么，也许是想彰显自己的成熟，也许是过腻了平凡的生活，想与众不同。\n\ntaka 16 岁离家出走后，在餐饮店里打工。他加入了一个翻唱乐队。乐队第一次开live时，需要找足够多的人来观看，通常是朋友（参见孤独摇滚的情况）。但 taka 不认识几个人，于是不管认不认识，打给了电话簿的所有人。朋友介绍了正在组建乐队的 toru。 \n\n此时 toru 正在寻找乐队的主唱。在第一次live 结束后对 taka 的声音难以忘怀，Toru打电话给taka说：“我也在一个乐队里，所以如果你愿意，就来和我们一起玩吧。我们一起玩吧！”\n\ntaka 说，我也在乐队里，所以不太……\n\n但第二次开 live 时，toru 又来了。\n\n之后 toru 的天天来他打工的店里，一遍又一遍地说，说我们一起玩吧，从晚上说到早上。taka 之前也没被人邀请一起做什么事情，内心很高兴，招架不住这么用力的邀请，从了。\n\n他依然留着他的胡子，穿着闪闪的亮片衣服，半夜和 toru 一起去了 toru 乐队的练习室。所有人都吓了一跳，toru 没有提前告知他捡了个主唱回来，而这主唱一看就不是什么好人，初印象糟糕透顶。但 toru 是队长，那天 taka 就这么突然加入了乐队的练习，初练习室感觉一切都是那么新鲜，那天的练习进行的意外地顺利。但接下来很长一段时间里，内向的贝斯手凉拖都不太和新来的主唱说话。\n\n但渐渐地，taka 在乐队中找到了归属感，把乐队当作了他的家人，也脱掉了他的亮片衣服。他们作为乐队出道后，首次被问到 taka 相关的第一印象时，他已经和从前判若两人。主持人听了都是一幅难以置信的神情。而这时候的茉莉酱(taka)带着鸭舌帽，把头埋得很深地用力地点头，帽子遮住了他的脸。他下意识地不想让镜头看见这样他，他不喜欢媒体，从前被媒体报道总是负面新闻。但是一直这么点头，也太不自然了，于是 taka 做了一个美空ひばり的经典不死鸟的造型，开着玩笑带过了。\n\n后来 one ok rock 在武道馆开了live（武道馆对于乐队有一种特殊的意义，能在武道馆开live象征着乐队受到了大家的认可），在全国巡回演出，和世界各地的乐队与音乐人合作。时至今日，taka也常常提起，如果不是toru，他不知道自己现在可能还在哪里鬼混。\n\n凉拖说把乐队比作家庭的话，toru 像是爸爸，taka 像是妈妈， tomoya 是一只可爱的 pet。在世界巡演时，有时候在路途中需要乐队自己做饭，茉莉酱总是喜欢做饭给大家吃，由于打工经历，他做的饭也很好吃。毕竟，taka 如果不是做乐队，第二理想就是开饭店。\n\n……没素材了写了，我也只是突然发现，从只言片语的采访中，taka的故事线突然连起来了，越来越清晰。当然在我心中，这可以编成另一种走向的故事。无所谓，同人女会自行脑补。\n\n","tags":["故事"],"imgsmd":[],"sourceFile":"002.md","csrIndex":[7,7]},{"id":"2023-12-07 04:52:48","content":"\nGawainx 毕业啦，毕业快乐。\n\n另外一位 b 站认识不久的网友也快了。那就提前毕业快乐吧，有机会我也想认识三次元的 enfp 哈哈。\n\n在线好友: 1 今年6月已经毕业啦，要留学啦，读博后啦，恭喜。\n\n本来这里又打了一堆话，算了，为了避免以后社死，还是删掉吧。\n\n祝你们毕业快乐。\n\n> ぼくの善意が壊れてゆく前に  \n> 君に全部告げるべきだった  \n>\n> 夜が降りて解けての生活に  \n> 混濁した気持ち掠れる燈\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[7,8]},{"id":"2023-12-07 00:21:41","content":"\n突然对 logseq 插件没兴趣了……头好痒啊，好痒，得洗头，但澡堂开放时我全程在睡觉。最近睡得有点子过多了，每天能醒不到 10 小时。\n\n喜欢听很萌很快乐的歌。虽然听起来有点变态，但我是很喜欢萝莉音的，不是很刻板尖尖的萝莉音，而是『ユイカ』那样的声音（年龄感再偏小一些）。我也喜欢小女孩子，小女孩子能穿得简单很舒服的那种造型就更好了。我也喜欢听摇滚，和二次元特定风格的温柔男孩子。古典在想提升逼格时会喜欢听，但日常还是想轻松一些。最不喜欢的是节奏重复的土嗨舞曲。\n\n我喜欢不被人关注，喜欢当边缘人，但也喜欢所有的朋友。我其实也很喜欢舔但前提是舔的人不会在意我在舔（于是只能赛博舔网友）。我不喜欢被夸奖，但喜欢被理解。以上，这就是三水的自我介绍了，或者说是事故介绍吧，哈哈。\n\n对了，sansui 其实是三水的拼音，这个角度来说我也是实名上网，但不想被熟人一眼认出来所以去掉了翘舌音，所以我也不知道要怎么读，每次默念都是嘶……233，挺怪的 id。\n\n","tags":[],"imgsmd":[],"sourceFile":"002.md","csrIndex":[7,9]}]