[{"id":"2024-09-03 09:31:00","content":"\n看到一个交互的仓库：[veloxijs.com](https://veloxijs.com/)。瞪大了眼睛……其实 react-spring 做动画也好用但缺交互事件，交互要额外绑。而我觉得其实绑交互才是最麻烦，多平台有区分，还要干掉一些和原生交互冲突的问题……我在那手撮交互和动画算什么！！不过一看打包体积 50 多k，那还是手搓吧，按需手撮 5k 不到……\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[8,0]},{"id":"2024-08-26 10:48:17","content":"\n推荐短篇漫画[小狐狸化形记](https://weibo.com/5790748645/Otq6Td0Jm)。在作品要么连篇累牍的设定与废话，要么网文快节奏模板的时代，已经感觉已经好久好久，没有看过这样能写进教科书一般的，剧本了。\n\n二游的剧情其实我都看不太进去，大概就 fgo 2.6 还行，1.6 已经不记得了……然后原里枫丹审判看得还行，没有逻辑 bug 已经万幸了，要有代入感就算了。二游太注重打造异世界和卖角色了，但**代入感反而是要能映射现实才会有**…支线有不少抄名著的但抄得很生硬，反应人性不是故意写脑子有病的家庭啊喂。\n\n枫丹把矛盾归结在了“天理”上，为了解决“天理”的问题而选择牺牲自己，算是非常讨巧的做法，这是一种“虚构的矛盾”，虽然不符合现实但是非常符合异世界卖角色的二游。\n\n崩铁 2.3匹诺康尼大立意很好，但小分段上也还是在卖异世界社达体验，观感上最好的是只为剧情服务的星期日……他出场不多（物理）却有非常多真实的侧写，一是和妹妹的互动，二是有领导压力和家族派系之间的压力，三是有真实的动机——想人们能快乐摸鱼。这些和异世界结合也没有违和感。大部分角色做好一个点就不错了，砂金做好童年创伤就大卖特卖…说到底还是大部分二游角色过于扁平，没有现实的复杂度支撑不住。\n\n然后这也可以解释崩铁垃圾桶会塑造得很成功。首先主角独特的捡垃圾 xp 就逆天，其次“垃圾”这词在当代象征了太多。垃圾除了能指人，还有十连抽出“金色传说垃圾”嘲讽了抽卡。垃圾桶的外形和战斗机制也足够搞笑……符号比角色好出效果可太真实了。\n\n然后说回 fgo 2.6，厉害的点就在于每个人都是活的，矛盾和动机是真实且鲜明的“人之间的故事”（指抽象的人）。明明都是异世界卖角色，蘑菇怎么写出来的……可能是 fgo 最不需要的就是沉浸感吧……对于看剧情的玩家，只要脱离沉浸感，纯写剧情反而结果会好…\n\n古剑三也挺好的，很明显这也是不用代入主角的游戏，有沉浸感大概是本土文化滤镜吧。玩基于西方神话种族体系的就不行，代不了。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[8,1]},{"id":"2024-08-23 10:48:53","content":"\n屏幕调白平衡的软件 https://justgetflux.com/ ，才发现我最适应的色温大概在 5700k。标准的 6500K sRGB 对我来说太刺眼了，看不了太长时间的蓝光+高饱和……\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[8,2]},{"id":"2024-08-23 08:18:14","content":"\n虽然但是，ppi 小于 200，一般场景还好，但一开始涉及打印，看小说一类的，就不免会和现实的媒介比，win 这不上 4k 屏感觉真眼瞎……什么，16寸的2.5k屏 ppi 还不够吗？你好，是的，真的很明显，被虫啃了。\n\n另外，把网页的字体 fallback 换成了方正兰亭黑Pro，字形真的前所未有的顺眼……微软雅黑就算改进过的也还是烂……不过 hinting  做得最好的还是更纱黑体。思源的 hinting 是一坨了。\n\n关于 #博客 搜索，有考虑改数据库存储的方案，方案早就有想好了，客户端的接口形式也预留了，现在的 memo 就是数据获取的其中一种实现，非常的 CSR。剩下的就是看能不能找到靠谱且没那么贵的服务了，个人博客的 hosting 没什么流量，我也不是很常用。说来其实 memo 想存数据库主要是考虑搜索，目前的全文搜索真的很全文，都没有索引的……虽然写了三年的废话大小加起来连500k 也没有，长文那边 100k 也没有，完全不必担心……\n\n个人一生能写的字数，大概除了写小说的，做成搜索的话用无索引全文搜索完全够了……我好像十四年的微博7000条了吧，可能 50-80 万字。memo 差不多有十万字，但搜索起来感觉就是瞬间无延迟，连 Searching 的状态指示都看不到……最大的时间消耗在第一次获取搜索数据上，也就是网络延迟……而且不是全文匹配，结果一旦符合就中断相应条目的匹配，搜不到时才是用时最久的，也用不了几秒。这么一说，个人博客废话再多也还是没有必要上数据库……实在久了就加上，只搜最近的500条所有带 tag 的条目……然后以后的处理器会越来越好，感觉远远大于，人的废话膨胀速度……\n\n","tags":["博客"],"imgsmd":[],"sourceFile":"003.md","csrIndex":[8,3]},{"id":"2024-08-18 00:30:21","content":"\n跟着一梦徽州教程一步步摆做了几次后，突然就会变得会设计家园了……对于信息密度的把控与刻画细节，是可以通过重复临摹提升的，如果要走商业风格，前期多临摹很有用，真的。\n\n另外谢谢谦谦……虽然自己还是很菜，但少了一些，再学什么都不会有所改变的想法。\n\n真的不能总是让某些人狭窄的人生观去占据脑子，当把人考虑为一个定量的因素后，人才真的变成了一个定量的因素。但本不应如此，不应由过去的经验塑造未来，而应由当下。总是看别人、看过去，情况不会有任何改善。对未来做出承诺也是不可能的，只有看着过去决定未来的人可以对未来做出预测，想要有改变那未来必定难以预测。\n\n所以请不要使用过去决定未来，会真正完全地丧失掉应有的活力。悲观的是简中的大氛围都是这样，存在着“无法赎清的罪孽”，甚至虚构的角色都不放过，比如散兵。\n\n然后去了听 logseq 在 discord 的直播……全英文还是，可怕！只有在带耳机、网络好、对方没有很含糊不清的情况下比较听得懂。那个提问的有一点点印度口音的说话比管社区的人听得懂一些……很难想象这样要怎么面试啊啊啊啊！\n\n我自从没什么机会说话后，又因为唱歌狂念日语歌词，中文已经说不太好了，稍微快一点舌头和口腔就会不听使唤，然后结巴……最近过剧情的时候都有意开始念台词了，像小学生一样，念不顺的词就重复念，练中文发音会用到的肌肉，特别是 ji 和 yi，舌根处用力把气流收得很窄，标准发音时会口吃，如果是说南方口音就不会口吃。才发现其实配音说话都很快，又快又清楚。天哪之前根本没觉得把话说得快而清楚是需要努力的一件事，我 18 年的视频说话就是又快又清楚的……落泪了\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[8,4]},{"id":"2024-08-05 23:28:21","content":"\n才发现代码随想录的题解是相当个人的，废话超级多而且不说人话。KMP那里才完全感受到，一直在套名词定义，但其实直观解释两句就能让人明白，但就一直搁那里套定义，然后为了定义准确说了一堆废话。我感觉自从我做碎片化笔记后就变得不太会写教程了，我还是要努力去变得直观一些，多加一些图！\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[8,5]},{"id":"2024-08-01 17:45:27","content":"\n解决 2024年 windows 只能设置一个字体的应用们的无衬线中文还是优先 fallback 到新宋体的问题：去注册表，`HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\FontLink\\SystemLink`把 Microsoft Sans Serif 中 SIMSUN.TTC 那一行去掉……服惹 win7 就有微软雅黑了留着宋体 fallback 干嘛……还是说他们也知道微软雅黑的正文阅读体验很差劲……但宋体不搭更差劲啊！\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[8,6]},{"id":"2024-07-27 12:46:49","content":"\n找工作真，真难。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[8,7]},{"id":"2024-07-26 00:56:31","content":"\n微软的那个 noble scarlet，汉字部分据说是方正兰亭黑Pro，但今天把几个网红正文黑体拿来对比了一下，就网传版本来看，只有非 regular 字重基本像兰亭黑 Pro，regular 像是调整过中宫的微软雅黑，和兰亭黑 Pro 有显著的差别……是说经常感觉一加粗怎么小了一圈。整体还是最看得惯苹方只是字重少了点。\n\n一个若智的锐评：\n\n1. 思源黑体系列，风格不太统一，字一多了感觉在各写各的，大字时更加明显。比如看“易”的两撇写法非常机械直几何化，“因”的中宫和笔画也是怪怪的。但在开源黑体里就是最好的了。更纱黑体的数字比思源原版搭一些。\n2. 汉仪旗黑系列（米，菊厂），小字会显得更圆，非常国产 UI 味，大字时尤其 UI，用来看小说会缺少人情味。\n3. 方正兰亭黑，汉字看着很舒服中正，数字太夹了。\n4. 微软雅黑，依然是大中宫和小字间距问题……\n5. 苹方，偏细，缺少字重，除此以外完美。\n\n\n","tags":[],"imgsmd":["![网红正文黑体](https://img-cf.sansui233.com/imgs/2024/07/202407260100518.webp)"],"sourceFile":"003.md","csrIndex":[8,8]},{"id":"2024-07-25 23:11:48","content":"\n最近一到晚上就容易哭，看曾经的照片也很容易。一是从没感觉到原来时间可以流逝地那么快，二是因为我猛然意识到我再也找不回那种很想做一件事情的感觉了。长久以来，一切自以为的个人意义与价值被无尽的论文写作与社会性焦虑所消解，传递出“没有文凭你什么都干不了”的话。或许一直在工作的人不会这样认为，认为这是个思维陷阱。但这种无价值感反而只有长期没有进入工作产生才会产生。我大概就是那种不工作或不能帮到别人就会觉得自己毫无价值的人，不管网上努力说这类人要多在意自己多考虑自己想要什么也没用，大概放到原始社会是死得最早的那类，真感谢投胎到现在的家里让我活到现在。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[8,9]}]