[{"id":"2022-12-11","content":"\n人固有一阳，但为什么要阳在体检之前？\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[8,0]},{"id":"2022-12-03","content":"\n之前有妖气要关停，写脚本下了个漫画来看，当时就想着测试一下，其他漫画之后再下。结果后面给忙忘了，直到昨天微博有人戳我说前端页面里没东西了，才发现已经关停了，啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊！但 oss 其实还在的啊！但是服务端渲染已经爬虫不了了啊啊啊啊啊啊啊！\n\n上面有一些作者是从小关注到大的，还有一些冷门但好看非商业漫画的作者，作品就没发布过别的地方，之后也不会迁，永远都看不了。我之间下好的是一个话数很多，但不算很冷门、别的站也还能看的漫画。以后先下冷门的。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[8,1]},{"id":"2022-12-03 01:19:24","content":"\n通宵了两天了。 今天是第三天。\n\n对于写文章，要是我不了解，字数往往是不够的；要是我很了解，字数往往也是不够的，因为“连这种基础中的基础也要讲？”；只有当半了解半不了解的时候，字数才往往是会超过规定的。但一天也是写 600 字就差不多了，又不是文学或者纪实，600 字已经足够说明很多东西了，一页 ppt 的 80 个字很可能是我看了四五篇论文和无数网站才写出来的。\n\n室友在打地下骰子城，一个 rough-like 的棋牌游戏。类似的我之前打过月圆之夜，小时候还挺喜欢打算的，但目前来说对小游戏不太感兴趣了，还是喜欢 RPG，所谓的“大作”。明天应该便携基座能到，两个人的宿舍简直是游戏快乐屋。但是我也没见过比我还能宅和熬夜的（如果不是写文章我也熬不过她），而且微软现在是居家办公，她现在还没办入职约等于放假……\n\n明天……啊不今天是周六来着……最近两个周根本没休息过好吧，面如土色。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[8,2]},{"id":"2022-12-01 06:19:08","content":"\n写完了一版。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[8,3]},{"id":"2022-11-24","content":"\n真他妈烦，400 字不到就可以说清楚的架构，为什么要用 1400 字写？多出一堆废话有意思吗？难道答辩组老师会没学过 ML 基础吗？知道的人都知道是怎么回事，能简明的大白话说的非得说成任谁看了都得吓一跳的诘屈聱牙的文字，淦。\n\n一个小时过去了，用尽全力编了 400 个字。还剩 2500 字和 5 张图，ddl 还剩一天，时间效率为 50%。熬夜吧，熬夜也不一定有用，狗屎写不成金子。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[8,4]},{"id":"2022-10-27","content":"\n首页：樱井孝宏出轨十年。哦又是什么不认识的娱乐圈……啊谁？？ 555梅林你怎么这么惨，被削弱后还拿出来抽，现在声优也塌了😭\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[8,5]},{"id":"2022-10-19","content":"\n刚用 Rust 起一个简单的 webserver 服务器用……麻了，好麻烦。交叉编译都有 rustup 了，为啥还要自己手动配置 linker ……自带库都偏底层，封装得比较好的库都在社区需要一定程度熟悉，还有很多轮子没有。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[8,6]},{"id":"2022-10-15","content":"\n昨天在 Reddit 上吃完了 Stable Diffusion 社区的瓜……好……好精彩……真是抓马……很难说谁对谁错，站的角度都是自身的利益相关，对于想创业的人遇到AUTO这样的黑客（广义）自然会非常讨厌，但在普通人角度肯定会更喜欢AUTO这样的人。\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[8,7]},{"id":"2022-10-12","content":"\n1. 感觉论文看久了，已经忘了写工程什么感觉了。虽然说还是在Colab运行一些python，小爬虫也要用啥就写啥，写起来也够简单，但我一直不认为 python 适合写工程项目，它更像是一个给用户用的 App，我连发布的兴趣都没有，一堆小脚本有什么好发布的，虽然可能有人确实会用到它，但也不想自己的仓库里被这些赶一时需求的小脚本充斥，并且又要花时间去做宣传、提升别人使用的体验，总体来说不是那么喜欢一直混这种圈子，混过知道是怎么回事，不是我想要的，就可以了。\n2. 感觉过程的简洁与需要高度自定义的工程天然有一些互斥。毕竟工程上造轮子还是比较重要的——如果你期望自己的项目能减少维护成本，不想在下次维护时显示一大堆的 deprecated，也不想在项目越来越大时因为众多依赖问题变成代码屎山。\n3. 如果需求有剧烈变化，技术肯定也会激进地变化以适应新的潮流，这个无法改变（而且强迫症会喜欢用新的东西）。再者，没有需求也会创造需求= =提升效率的方式大体来说有两种，一是在一套什么都能干技术上吃到底；二是学习更新的、能快速应对新需求的技术。很难说谁好谁坏，到最后能留下来的还是一套抽象的整体思路与经验。\n4. AI绘画最近火了，主要是冲击到了商业二次元圈子。其实我觉得还行，毕竟那种风格我刚买板子两个月就能画，做了个蕾姆的作业首次被问约稿（但当时日语我看不太懂……）只要按照流程画，有合适的参考图，一定能出那样的效果，但比 AI 慢多了。商业的画风需求就是那样，怎么画出高完成度高精度的图，是非常成熟的、流水线东西，真正有价值的设计感、美感是需要长期培养的，自己探索的过程非常漫长，而且没有商业风格那么好看。但我感觉我的基础确实在变好，也对于当初的目标“有镜头感和故事性”更进了一步，也由于时间和基础限制，完成度始终上不去。是不是应该补一下结构素描……而且因为这我给 colab 充钱了，发现我也不是很喜欢玩，就是纯粹的抽卡游戏，不知道生成来干什么，当参考好像又不如找人画的原图。\n5. 想出一个测试题，看多少人能分清 AI 画的和人画的。但又觉得，还是先写毕设吧。每次想做什么的时候，就是一句，“还是先写毕设吧”……无奈。其实如果以正事做不完为理由，有的事就永远没法做了。问题是情况比较特殊，这个正事是属于我没办法集中精力去做的，经常坐了一下午也就集中不到 20 分钟的精力，真正在产出的时候也就那么几分钟，要是是能够好好投入状态的工作也不至于这样，从前双开三开也不是没有过……所以一定要找喜欢的工作，讨论的气氛也很重要，工资和待遇都是其次的饿不死就成\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[8,8]},{"id":"2022-09-30","content":"\n如果不移动办公，用是单独的显示器，下一台电脑想买 win 了，macbook 实在性价比太低了，还有一些打死也不会出 mac 版的软件。CSP 从买断变订阅的操作实属背刺到我了，主要是买断也不便宜，当时 6 折买的也花了 800 块，这买了不到一年，大版本就要变订阅，而且订阅价格也是不便宜，ex 一年 1400，pro 一年三百……我不如用 sai2，15 块拼车买断使用。而且 PS 也不是不能用只是现在的电脑用起来太卡了…… iPad 挺好的就是颈椎病……\n\n","tags":[],"imgsmd":[],"sourceFile":"001.md","csrIndex":[8,9]}]