[{"id":"2024-02-21 01:24:14","content":"\nwindows11 看不了 psd 缩略图这事也困扰了好久，之前搜知乎，软件支持也只到了 windows10。然后也没怎么管，反正我都是会导出一份当预览。然后今天突然还是想解决一下，也不想下载 bridge，于是用英文找了找，reddit 上有人说 honeyview 就有……妈的遇到救世主了！\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[8,0]},{"id":"2024-02-19 03:43:16","content":"\n给冰凌输入法改了个皮肤，名字直接叫果里果气算了。虽然我数值是准的，但渲染出来像素级对不太准，另外压缩后有被染色emmmm……还有内圆角的弧度、序号的排版是没法改的，圆角就算能改也不是外框的 squircle。不过因为实际使用中很小，勉强能看吧。\n\n\n","tags":[],"imgsmd":["![果里果气的皮肤](https://cdn.jsdelivr.net/gh/NamiLing/upic/picgo/202402190342598.webp)"],"sourceFile":"003.md","csrIndex":[8,1]},{"id":"2024-02-19 00:42:23","content":"\n下午坐下没多久开始腹痛，一看果然是周期提前了。  \n然后到 0 点时好了一点，想我又整整一周什么都没做，突然心情变得很烂。一边哭一边打开了论文。  \n然后又开始胃痛了。  \n像是跑步一过300米就整个胸腹岔气了一样，半边的肋骨和腰在刺痛。现在看来果然是岔气了。  \n大概我的愿望就是以后工作时不要被各种奇怪的身体现象影响到吧。  \n\n躺在床上时经常在想，要是可以直接在床上舒服地用电脑。这样躺着时也可以工作（？）  \n听起来有点变态……  \n但仅仅是我受够了想做什么都没法做的感觉了。不论在什么阶段都不会改变。这个枷锁由外而内、由身至心，安上了。平心而论我家真不算真的很烂的家庭。虽然没有多好，但要比烂还是远远不能入围。  \n\n我接触的人大多比我有钱，要么就是容易变得有钱。我并不是想说因为没钱焦虑，而是我本身除了性格以外的所有圈层，都不属于我能接触的。我最好是好好打工赚钱就能乐呵半天的人，旅游开心，买东西开心，打游戏开心。但我不是，我一定要学到我想要的程度才会开心。\n\n之前报画画课时，我只想画完作业，硬拉我出门去野营，我当时真想发疯。抽空画基础作业的时间已经很勉强了，dlc 画都没画。如果我是学画画的，那我想起码得双开课，整天只用画画和吃饭就行了。\n\n报色彩班长时，同学说没想到你竟然为了画画早起……其实画画很累的，而且自学的练习只能说是对技巧性的东西有用，到后面发现环境和良好的美术指导，比练习本身重要。如果再要提高，真的得去模拟画项目了，又要花费巨量的时间。我不喜欢为了没有目的的练习，但一有目的就容易猛练花掉过多时间，因为觉得自己什么都不会。如果连练习时间都不花怎么可能达到专业画画的水准。\n\n真的是开心吗，不如说是安心吧。和我性格最像的朋友也是这样的。不如说愿意和我做朋友的人，都是看中了我喜欢学习，他们也都喜欢学习。如果是更聪明的卷王，也是我接触不到的了，我跟不上。我也不会去硬凹我能力范围外的东西，不是长处干嘛卷。\n\n我并不想顾虑太多事情，容易变得束手束脚。但东亚的教育就突出一个什么都要顾虑。我和我堂弟讲完，真是想抽自己一个大嘴巴子。我发誓以后再也不讲了。  \n\n只要不解决对论文的 ptsd，ddl 就会永远没用。\n\n算算，哭了有50分钟了，这对于我是见怪不怪了，不知道是对于别人是正常的吗。其实并不是很难过。有个网友也说她不太允许自己哭，觉得是瞎矫情，我可以理解。但我纯粹是觉得哭得也太特么久了，影响我干事。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[8,2]},{"id":"2024-02-18 01:19:32","content":"\n关于 #obsidian 的插件： make.md 改变管理仓库的展示模式。我觉得很好。缺点大概是同步起来费流量，iCloud 杀手。对于我而言，基本上算是可以代替掉 dataview 了和 Journal。非常强，可以写长文也可以写碎碎念\n\n关于 #五笔输入法 ：我一直很头痛 windows 上的五笔输入法没有一个可以像清歌那样方便的自造词。但现在发现冰凌五笔输入法有！而且还有一个临时造词功能，对于打词组的用户来说真的是太实用了。只要没有 bug 这个输入法就是我的新爹。\n\n","tags":["obsidian","五笔输入法"],"imgsmd":[],"sourceFile":"003.md","csrIndex":[8,3]},{"id":"2024-02-16 00:17:38","content":"\n#书 看了[《垄断的困境》](https://1q43.blog/post/766)，写得真好，我挺喜欢看这类文章的。\n\n我在三天前定下三天看完的代码，今天开始改的计划。\n\n第一天，我一个人在家看了不少。\n第二天，我在吃饭。\n今天，我在吃饭。\n我恨吃饭。\n\n我想变得会写小说式的长文。\n\n","tags":["书"],"imgsmd":[],"sourceFile":"003.md","csrIndex":[8,4]},{"id":"2024-02-13 16:01:25","content":"\n #沉思 感觉手游攻略是非常会引导玩家氪金的存在。我开始玩O神的时候，最开始很大的乐趣就在于拿着垃圾越级打雷电将军，就像玩塞尔达时3颗心练人马一样，算是玩法上的乐趣。但是在攻略里，这个配置是打不过雷电将军的。并且大部分的推荐配队都是两个以上的五星角色，只有一个角色的就要算低配。\n\n以我自己为例，4.4 纳西妲卡池两周，有春节活动加成，全期抽到大保底（180抽）才出了一个。如果要做到攻略里推荐的低配组队“草行久”，至少需要3个纳西妲，更不要提行秋和久岐忍还得各抽5个。完全按攻略组一个队，在不氪金的情况下至少半年。如果去追求这样的玩法，对大部分人来说和坐牢没什么区别。手游为了维持运营，大培养周期可以设计到按年算。\n\n即使是开服就开始跟的游戏也是如此，只要是抽卡为核心的游戏都逃不过的命运。\n\n这也导致游戏性本身打折扣。因为设计游戏性是折磨开发者的，想了很久的创意转眼就被玩家体验了，并且难以找到持续的利润点。但设计重复关卡、加大角色培养周期是折磨玩家的，玩家为了达到目标不停重复刷刷刷，再为了收益最大化去氪金。O神的游戏性做得本身也不是很强，设计低龄化，要么是一看就懂，要么是捉迷藏找找找这类我最烦的玩法，机关设计得很简单，但自造词太多，教程一眼看过去基本不知道在说什么。很少有觉得“哇，好巧妙的设计”的情况。\n\n","tags":["沉思"],"imgsmd":[],"sourceFile":"003.md","csrIndex":[8,5]},{"id":"2024-02-09 00:34:23","content":"\n#沉思 在思考创意性思维会不会和处境有关。感觉是有的。不完全有，和性格也有关系。有的人天生屎一样的想法就很多，称为A，有的人无论在什么环境下也不会有别的想法，永远直达目的，称为B。大部分人是两者的折中，会随着环境改变，但有一个改变的范围。通常 AB 是对立的小人，A 强 B 弱，B 弱 A 强。但如果 A 和 B 都很弱。对不起，我不知道有什么办法。A 快熄灭了，B 则本来就很弱。今天吃饭吃到了没煮熟的米饭，我知道没煮熟，但我吃完了，什么都没说。已经到了连目的是吃到煮熟的米饭都达不到程度了，目的大概只有一个：吃了不会生病吧。\n\n看着大人对着我表弟三年前分手的原因指手画脚也挺烦的，无时无刻充满了一种大人优越感，所谓说教就是在自己的高度上把自己已知的东西拿去凌辱别人，除了巩固自己地位与获得优越感外什么也学不到，西内。别在饭桌上好为人师。\n\n我刻意用了“大人”这个词，有教条式的刻板。\n\n","tags":["沉思"],"imgsmd":[],"sourceFile":"003.md","csrIndex":[8,6]},{"id":"2024-02-08 16:33:43","content":"\ngo 1.22 支持 range 接一个整数了，干掉大半的 for i 三件套 ​​。\n\n还把每个人都会踩一遍的坑——loop 里有协程会变量逃逸给改了。我测了一下。 python3 不用捕获，每个 for 的 v 是不同的实例。JS 和从前的 go 一样，共享 v 的地址。至于 rust，笑死，根本不会有这种问题，本来就要处理所有权，唯一的问题是写 rust 时有种把心里的草稿全部写下来的美……不不不，我其实根本没想那么多，但 rust 会逼迫你想清楚所有的细节。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[8,7]},{"id":"2024-02-04 23:52:59","content":"\nO神，启动！\n\n好吧，看了下，枫丹的剧情真的做的挺好的。\n\n我好困啊啊啊啊啊！！！不过终于可以睡得更久了。难道被认为是精神病是有什么特权吗？我很好哦。堂弟：姐姐求求你和我一起毕业吧。我，好哦。\n\n随处中断的白日。稳定而有安全感的夜晚。畸形的熬夜、睡不醒的疲乏、分分钟和世界爆了的怨气每天重复着精彩。 ​​​我不是多肉，不需要刻意去补充光照哦。\n\n愿意去做的事，有什么困难，都会想办法克服。而不愿意做的事，劝退只需要遇到一个环境问题。\n\n想法太多了实现不过来，终有一天会被各式各样的东西压垮。Ne 人是这样的。Ni 人就没有这样的烦恼。很多时候觉得社会功能上只需要 Ni-Te，其他类型都是需要“被教育”的。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[8,8]},{"id":"2024-02-03 22:01:49","content":"\n虽然树莓派确实降价了，但现在越来越从这些东西退烧了。不太清楚到底有什么需求，这些也这只玩具。虽然我是很想做一下个人的全屋智能方案。但是这个东西有一个前提，就和手游要有素材养卡一样……总体说来就是足够有钱。还有些别的前置条件，在能达成前无法启动。\n\n","tags":[],"imgsmd":[],"sourceFile":"003.md","csrIndex":[8,9]}]